doc/s-sql.org
#+TITLE: S-SQL Reference Manual
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

This is the reference manual for the S-SQL component of the postmodern library.

S-SQL provides a lispy syntax for SQL queries, and knows how to convert various
lisp types to their textual SQL representation. It takes care to do as much of
the work as possible at compile-time, so that at runtime a string concatenation
is all that is needed to produce the final SQL query.

* Interface
  :PROPERTIES:
  :ID:       462ce6d8-f967-4bce-817e-d1762ebfd41f
  :CUSTOM_ID: d1dd840a-aa0d-48ad-9dc5-dbfc2988110f
  :END:
#+NAME: SQL
