doc/s-sql.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-12-23 Wed 17:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>S-SQL Reference Manual</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">S-SQL Reference Manual</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#d1dd840a-aa0d-48ad-9dc5-dbfc2988110f">Interface</a>
<ul>
<li><a href="#d756666d-e8c9-4cf7-b8c3-e1eb3fd2437c">macro sql (form)</a></li>
<li><a href="#0b536aa5-5eb8-4050-931a-51a00d42451a">function sql-compile (form)</a></li>
<li><a href="#e8c97394-061f-40fa-aab7-b620eafa060d">function sql-template (form)</a></li>
<li><a href="#f9bbed09-51bd-44b9-8e6f-9aed91b0cb81">function enable-s-sql-syntax (&amp;optional (char #\Q))</a></li>
<li><a href="#610dec65-be3f-41bb-8b7d-ed814f1ad0a4">function sql-escape-string (string)</a></li>
<li><a href="#2da63be4-c001-43b7-bda0-6e93c780034c">method sql-escape (value)</a></li>
<li><a href="#0be281bd-0fc9-4221-998b-32768ffa2366">variable <b>downcase-symbols</b></a></li>
<li><a href="#a4949071-98e5-481b-8f47-965247b41e2e">variable <b>standard-sql-strings</b></a></li>
<li><a href="#7b4cd6d2-f9bf-4262-a8a8-83f340063adf">variable <b>postgres-reserved-words</b> hashtable</a></li>
<li><a href="#1d66e5f3-fd90-473f-ae0a-bafb336ebc1f">variable <b>escape-sql-names-p</b></a></li>
<li><a href="#fc1a8b3d-0951-4917-b9d9-6b2bb1a0c2ee">function sql-type-name (type)</a></li>
<li><a href="#59c6c567-e01b-43d1-bf3b-b4f40ffb3054">function to-sql-name (name &amp;optional (escape-p <b>escape-sql-names-p</b>)(ignore-reserved-words nil)</a></li>
<li><a href="#ca9a1bf3-0141-42aa-b79d-ee6bd15e0e4b">function from-sql-name (string)</a></li>
<li><a href="#bc78e7be-3439-4f95-b923-47c4b7b2652d">macro register-sql-operators (arity &amp;rest names)</a></li>
</ul>
</li>
<li><a href="#0d0ab8dc-80a6-4dfd-9f01-fb965a40e0dd">SQL Types</a>
<ul>
<li><a href="#df2495f3-0c92-47cc-a62f-8ae473490cb5">type db-null</a></li>
</ul>
</li>
<li><a href="#3db49c3e-75a5-491d-b4df-9efb75128485">SQL Syntax</a>
<ul>
<li><a href="#48d06812-725a-4eee-a132-06aa4f924943">sql-op :select (&amp;rest args)</a></li>
<li><a href="#e0f01ac7-cb3c-4b38-8902-dc4a981a15e8">Joins</a>
<ul>
<li><a href="#40e45849-5e9d-4b4c-830b-53f79f0b21e2">Cross Join</a></li>
<li><a href="#85c25a7d-3660-4d38-85f0-2b9c9dc88684">Inner Join</a></li>
<li><a href="#ee0a6fef-de2f-407e-9cc9-3667de7775dc">Outer Join</a></li>
<li><a href="#3061c378-d2d1-4dda-833a-f1b3f8569018">Left Join</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#95eaa508-3109-45ec-9194-38d9f1b4e098">Defined Operators</a>
<ul>
<li><a href="#1be1a168-6bc5-4df1-acc2-55d4f223d2c8">sql-op :+, :*, :%, :&amp;, :|, :||, :and, :or, :=, :/, :!=, :&lt;, :&gt;, :&lt;=, :&gt;=, :^, :union, :union-all, :intersect, :intersect-all, :except, :except-all (&amp;rest args)</a></li>
<li><a href="#a052228e-bb93-42ed-8939-66d36a6e8cf7">sql-op :or</a></li>
<li><a href="#307eae77-4dae-4e28-a868-55a2dd9aa2eb">sql-op :intersect</a></li>
<li><a href="#026a2773-c17f-4cb2-a86c-34babf8c48a2">sql-op :union, :union-all</a></li>
<li><a href="#4f77625f-4b6e-417d-8b56-d76835d6832d">sql-op :except, :except-all</a></li>
<li><a href="#b3d56cb5-5e5d-45f2-bb3e-3076a02cbe39">sql-op :~, :not (arg)</a></li>
<li><a href="#9966a954-465b-4623-8e42-8b13ce6ea116">sql-op :any, :any*</a></li>
<li><a href="#aa82bebc-cc27-4b8f-b59d-b27b4c788da3">sql-op :function (name (&amp;rest arg-types) return-type stability body)</a></li>
<li><a href="#104689b2-d97e-434f-9abc-706779fb62c8">sql-op :~, :~*, :!~, :!~* (string pattern)</a></li>
<li><a href="#917f42c1-8a9d-4c84-8523-6ee75e98a676">sql-op :like, :ilike (string pattern)</a></li>
<li><a href="#36910254-7f45-4cbb-a68f-bd5733f28bf5">sql-op :@@</a></li>
<li><a href="#9bbb3261-b84d-4a84-8d58-a30c165a0ca5">sql-op :desc (column)</a></li>
<li><a href="#0ea834ca-4deb-4da8-a492-1a73ae626e21">sql-op :nulls-first, :nulls-last (column)</a></li>
<li><a href="#d7692fef-4904-47a3-bdc6-2c697c89f9c9">sql-op :as (form name &amp;rest fields)</a></li>
<li><a href="#9550c5e3-dfb3-4997-9762-ab5eb2f468ee">sql-op :cast (query)</a></li>
<li><a href="#a90093e3-2e1f-4694-825b-eb800103d64e">sql-op :type (query)</a></li>
<li><a href="#353c0984-83e9-490f-b88a-789aacfc667f">sql-op :create-composite-type (type-name &amp;rest args)</a></li>
<li><a href="#bd2e387f-90fb-4688-89db-dadc148886f4">sql-op :exists (query)</a></li>
<li><a href="#6316788c-b2f7-4fd1-bc64-626bea092016">sql-op :is-null (arg)</a></li>
<li><a href="#d9feff95-b4ce-4809-93fc-886abd6b4467">sql-op :not-null (arg)</a></li>
<li><a href="#92a30d4e-ea95-45be-b80c-02f89f00c8ce">sql-op :in (value set)</a></li>
<li><a href="#d7b8aafa-6c0b-423c-82ee-170c9d562fe3">sql-op :not-in (value set)</a></li>
<li><a href="#59c50390-eaef-4dd4-99a6-6615f3d8740c">sql-op :set (&amp;rest elements)</a></li>
<li><a href="#0ba8931b-6937-4ead-8d4e-af8ac2274683">sql-op :array (query)</a></li>
<li><a href="#3add4360-f9c0-4226-b083-ee50e7f0c436">sql-op :array[] (&amp;rest args)</a></li>
<li><a href="#f0db95cd-c5ae-4942-a157-e3bd92fe8453">sql-op :[] (form start &amp;optional end)</a></li>
<li><a href="#9d015a75-4987-4fc1-aa9b-6d17e2253eb0">sql-op :extract (unit form)</a></li>
<li><a href="#afdd292b-e971-4a08-8d11-d441f1813f55">sql-op :case (&amp;rest clauses)</a></li>
<li><a href="#3a29d134-3777-4558-8fbd-4825f3294b0a">sql-op :between (n start end)</a></li>
<li><a href="#8fd9bc96-0ba1-4afa-8cd3-1e1487699c8e">sql-op :between-symmetric (n start end)</a></li>
<li><a href="#7bb48541-f6ee-45fd-96a8-9e3411baeb8a">sql-op :dot (&amp;rest names)</a></li>
<li><a href="#8fd30e57-b1e6-4c96-a5ba-e5fb7e5e0c7e">sql-op :type (form type)</a></li>
<li><a href="#31bb4caa-a93b-43f1-a2ca-c4676602daca">sql-op :raw (string)</a></li>
<li><a href="#f995ea76-dbd8-48b6-9f69-9c27b1c22579">sql-op :fetch (form amount &amp;optional offset)</a></li>
<li><a href="#ea31c6a0-e40e-41e0-9d2e-98eb08da67e5">sql-op :limit (query amount &amp;optional offset)</a></li>
<li><a href="#3254857d-911f-403d-86c2-0d908f9df089">sql-op :order-by (query &amp;rest exprs)</a></li>
<li><a href="#a8c0dd8a-c505-4389-bbcd-48b80346ac9a">sql-op :values</a></li>
<li><a href="#5479e5a3-be95-4fe1-a57c-340a2b99c9d9">sql-op :empty-set</a></li>
<li><a href="#fa3913b4-e12c-4d0c-bf49-40cf2499f9fc">sql-op :group-by</a></li>
<li><a href="#4c93cbde-53ef-4d61-8c4c-acfd2837cec2">sql-op :grouping-sets</a></li>
</ul>
</li>
<li><a href="#186c6802-90ca-448e-9bc5-019dba16c2b6">Time, Date and Interval Operators</a>
<ul>
<li><a href="#53cf3df4-8330-48a0-ac38-2956b91c7d38">sql-op :interval (arg)</a></li>
<li><a href="#d6e950aa-06c6-48ea-82fe-bc97a494aa74">sql-op :current-date ()</a></li>
<li><a href="#87c5bbc8-e73b-4153-aeff-22e934d0f83f">sql-op :current-time ()</a></li>
<li><a href="#137a71a4-920a-4ba0-a8e8-4d60027c4a8f">sql-op :current-timestamp ()</a></li>
<li><a href="#71e1c8be-cc8b-4f63-b3ea-db3b07a5889b">sql-op :timestamp (arg)</a></li>
<li><a href="#749635eb-c348-4caf-bb1a-d5539c05855f">sql-op :age (&amp;rest args)</a></li>
<li><a href="#3bd223c7-e831-4aed-8548-1a9fed07c5f1">sql-op :date (arg)</a></li>
<li><a href="#d56adeb5-4970-4dce-9134-fa57e4970f8c">sql-op :make-interval (&amp;rest args)</a></li>
<li><a href="#84d2e537-b154-4b0f-b9cc-e5125a3e0dea">sql-op :make-timestamp (&amp;rest args)</a></li>
<li><a href="#eeaacf24-8c35-4487-819c-8e90c191a58a">sql-op :make-timestamptz (&amp;rest args)</a></li>
</ul>
</li>
<li><a href="#049f6d6c-0b9e-4734-9322-7f1e6b1ab867">Aggregation Operators</a>
<ul>
<li><a href="#5c3961bb-cee1-41b2-b146-3bda791733ee">sql-op :count (&amp;rest args)</a></li>
<li><a href="#48665fbf-e60e-4cdf-8e9d-028d7afc13eb">sql-op :avg (&amp;rest rest args)</a></li>
<li><a href="#46dfd0b3-e871-4981-963b-739aea4ee9b1">sql-op :sum (&amp;rest rest args)</a></li>
<li><a href="#1ac43f47-1a8f-47e9-a00f-06e93091ec73">sql-op ::max (&amp;rest args)</a></li>
<li><a href="#8e60fdc7-5a1c-470e-a261-1a20eb951041">sql-op ::min (&amp;rest args)</a></li>
<li><a href="#ab71a751-14bd-4741-b617-7c70fa92f646">sql-op ::every (&amp;rest args)</a></li>
<li><a href="#d48c7eda-562a-432e-99ae-d30be866f264">sql-op :percentile-cont (&amp;rest args)</a></li>
<li><a href="#2370935a-ca34-4678-94ac-4ab00ee3217a">sql-op :percentile-dist (&amp;rest args)</a></li>
<li><a href="#3562be1d-bb9a-4f2c-91b9-0f702b28ad87">sql-op :corr (y x)</a></li>
<li><a href="#953ac246-3f0a-4205-9022-4c8b7959a0bf">sql-op :covar-pop (y x)</a></li>
<li><a href="#70244980-e6f3-4a69-bcd2-611a0e9f6f30">sql-op :covar-samp (y x)</a></li>
<li><a href="#cd215fe6-223f-4bfb-828d-5e0f4fd7e464">sql-op :string-agg (&amp;rest args)</a></li>
<li><a href="#97e03db4-7789-4bf7-9b0b-d115046ff4f7">sql-op :array-agg (&amp;rest args)</a></li>
<li><a href="#d01db5a4-eb43-4025-ae79-99191226462e">sql-op :mode (&amp;rest args)</a></li>
<li><a href="#e13eb576-0122-4f37-a562-e17e2ab0139c">sql-op :regr_avgx (y x)</a></li>
<li><a href="#5aa7f48a-7a16-49d8-8430-1e4937d6c28c">sql-op :regr_avgy (y x)</a></li>
<li><a href="#db67bccf-132b-43ce-bf1c-e0067d7bf40f">sql-op :regr_count (y x)</a></li>
<li><a href="#ef9bd421-d14d-4b1f-9ed8-d17e39da6633">sql-op :regr_intercept (y x)</a></li>
<li><a href="#db9ef2ff-7928-4471-890f-3ef70833409a">sql-op :regr_r2 (y x)</a></li>
<li><a href="#88eeb544-9950-402d-95be-5c37875ae64d">sql-op :regr_slope (y x)</a></li>
<li><a href="#8f506e5f-1256-462a-a814-55f690573b41">sql-op :regr_sxx (y x)</a></li>
<li><a href="#410432a6-33a2-4757-9392-f3caacf8fb79">sql-op :regr_sxy (y x)</a></li>
<li><a href="#8c2a625b-8b29-40d7-a96f-d32d9c6a7c3f">sql-op :regr_syy (y x)</a></li>
<li><a href="#14985ca9-ddfd-45b5-81a4-6c372367a7f2">sql-op :stddev (&amp;rest args)</a></li>
<li><a href="#f0893825-0ec3-40a7-8c55-2fb7fbb83e56">sql-op :stddev-pop (&amp;rest args)</a></li>
<li><a href="#71fa53eb-9b24-41a8-aef5-88a2c3d69f7f">sql-op :stddev-samp (&amp;rest args)</a></li>
<li><a href="#4c10fed0-0f57-458a-9069-5c145c4863a7">sql-op :variance (&amp;rest args)</a></li>
<li><a href="#d94ae20b-6b41-44cc-a038-dd6d2c7ff0a9">sql-op :var-pop (&amp;rest args)</a></li>
<li><a href="#50bb4418-560b-468a-8181-c93a96167699">sql-op :var-samp (&amp;rest args)</a></li>
<li><a href="#d301c1e9-2e17-4572-80d0-ead54969a39d">sql-op :over (form &amp;rest args)</a></li>
<li><a href="#4f263804-9832-4210-bf7c-7fce8551f422">sql-op :partition-by (&amp;rest args)</a></li>
<li><a href="#3c8d74c5-b57f-4ae2-9b54-fc19c562cc25">sql-op :window (form)</a></li>
<li><a href="#b3e25bc1-6e1b-4f3b-aadc-d694a32d6363">sql-op :with (&amp;rest args)</a></li>
<li><a href="#95faa857-c1b9-4a85-a5a9-1fcbb12d4d1a">sql-op :with-recursive (&amp;rest args)</a></li>
</ul>
</li>
<li><a href="#f09702d4-8c8c-4887-bc90-bbeeb7a6fd20">Table Functions</a>
<ul>
<li><a href="#0342b8ed-2ad6-4128-aa0d-143934d21a96">sql-op :for-update (query &amp;key of nowait)</a></li>
<li><a href="#be469ee7-32e2-49e2-9080-75e8ff7808e0">sql-op :for-share (query &amp;key of nowait)</a></li>
<li><a href="#62cd3ff0-f034-46fc-a28e-c9875b577c40">sql-op :insert-into (table &amp;rest rest)</a></li>
<li><a href="#ce43d017-71a6-4205-80aa-372c0882d5a4">sql-op :insert-rows-into (table &amp;rest rest)</a></li>
<li><a href="#fadb04ea-7827-477c-bc40-8e5baf263690">sql-op :update (table &amp;rest rest)</a></li>
<li><a href="#bf5b4590-222e-43e1-9048-bfca812ac026">sql-op :delete-from (table &amp;rest rest)</a></li>
<li><a href="#44269d47-6da9-407e-a52f-407b2720a359">sql-op :create-table (name (&amp;rest columns) &amp;rest options)</a>
<ul>
<li><a href="#174224d0-57c7-475c-b916-dc7f68faea29">Column Definition parameters</a></li>
<li><a href="#ea63c829-b727-430c-a00e-49910cfe11dc">Table Constraints</a></li>
</ul>
</li>
<li><a href="#d97682ed-4e3f-4a3d-b870-fb6692081361">sql-op :alter-table (name action &amp;rest args)</a></li>
<li><a href="#0b9e0a1e-91c7-4b25-b675-bdf1e8212739">sql-op :drop-table (name)</a></li>
<li><a href="#ddfde1f9-1c0c-422e-bdc5-a1ca6103de52">sql-op :truncate (&amp;rest args)</a></li>
<li><a href="#820631e5-f822-44f1-b41f-40db1ef9451f">sql-op :create-index (name &amp;rest args)</a></li>
<li><a href="#2fdeaea2-c6a6-4a6d-a768-d061cd933490">sql-op :create-unique-index (name &amp;rest args)</a></li>
<li><a href="#21b16924-6cdc-4cca-8a47-b6fd53f73971">sql-op :drop-index (name)</a></li>
<li><a href="#90cbcc2e-8e6b-424d-9043-030371ec2197">sql-op :create-sequence (name &amp;key increment min-value max-value start cache cycle)</a></li>
<li><a href="#48bf8f29-c2c0-4562-800d-18aa7c003017">sql-op :alter-sequence (name)</a></li>
<li><a href="#6d221b47-131a-462b-922f-4cfe2ab6a425">sql-op :drop-sequence (name)</a></li>
<li><a href="#e3bc3389-958d-4b34-bfb4-c7b73cd2c2ec">sql-op :create-view (name query)</a></li>
<li><a href="#b70d0d77-4dfb-4172-ac99-812a19bb5e88">sql-op :drop-view (name)</a></li>
<li><a href="#7f6ae03c-565e-4d32-b1b0-ab0cd211c761">sql-op :set-constraints (state &amp;rest constraints)</a></li>
<li><a href="#9839c248-5e7b-44a6-9a8d-35771e612a6f">sql-op :listen (channel)</a></li>
<li><a href="#1fb4efc1-6942-4186-8ce5-a7547e536002">sql-op :unlisten (channel)</a></li>
<li><a href="#1b8e42dd-0967-4620-862d-bb086448a529">sql-op :notify (channel &amp;optional payload)</a></li>
<li><a href="#ee81a967-06d9-4a0f-9ef4-4b2b9c189451">sql-op :create-role (role &amp;rest args)</a></li>
<li><a href="#48025ade-9d59-4daa-9809-b00e5881e835">sql-op :create-database (name)</a></li>
<li><a href="#93698127-77f1-440a-b965-3ad0488e4a34">sql-op :drop-database (name)</a></li>
<li><a href="#8066cf54-c225-4766-8e29-df775a95accb">sql-op :copy (table &amp;rest args)</a></li>
</ul>
</li>
<li><a href="#dynamic-queries-composition-and-parameterized-queries">Dynamic Queries, Composition and Parameterized Queries</a>
<ul>
<li><a href="#overview">Overview</a>
<ul>
<li><a href="#programmer-built-queries">Programmer Built Queries</a></li>
<li><a href="#523172f6-bc0b-4402-aa40-989025e0d12f">Approach #2 Use sql-compile</a></li>
<li><a href="#f0c37b97-4907-4153-bdfb-3381ae4a08d7">Approach #3 Use :raw</a></li>
<li><a href="#queries-with-user-input">Queries with User Input</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
This is the reference manual for the S-SQL component of the postmodern library.
</p>

<p>
S-SQL provides a lispy syntax for SQL queries, and knows how to convert various
lisp types to their textual SQL representation. It takes care to do as much of
the work as possible at compile-time, so that at runtime a string concatenation
is all that is needed to produce the final SQL query.
</p>
