doc/s-sql.org
** macro sql (form)
   :PROPERTIES:
   :ID:       9de76637-62f7-4c7c-a5d1-1f37491b3db3
   :CUSTOM_ID: d756666d-e8c9-4cf7-b8c3-e1eb3fd2437c
   :END:
→ string

Convert the given form (a list starting with a keyword) to an SQL query string
at compile time, according to the rules described here. For example:
#+BEGIN_SRC lisp
(sql (:select '* :from 'country :where (:= 'a 1)))

 "(SELECT * FROM country WHERE (a = 1))"
#+END_SRC

but
#+BEGIN_SRC lisp
(sql '(:select '* :from 'country :where (:= 'a 1)))
#+END_SRC

would throw an error. For the later case you need to use sql-compile.

** function sql-compile (form)
   :PROPERTIES:
   :ID:       8d161d2a-06cb-4334-9ee6-86e805eb5295
   :CUSTOM_ID: 0b536aa5-5eb8-4050-931a-51a00d42451a
   :END:
→ string

This is the run-time variant of the sql macro. It converts the given list to
an SQL query, with the same rules except that symbols in this list do not
have to be quoted to be interpreted as identifiers. For example:
#+BEGIN_SRC lisp
(sql-compile '(:select '* :from 'country :where (:= 'a 1)))

\"(SELECT * FROM country WHERE (a = 1))\"
#+END_SRC

but
#+BEGIN_SRC lisp
(sql (:select '* :from 'country :where (:= 'a 1)))
#+END_SRC

would throw an error. For the later case you need to use sql.

** function sql-template (form)
   :PROPERTIES:
   :ID:       e16e8407-01af-4907-9ed6-2b3c1f12dd1b
   :CUSTOM_ID: e8c97394-061f-40fa-aab7-b620eafa060d
   :END:

In cases where you do need to build the query at run time, yet you do not
want to re-compile it all the time, this function can be used to compile it
once and store the result. It takes an S-SQL form, which may contain
$$ placeholder symbols, and returns a function that takes one argument for
every $$. When called, this returned function produces an SQL string in
which the placeholders have been replaced by the values of the arguments.

** function enable-s-sql-syntax (&optional (char #\Q))
   :PROPERTIES:
   :ID:       bee65d01-61d4-4823-b0ab-26789642cdb3
   :CUSTOM_ID: f9bbed09-51bd-44b9-8e6f-9aed91b0cb81
   :END:

Modifies the current readtable to add a #Q syntax that is read as (sql ...).
The character to use can be overridden by passing an argument.

#+NAME: sql escape string
** function sql-escape-string (string)
   :PROPERTIES:
   :ID:       02edac61-f915-4d5f-b52e-d4b7ace29352
   :CUSTOM_ID: 610dec65-be3f-41bb-8b7d-ed814f1ad0a4
   :END:
→ string

[[http://www.postgresql.org/docs/current/static/sql-syntax-lexical.html#SQL-SYNTAX-STRINGS][Escapes]] a string for inclusion in a PostgreSQL query. A quoted symbol will generate an error.
Example:
#+BEGIN_SRC lisp
 (sql-escape-string \"Puss in 'Boots'\")

 \"E'Puss in ''Boots'''\"
#+END_SRC

** method sql-escape (value)
   :PROPERTIES:
   :ID:       59d7247c-c2fa-46c3-b682-dab17fac8812
   :CUSTOM_ID: 2da63be4-c001-43b7-bda0-6e93c780034c
   :END:
→ string

A generalisation of sql-escape-string looks at the type of the value passed, and properly writes it out it for inclusion in an SQL query. Symbols will be
converted to SQL names. Examples:
#+BEGIN_SRC lisp
(sql-escape "tr'-x")

"E'tr''-x'"

(sql-escape (/ 1 13))

"0.0769230769230769230769230769230769230"

(sql-escape #("Baden-Wurttemberg" "Bavaria" "Berlin" "Brandenburg"))

"ARRAY[E'Baden-Wurttemberg', E'Bavaria', E'Berlin', E'Brandenburg']"
#+END_SRC
** variable *downcase-symbols*
   :PROPERTIES:
   :ID:       19c05bac-8209-4e48-b2e0-549ff03df44e
   :CUSTOM_ID: 0be281bd-0fc9-4221-998b-32768ffa2366
   :END:

When converting symbols to strings, whether to downcase the symbols is set here. The default is to downcase symbols.
** variable *standard-sql-strings*
   :PROPERTIES:
   :ID:       95a70c76-0fcb-4967-88a2-3460bbcb5311
   :CUSTOM_ID: a4949071-98e5-481b-8f47-965247b41e2e
   :END:

Used to configure whether S-SQL will use standard SQL strings (just replace #\' with ''), or backslash-style escaping. Setting this to NIL is always safe, but when the server is configured to allow standard strings (compile-time parameter 'standard_conforming_strings' is 'on', which will become the default in future versions of PostgreSQL), the noise in queries can be reduced by setting this to T.

** variable *postgres-reserved-words* hashtable
   :PROPERTIES:
   :ID:       a975b46b-5ade-4358-aa77-f83681299a94
   :CUSTOM_ID: 7b4cd6d2-f9bf-4262-a8a8-83f340063adf
   :END:

A set of all Postgresql's reserved words, for automatic escaping. Probably not a good idea to use these words as identifiers anyway.
 '("all" "analyse" "analyze" "and" "any" "array" "as" "asc" "asymmetric" "authorization"
   "between" "binary" "both" "case" "cast" "check" "collate" "column" "concurrently"
   "constraint" "create" "cross" "current-catalog" "current-date" "current-role" "current-schema"
   "current-time" "current-timestamp" "current-user" "default" "deferrable"
   "desc" "distinct" "do" "else" "end" "except" "false" "fetch" "filter"
   "for" "foreign" "freeze" "from" "full" "grant" "group" "having" "ilike" "in" "initially"
   "inner" "intersect" "into" "is" "isnull" "join" "lateral" "leading" "left" "like" "limit"
   "localtime" "localtimestamp" "natural" "new" "not" "notnull" "nowait" "null" "off" "offset" "old"
   "on" "only" "or" "order" "outer" "overlaps" "placing" "primary" "references" "returning"
   "right" "select" "session-user" "Share" "similar" "some" "symmetric" "table" "then" "to" "trailing" "true"
   "union" "unique" "user" "using" "variadic" "verbose" "when" "where" "window" "with"))

