doc/s-sql.html

<div id="outline-container-orge873c61" class="outline-2">
<h2 id="d1dd840a-aa0d-48ad-9dc5-dbfc2988110f"><a id="orge873c61"></a><a id="ID-462ce6d8-f967-4bce-817e-d1762ebfd41f"></a>Interface</h2>
<div class="outline-text-2" id="text-d1dd840a-aa0d-48ad-9dc5-dbfc2988110f">
</div>
<div id="outline-container-orgc097194" class="outline-3">
<h3 id="d756666d-e8c9-4cf7-b8c3-e1eb3fd2437c"><a id="orgc097194"></a><a id="ID-9de76637-62f7-4c7c-a5d1-1f37491b3db3"></a>macro sql (form)</h3>
<div class="outline-text-3" id="text-d756666d-e8c9-4cf7-b8c3-e1eb3fd2437c">
<p>
→ string
</p>

<p>
Convert the given form (a list starting with a keyword) to an SQL query string
at compile time, according to the rules described here. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'country <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'a 1)))

 <span style="color: #cd8162;">"(SELECT * FROM country WHERE (a = 1))"</span>
</pre>
</div>

<p>
but
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql '(<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'country <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'a 1)))
</pre>
</div>

<p>
would throw an error. For the later case you need to use sql-compile.
</p>
</div>
</div>

<div id="outline-container-orgb456270" class="outline-3">
<h3 id="0b536aa5-5eb8-4050-931a-51a00d42451a"><a id="orgb456270"></a><a id="ID-8d161d2a-06cb-4334-9ee6-86e805eb5295"></a>function sql-compile (form)</h3>
<div class="outline-text-3" id="text-0b536aa5-5eb8-4050-931a-51a00d42451a">
<p>
→ string
</p>

<p>
This is the run-time variant of the sql macro. It converts the given list to
an SQL query, with the same rules except that symbols in this list do not
have to be quoted to be interpreted as identifiers. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-compile '(<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'country <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'a 1)))

\"(SELECT * FROM country WHERE (a = 1))\"
</pre>
</div>

<p>
but
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'country <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'a 1)))
</pre>
</div>

<p>
would throw an error. For the later case you need to use sql.
</p>
</div>
</div>

<div id="outline-container-orgcf77a06" class="outline-3">
<h3 id="e8c97394-061f-40fa-aab7-b620eafa060d"><a id="orgcf77a06"></a><a id="ID-e16e8407-01af-4907-9ed6-2b3c1f12dd1b"></a>function sql-template (form)</h3>
<div class="outline-text-3" id="text-e8c97394-061f-40fa-aab7-b620eafa060d">
<p>
In cases where you do need to build the query at run time, yet you do not
want to re-compile it all the time, this function can be used to compile it
once and store the result. It takes an S-SQL form, which may contain
\[ placeholder symbols, and returns a function that takes one argument for
every \]. When called, this returned function produces an SQL string in
which the placeholders have been replaced by the values of the arguments.
</p>
</div>
</div>

<div id="outline-container-org7599947" class="outline-3">
<h3 id="f9bbed09-51bd-44b9-8e6f-9aed91b0cb81"><a id="org7599947"></a><a id="ID-bee65d01-61d4-4823-b0ab-26789642cdb3"></a>function enable-s-sql-syntax (&amp;optional (char #\Q))</h3>
<div class="outline-text-3" id="text-f9bbed09-51bd-44b9-8e6f-9aed91b0cb81">
<p>
Modifies the current readtable to add a #Q syntax that is read as (sql &#x2026;).
The character to use can be overridden by passing an argument.
</p>
</div>
</div>
<div id="outline-container-org362395d" class="outline-3">
<h3 id="610dec65-be3f-41bb-8b7d-ed814f1ad0a4"><a id="org362395d"></a><a id="ID-02edac61-f915-4d5f-b52e-d4b7ace29352"></a>function sql-escape-string (string)</h3>
<div class="outline-text-3" id="text-610dec65-be3f-41bb-8b7d-ed814f1ad0a4">
<p>
→ string
</p>

<p>
<a href="http://www.postgresql.org/docs/current/static/sql-syntax-lexical.html#SQL-SYNTAX-STRINGS">Escapes</a> a string for inclusion in a PostgreSQL query. A quoted symbol will generate an error.
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-escape-string \"Puss in 'Boots'\")

\"E'Puss in ''Boots'''\"
</pre>
</div>
</div>
</div>

<div id="outline-container-orga395e21" class="outline-3">
<h3 id="2da63be4-c001-43b7-bda0-6e93c780034c"><a id="orga395e21"></a><a id="ID-59d7247c-c2fa-46c3-b682-dab17fac8812"></a>method sql-escape (value)</h3>
<div class="outline-text-3" id="text-2da63be4-c001-43b7-bda0-6e93c780034c">
<p>
→ string
</p>

<p>
A generalisation of sql-escape-string looks at the type of the value passed, and properly writes it out it for inclusion in an SQL query. Symbols will be
converted to SQL names. Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-escape <span style="color: #cd8162;">"tr'-x"</span>)

<span style="color: #cd8162;">"E'tr''-x'"</span>

(sql-escape (/ 1 13))

<span style="color: #cd8162;">"0.0769230769230769230769230769230769230"</span>

(sql-escape #(<span style="color: #cd8162;">"Baden-Wurttemberg"</span> <span style="color: #cd8162;">"Bavaria"</span> <span style="color: #cd8162;">"Berlin"</span> <span style="color: #cd8162;">"Brandenburg"</span>))

<span style="color: #cd8162;">"ARRAY[E'Baden-Wurttemberg', E'Bavaria', E'Berlin', E'Brandenburg']"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b5e7d4" class="outline-3">
<h3 id="0be281bd-0fc9-4221-998b-32768ffa2366"><a id="org3b5e7d4"></a><a id="ID-19c05bac-8209-4e48-b2e0-549ff03df44e"></a>variable <b>downcase-symbols</b></h3>
<div class="outline-text-3" id="text-0be281bd-0fc9-4221-998b-32768ffa2366">
<p>
When converting symbols to strings, whether to downcase the symbols is set here. The default is to downcase symbols.
</p>
</div>
</div>
<div id="outline-container-org6860490" class="outline-3">
<h3 id="a4949071-98e5-481b-8f47-965247b41e2e"><a id="org6860490"></a><a id="ID-95a70c76-0fcb-4967-88a2-3460bbcb5311"></a>variable <b>standard-sql-strings</b></h3>
<div class="outline-text-3" id="text-a4949071-98e5-481b-8f47-965247b41e2e">
<p>
Used to configure whether S-SQL will use standard SQL strings (just replace #\' with ''), or backslash-style escaping. Setting this to NIL is always safe, but when the server is configured to allow standard strings (compile-time parameter 'standard_conforming_strings' is 'on', which will become the default in future versions of PostgreSQL), the noise in queries can be reduced by setting this to T.
</p>
</div>
</div>

<div id="outline-container-org612b0ba" class="outline-3">
<h3 id="7b4cd6d2-f9bf-4262-a8a8-83f340063adf"><a id="org612b0ba"></a><a id="ID-a975b46b-5ade-4358-aa77-f83681299a94"></a>variable <b>postgres-reserved-words</b> hashtable</h3>
<div class="outline-text-3" id="text-7b4cd6d2-f9bf-4262-a8a8-83f340063adf">
<p>
A set of all Postgresql's reserved words, for automatic escaping. Probably not a good idea to use these words as identifiers anyway.
 '("all" "analyse" "analyze" "and" "any" "array" "as" "asc" "asymmetric" "authorization"
   "between" "binary" "both" "case" "cast" "check" "collate" "column" "concurrently"
   "constraint" "create" "cross" "current-catalog" "current-date" "current-role" "current-schema"
   "current-time" "current-timestamp" "current-user" "default" "deferrable"
   "desc" "distinct" "do" "else" "end" "except" "false" "fetch" "filter"
   "for" "foreign" "freeze" "from" "full" "grant" "group" "having" "ilike" "in" "initially"
   "inner" "intersect" "into" "is" "isnull" "join" "lateral" "leading" "left" "like" "limit"
   "localtime" "localtimestamp" "natural" "new" "not" "notnull" "nowait" "null" "off" "offset" "old"
   "on" "only" "or" "order" "outer" "overlaps" "placing" "primary" "references" "returning"
   "right" "select" "session-user" "Share" "similar" "some" "symmetric" "table" "then" "to" "trailing" "true"
   "union" "unique" "user" "using" "variadic" "verbose" "when" "where" "window" "with"))
</p>
</div>
</div>
