doc/s-sql.org
** variable *escape-sql-names-p*
   :PROPERTIES:
   :ID:       974ac94c-23eb-4bba-b324-d79fba034c1d
   :CUSTOM_ID: 1d66e5f3-fd90-473f-ae0a-bafb336ebc1f
   :END:

Determines whether double quotes are added around column, table, and ** function names in
queries. Valid values:

- T, in which case every name is escaped,
- NIL, in which case no name is escape,
- :auto, which causes only [[http://www.postgresql.org/docs/current/static/sql-keywords-appendix.html][reserved words]] to be escaped, or.
- :literal which is the same as :auto except it has added consequence in to-sql-name (see below).

The default value is :auto.

Be careful when binding this with let and such ― since a lot of SQL compilation tends to happen at
compile-time, the result might not be what you expect. Mixed case sensitivity is not currently
well supported. Postgresql itself will downcase unquoted identifiers. This will be revisited in the
future if requested.

** function sql-type-name (type)
   :PROPERTIES:
   :ID:       79bc7903-3321-4e01-a0a0-819ad61179b5
   :CUSTOM_ID: fc1a8b3d-0951-4917-b9d9-6b2bb1a0c2ee
   :END:
→ string

Transform a lisp type into a string containing something SQL understands. Default is to just use the type symbol's name.

** function to-sql-name (name &optional (escape-p *escape-sql-names-p*)(ignore-reserved-words nil)
   :PROPERTIES:
   :ID:       46c8eab0-4fac-4b14-8193-6b93c985ad0f
   :CUSTOM_ID: 59c6c567-e01b-43d1-bf3b-b4f40ffb3054
   :END:
→ string

Convert a symbol or string into a name that can be a sql table, column, or operation name. Add quotes when escape-p is true, or escape-p is :auto and the name contains reserved words. Quoted or delimited identifiers can be used by passing :literal as the value of escape-p. If escape-p is :literal, and the name is a string then the string is still escaped but the symbol or string is not downcased, regardless of the setting for *downcase-symbols* and the hyphen and forward slash characters are not replaced with underscores.

Ignore-reserved-words is only used internally for column names which are allowed to be reserved words, but it is not recommended.

** function from-sql-name (string)
   :PROPERTIES:
   :ID:       5a8737c8-f850-4807-974c-8f711cc9ae1c
   :CUSTOM_ID: ca9a1bf3-0141-42aa-b79d-ee6bd15e0e4b
   :END:
→ keyword

Convert a string that represents an SQL identifier to a keyword by uppercasing
it and converting the underscores to dashes.

** macro register-sql-operators (arity &rest names)
   :PROPERTIES:
   :ID:       594e6029-8c94-4bb6-ad36-83ab42dc6369
   :CUSTOM_ID: bc78e7be-3439-4f95-b923-47c4b7b2652d
   :END:

Define simple SQL operators. Arity is one of :unary (like 'not'), :unary-postfix
(the operator comes after the operand), :n-ary (like '\+': the operator falls away
when there is only one operand), :2+-ary (like '=', which is meaningless for one
operand), or :n-or-unary (like '-', where the operator is kept in the unary case).
After the arity may follow any number of operators, either just a keyword, in
which case the downcased symbol name is used as the SQL operator, or a two-element
list containing a keyword and a name string.

#+NAME: SQL Types
* SQL Types
  :PROPERTIES:
  :ID:       fd140802-2b42-49b6-b21c-c0d4adae6136
  :CUSTOM_ID: 0d0ab8dc-80a6-4dfd-9f01-fb965a40e0dd
  :END:
S-SQL knows the SQL equivalents to a number of Lisp types, and defines some
extra types that can be used to denote other SQL types. The following
table (yes, I know this table is duplicated on other pages) shows the correspondence:

| Lisp type     | SQL type         | Description                                                |
|---------------+------------------+------------------------------------------------------------|
| integer       | smallint         | -32,768 to +32,768 2-byte storage                          |
| integer       | integer          | -2147483648 to +2147483647 integer, 4-byte storage         |
| integer       | bigint           | -9223372036854775808 to 9223372036854775807 8-byte storage |
| (numeric X Y) | numeric(X, Y)    | see discussion below                                       |
| float, real   | real             | float, 6 decimal digit precision 4-byte storage            |
| double-float  | double-precision | float, 15 decimal digit precision 8-byte storage           |
| string, text  | text             | variable length string, no limit specified                 |
| string        | char(X)          | char(length), blank-padded string, fixed storage length    |
| string        | varchar(X)       | varchar(length), non-blank-padded string, variable storage |
| boolean       | boolean          | boolean, 'true'/'false', 1 byte                            |
| bytea         | bytea            | binary string which allows non-printable octets            |
| date          | date             | date range: 4713 BC to 5874897 AD                          |
| [[file:interval-notes.html][interval]]      | interval         | time intervals                                             |
| array         | array            | See [[file:array-notes.html][Array-Notes]]                                            |

Numeric and decimal are variable storage size numbers with user specified precision.
Up to 131072 digits before the decimal point; up to 16383 digits after the decimal point.
The syntax is numeric(precision, scale). Numeric columns with a specified scale will coerce input
values to that scale. For more detail, see https://www.postgresql.org/docs/current/datatype-numeric.html

** type db-null
   :PROPERTIES:
   :ID:       73bdde0f-96d9-494e-854e-f03f6197c88f
   :CUSTOM_ID: df2495f3-0c92-47cc-a62f-8ae473490cb5
   :END:

This is a type of which only the keyword :null is a member. It is used to represent
NULL values from the database.

* SQL Syntax
  :PROPERTIES:
  :ID:       13fef0a2-bbe1-44a1-9bc1-570ffdbb4093
  :CUSTOM_ID: 3db49c3e-75a5-491d-b4df-9efb75128485
  :END:
An S-SQL form is converted to a query through the following rules:

- Lists starting with a keyword are operators. They are expanded as
  described below if they are known, otherwise they are expanded in the
  standard way: operator(arguments, ...)

- Quoted symbols or keywords are interpreted as names of columns or
  tables, and converted to strings with to-sql-name.

- Anything else is evaluated and the resulting Lisp value is converted
  to its textual SQL representation (or an error is raised when there is
  no rule for converting objects of this type). Self-quoting atoms may
  be converted to strings at compile-time.

