doc/s-sql.html

<div id="outline-container-org8cbe7cf" class="outline-3">
<h3 id="1d66e5f3-fd90-473f-ae0a-bafb336ebc1f"><a id="org8cbe7cf"></a><a id="ID-974ac94c-23eb-4bba-b324-d79fba034c1d"></a>variable <b>escape-sql-names-p</b></h3>
<div class="outline-text-3" id="text-1d66e5f3-fd90-473f-ae0a-bafb336ebc1f">
<p>
Determines whether double quotes are added around column, table, and ** function names in
queries. Valid values:
</p>

<ul class="org-ul">
<li>T, in which case every name is escaped,</li>
<li>NIL, in which case no name is escape,</li>
<li>:auto, which causes only <a href="http://www.postgresql.org/docs/current/static/sql-keywords-appendix.html">reserved words</a> to be escaped, or.</li>
<li>:literal which is the same as :auto except it has added consequence in to-sql-name (see below).</li>
</ul>

<p>
The default value is :auto.
</p>

<p>
Be careful when binding this with let and such ― since a lot of SQL compilation tends to happen at
compile-time, the result might not be what you expect. Mixed case sensitivity is not currently
well supported. Postgresql itself will downcase unquoted identifiers. This will be revisited in the
future if requested.
</p>
</div>
</div>

<div id="outline-container-org5b03ace" class="outline-3">
<h3 id="fc1a8b3d-0951-4917-b9d9-6b2bb1a0c2ee"><a id="org5b03ace"></a><a id="ID-79bc7903-3321-4e01-a0a0-819ad61179b5"></a>function sql-type-name (type)</h3>
<div class="outline-text-3" id="text-fc1a8b3d-0951-4917-b9d9-6b2bb1a0c2ee">
<p>
→ string
</p>

<p>
Transform a lisp type into a string containing something SQL understands. Default is to just use the type symbol's name.
</p>
</div>
</div>

<div id="outline-container-org1d14161" class="outline-3">
<h3 id="59c6c567-e01b-43d1-bf3b-b4f40ffb3054"><a id="org1d14161"></a><a id="ID-46c8eab0-4fac-4b14-8193-6b93c985ad0f"></a>function to-sql-name (name &amp;optional (escape-p <b>escape-sql-names-p</b>)(ignore-reserved-words nil)</h3>
<div class="outline-text-3" id="text-59c6c567-e01b-43d1-bf3b-b4f40ffb3054">
<p>
→ string
</p>

<p>
Convert a symbol or string into a name that can be a sql table, column, or operation name. Add quotes when escape-p is true, or escape-p is :auto and the name contains reserved words. Quoted or delimited identifiers can be used by passing :literal as the value of escape-p. If escape-p is :literal, and the name is a string then the string is still escaped but the symbol or string is not downcased, regardless of the setting for <b>downcase-symbols</b> and the hyphen and forward slash characters are not replaced with underscores.
</p>

<p>
Ignore-reserved-words is only used internally for column names which are allowed to be reserved words, but it is not recommended.
</p>
</div>
</div>

<div id="outline-container-org648faaf" class="outline-3">
<h3 id="ca9a1bf3-0141-42aa-b79d-ee6bd15e0e4b"><a id="org648faaf"></a><a id="ID-5a8737c8-f850-4807-974c-8f711cc9ae1c"></a>function from-sql-name (string)</h3>
<div class="outline-text-3" id="text-ca9a1bf3-0141-42aa-b79d-ee6bd15e0e4b">
<p>
→ keyword
</p>

<p>
Convert a string that represents an SQL identifier to a keyword by uppercasing
it and converting the underscores to dashes.
</p>
</div>
</div>

<div id="outline-container-orgbb6e1a3" class="outline-3">
<h3 id="bc78e7be-3439-4f95-b923-47c4b7b2652d"><a id="orgbb6e1a3"></a><a id="ID-594e6029-8c94-4bb6-ad36-83ab42dc6369"></a>macro register-sql-operators (arity &amp;rest names)</h3>
<div class="outline-text-3" id="text-bc78e7be-3439-4f95-b923-47c4b7b2652d">
<p>
Define simple SQL operators. Arity is one of :unary (like 'not'), :unary-postfix
(the operator comes after the operand), :n-ary (like '\+': the operator falls away
when there is only one operand), :2+-ary (like '=', which is meaningless for one
operand), or :n-or-unary (like '-', where the operator is kept in the unary case).
After the arity may follow any number of operators, either just a keyword, in
which case the downcased symbol name is used as the SQL operator, or a two-element
list containing a keyword and a name string.
</p>
</div>
</div>
</div>
<div id="outline-container-org465c36a" class="outline-2">
<h2 id="0d0ab8dc-80a6-4dfd-9f01-fb965a40e0dd"><a id="org465c36a"></a><a id="ID-fd140802-2b42-49b6-b21c-c0d4adae6136"></a>SQL Types</h2>
<div class="outline-text-2" id="text-0d0ab8dc-80a6-4dfd-9f01-fb965a40e0dd">
<p>
S-SQL knows the SQL equivalents to a number of Lisp types, and defines some
extra types that can be used to denote other SQL types. The following
table (yes, I know this table is duplicated on other pages) shows the correspondence:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Lisp type</th>
<th scope="col" class="org-left">SQL type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">integer</td>
<td class="org-left">smallint</td>
<td class="org-left">-32,768 to +32,768 2-byte storage</td>
</tr>

<tr>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">-2147483648 to +2147483647 integer, 4-byte storage</td>
</tr>

<tr>
<td class="org-left">integer</td>
<td class="org-left">bigint</td>
<td class="org-left">-9223372036854775808 to 9223372036854775807 8-byte storage</td>
</tr>

<tr>
<td class="org-left">(numeric X Y)</td>
<td class="org-left">numeric(X, Y)</td>
<td class="org-left">see discussion below</td>
</tr>

<tr>
<td class="org-left">float, real</td>
<td class="org-left">real</td>
<td class="org-left">float, 6 decimal digit precision 4-byte storage</td>
</tr>

<tr>
<td class="org-left">double-float</td>
<td class="org-left">double-precision</td>
<td class="org-left">float, 15 decimal digit precision 8-byte storage</td>
</tr>

<tr>
<td class="org-left">string, text</td>
<td class="org-left">text</td>
<td class="org-left">variable length string, no limit specified</td>
</tr>

<tr>
<td class="org-left">string</td>
<td class="org-left">char(X)</td>
<td class="org-left">char(length), blank-padded string, fixed storage length</td>
</tr>

<tr>
<td class="org-left">string</td>
<td class="org-left">varchar(X)</td>
<td class="org-left">varchar(length), non-blank-padded string, variable storage</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">boolean</td>
<td class="org-left">boolean, 'true'/'false', 1 byte</td>
</tr>

<tr>
<td class="org-left">bytea</td>
<td class="org-left">bytea</td>
<td class="org-left">binary string which allows non-printable octets</td>
</tr>

<tr>
<td class="org-left">date</td>
<td class="org-left">date</td>
<td class="org-left">date range: 4713 BC to 5874897 AD</td>
</tr>

<tr>
<td class="org-left"><a href="interval-notes.html">interval</a></td>
<td class="org-left">interval</td>
<td class="org-left">time intervals</td>
</tr>

<tr>
<td class="org-left">array</td>
<td class="org-left">array</td>
<td class="org-left">See <a href="array-notes.html">Array-Notes</a></td>
</tr>
</tbody>
</table>

<p>
Numeric and decimal are variable storage size numbers with user specified precision.
Up to 131072 digits before the decimal point; up to 16383 digits after the decimal point.
The syntax is numeric(precision, scale). Numeric columns with a specified scale will coerce input
values to that scale. For more detail, see <a href="https://www.postgresql.org/docs/current/datatype-numeric.html">https://www.postgresql.org/docs/current/datatype-numeric.html</a>
</p>
</div>

<div id="outline-container-org61d7203" class="outline-3">
<h3 id="df2495f3-0c92-47cc-a62f-8ae473490cb5"><a id="org61d7203"></a><a id="ID-73bdde0f-96d9-494e-854e-f03f6197c88f"></a>type db-null</h3>
<div class="outline-text-3" id="text-df2495f3-0c92-47cc-a62f-8ae473490cb5">
<p>
This is a type of which only the keyword :null is a member. It is used to represent
NULL values from the database.
</p>
</div>
</div>
</div>

<div id="outline-container-org2556003" class="outline-2">
<h2 id="3db49c3e-75a5-491d-b4df-9efb75128485"><a id="org2556003"></a><a id="ID-13fef0a2-bbe1-44a1-9bc1-570ffdbb4093"></a>SQL Syntax</h2>
<div class="outline-text-2" id="text-3db49c3e-75a5-491d-b4df-9efb75128485">
<p>
An S-SQL form is converted to a query through the following rules:
</p>

<ul class="org-ul">
<li>Lists starting with a keyword are operators. They are expanded as
described below if they are known, otherwise they are expanded in the
standard way: operator(arguments, &#x2026;)</li>

<li>Quoted symbols or keywords are interpreted as names of columns or
tables, and converted to strings with to-sql-name.</li>

<li>Anything else is evaluated and the resulting Lisp value is converted
to its textual SQL representation (or an error is raised when there is
no rule for converting objects of this type). Self-quoting atoms may
be converted to strings at compile-time.</li>
</ul>
</div>
