doc/s-sql.org
** sql-op :select (&rest args)
   :PROPERTIES:
   :ID:       e8ff770d-fbce-461d-ac3b-4959bc8770c1
   :CUSTOM_ID: 48d06812-725a-4eee-a132-06aa4f924943
   :END:

Creates a select query. The arguments are split on the keywords found among
them. The group of arguments immediately after :select is interpreted as
the expressions that should be selected. After this, an optional :distinct
may follow, which will cause the query to only select distinct rows, or
alternatively :distinct-on followed by a group of row names. Next comes the
optional keyword :from, followed by at least one table name and then any
number of join statements. Join statements start with one of :left-join,
:right-join, :inner-join, :outer-join or :cross-join, then a table name or
subquery, then the keyword :on or :using, if applicable, and then a form.
A join can be preceded by :natural (leaving off the :on clause) to use a
natural join. After the joins an optional :where followed by a single form
may occur. And finally :group-by and :having can optionally be specified.
The first takes any number of arguments, and the second only one. A couple of
examples:
#+BEGIN_SRC lisp
(query (:select 'item :distinct
                :from 'item-table
                :where (:= 'col1 "Albania")))

(query (:select (:+ 'field-1 100) 'field-5
        :from (:as 'my-table 'x)
        :left-join 'your-table
        :on (:= 'x.field-2 'your-table.field-1)
        :where (:not-null 'a.field-3)))

(query (:order-by
        (:select 'regions.name
                 (:count 'regions.name)
                 :from 'countries 'regions
                 :where (:= 'regions.id 'countries.region-id)
                 :group-by 'regions.name)
        'regions.name))

(query (:select (:count 'c.id) 'r.name
                :from (:as 'countries 'c)
                :inner-join (:as 'regions 'r)
                :on (:= 'c.region-id 'r.id)
                :group-by 'r.name
                :having (:< (:count 'c.id) 10)))
#+END_SRC
** Joins
   :PROPERTIES:
   :CUSTOM_ID: e0f01ac7-cb3c-4b38-8902-dc4a981a15e8
   :END:
*** Cross Join
    :PROPERTIES:
    :CUSTOM_ID: 40e45849-5e9d-4b4c-830b-53f79f0b21e2
    :END:

From the postgresql documentation: "For every possible combination of rows from T1 and T2 (i.e., a Cartesian product), the joined table will contain a row consisting of all columns in T1 followed by all columns in T2. If the tables have N and M rows respectively, the joined table will have N * M rows."
#+BEGIN_SRC lisp
(query (:select '* from 'employee :cross-join 'compensation))
#+END_SRC

