doc/s-sql.html

<div id="outline-container-org513d52d" class="outline-3">
<h3 id="48d06812-725a-4eee-a132-06aa4f924943"><a id="org513d52d"></a><a id="ID-e8ff770d-fbce-461d-ac3b-4959bc8770c1"></a>sql-op :select (&amp;rest args)</h3>
<div class="outline-text-3" id="text-48d06812-725a-4eee-a132-06aa4f924943">
<p>
Creates a select query. The arguments are split on the keywords found among
them. The group of arguments immediately after :select is interpreted as
the expressions that should be selected. After this, an optional :distinct
may follow, which will cause the query to only select distinct rows, or
alternatively :distinct-on followed by a group of row names. Next comes the
optional keyword :from, followed by at least one table name and then any
number of join statements. Join statements start with one of :left-join,
:right-join, :inner-join, :outer-join or :cross-join, then a table name or
subquery, then the keyword :on or :using, if applicable, and then a form.
A join can be preceded by :natural (leaving off the :on clause) to use a
natural join. After the joins an optional :where followed by a single form
may occur. And finally :group-by and :having can optionally be specified.
The first takes any number of arguments, and the second only one. A couple of
examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'item <span style="color: #98fb98; font-weight: bold;">:distinct</span>
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'item-table
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'col1 <span style="color: #cd8162;">"Albania"</span>)))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:+</span> 'field-1 100) 'field-5
        <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'my-table 'x)
        <span style="color: #98fb98; font-weight: bold;">:left-join</span> 'your-table
        <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'x.field-2 'your-table.field-1)
        <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:not-null</span> 'a.field-3)))

(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span>
        (<span style="color: #98fb98; font-weight: bold;">:select</span> 'regions.name
                 (<span style="color: #98fb98; font-weight: bold;">:count</span> 'regions.name)
                 <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                 <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'countries.region-id)
                 <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'regions.name)
        'regions.name))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> 'c.id) 'r.name
                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'countries 'c)
                <span style="color: #98fb98; font-weight: bold;">:inner-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'regions 'r)
                <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'c.region-id 'r.id)
                <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'r.name
                <span style="color: #98fb98; font-weight: bold;">:having</span> (<span style="color: #98fb98; font-weight: bold;">:&lt;</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> 'c.id) 10)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8492e49" class="outline-3">
<h3 id="e0f01ac7-cb3c-4b38-8902-dc4a981a15e8"><a id="org8492e49"></a>Joins</h3>
<div class="outline-text-3" id="text-e0f01ac7-cb3c-4b38-8902-dc4a981a15e8">
</div>
<div id="outline-container-orgf7226fc" class="outline-4">
<h4 id="40e45849-5e9d-4b4c-830b-53f79f0b21e2"><a id="orgf7226fc"></a>Cross Join</h4>
<div class="outline-text-4" id="text-40e45849-5e9d-4b4c-830b-53f79f0b21e2">
<p>
From the postgresql documentation: "For every possible combination of rows from T1 and T2 (i.e., a Cartesian product), the joined table will contain a row consisting of all columns in T1 followed by all columns in T2. If the tables have N and M rows respectively, the joined table will have N * M rows."
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> '* from 'employee <span style="color: #98fb98; font-weight: bold;">:cross-join</span> 'compensation))
</pre>
</div>
</div>
</div>
