doc/s-sql.org
*** Inner Join
    :PROPERTIES:
    :CUSTOM_ID: 85c25a7d-3660-4d38-85f0-2b9c9dc88684
    :END:

An inner join looks at two tables and creates a new result consisting of the selected elements in the rows from the two tables that match the specified conditions. You can simplistically think of it as the intersection of the two sets. In reality, it is creating a new set consisting of certain elements of the intersecting rows. An inner join is the default and need not be specified.

A sample of standard sql using two inner joins to collect information from three
tables could look like this:
#+BEGIN_SRC sql
(SELECT foo, bar, baz FROM (SELECT foo FROM x WHERE some-condition-here) AS tmp1

INNER JOIN (SELECT bar FROM x WHERE some-condition-here) AS tmp2 ON (tmp1.id = tmp2.id)

INNER JOIN (SELECT baz FROM x WHERE some-condition-here) AS tmp3 ON (tmp2.id = tmp3.id))
#+END_SRC

The same query could be expressed in s-sql as:
#+BEGIN_SRC lisp
(query (:select 'foo 'bar 'baz
                    :from (:as
                           (:select 'foo
                                    :from 'x
                                    :where 'x) 'tmp1)
                    :inner-join (:as
                                 (:select 'bar
                                          :from 'x
                                          :where 'x) 'tmp2)
                    :on (:= 'tmp1.id 'tmp2.id)
                    :inner-join (:as
                                 (:select 'baz
                                          :from 'x
                                          :where 'x)
                                 'tmp3)
                    :on (:= 'tmp2.id 'tmp3.id)))
#+END_SRC

The pre-ansi shorthand example, using a countries and regions tables would look like this:
#+BEGIN_SRC lisp
(query (:select 'countries.name
                :from 'countries 'regions
                :where (:and (:= 'countries.region-id 'regions.id)
                             (:= 'regions.name "North America"))))
#+END_SRC
The full portable ansi version, using inner join would look like this.
#+BEGIN_SRC lisp
(query (:select 'tmp1.name :from (:as (:select 'name 'region-id
                                               :from 'countries)
                                 'tmp1)
                :inner-join (:as (:select 'id
                                          :from 'regions
                                          :where (:= 'name "North America"))
                                 'tmp2)
                :on (:= 'tmp1.region-id 'tmp2.id)))
#+END_SRC

*** Outer Join
    :PROPERTIES:
    :CUSTOM_ID: ee0a6fef-de2f-407e-9cc9-3667de7775dc
    :END:

An outer join not only generates an inner join, it also joins the rows from one table that matches the conditions and adds null values for the joined columns from the second table (which obviously did not match the condition.) Under Postgresql, a "left join", "right join" or "full join" all imply an outer join.

A left join (or left outer join) looks at two tables, keeps the matched rows from both and the unmatched rows from the left table and drops the unmatched rows from the right table. A right outer join keeps the matched rows, the unmatched rows from the right table and drops the unmatched rows from the left table. A full outer join includes the rows that match from each table individually, with null values for the missing matching columns.

*** Left Join
    :PROPERTIES:
    :CUSTOM_ID: 3061c378-d2d1-4dda-833a-f1b3f8569018
    :END:

Example: Here we assume two tables. A countries table and a many-to-many linking table named countries-topics. (There is an implicit third table named topics.) We are looking for records from the countries table which do not have a match in the countries-topics table. In other words, where do we have a note, but not matched it to a topic?
#+BEGIN_SRC lisp
(query (:order-by (:select 'countries.id 'countries.name
                               :distinct :from 'countries
      :left-join 'countries-topics
      :on (:= 'countries.id 'countries-topics.country-id)
      :where (:is-null 'countries-topics.country-id))
                      'countries.id))
#+END_SRC

Here is a somewhat contrived example using a countries and regions table. We want to get the names of all the regions and also return the country names in one specified region. Assume that we only want the names of the countries in Central America, which happens to have a region-id of 3.
#+BEGIN_SRC lisp
(query (:select 'tmp2.name 'tmp1.name
         :from (:as (:select 'id 'name
                     :from 'regions)
                'tmp2)
         :left-join (:as (:select 'name 'region-id
                          :from 'countries
                          :where (:= 'region-id 3))
                     'tmp1)
         :on (:= 'tmp1.region-id 'tmp2.id)))
#+END_SRC

* Defined Operators
  :PROPERTIES:
  :CUSTOM_ID: 95eaa508-3109-45ec-9194-38d9f1b4e098
  :END:
The following operators are defined:

