doc/s-sql.html

<div id="outline-container-org6d2b41c" class="outline-4">
<h4 id="85c25a7d-3660-4d38-85f0-2b9c9dc88684"><a id="org6d2b41c"></a>Inner Join</h4>
<div class="outline-text-4" id="text-85c25a7d-3660-4d38-85f0-2b9c9dc88684">
<p>
An inner join looks at two tables and creates a new result consisting of the selected elements in the rows from the two tables that match the specified conditions. You can simplistically think of it as the intersection of the two sets. In reality, it is creating a new set consisting of certain elements of the intersecting rows. An inner join is the default and need not be specified.
</p>

<p>
A sample of standard sql using two inner joins to collect information from three
tables could look like this:
</p>
<div class="org-src-container">
<pre class="src src-sql">(<span style="color: #00ffff;">SELECT</span> foo, bar, baz <span style="color: #00ffff;">FROM</span> (<span style="color: #00ffff;">SELECT</span> foo <span style="color: #00ffff;">FROM</span> x <span style="color: #00ffff;">WHERE</span> <span style="color: #00ffff;">some</span>-condition-here) <span style="color: #00ffff;">AS</span> tmp1

<span style="color: #00ffff;">INNER</span> <span style="color: #00ffff;">JOIN</span> (<span style="color: #00ffff;">SELECT</span> bar <span style="color: #00ffff;">FROM</span> x <span style="color: #00ffff;">WHERE</span> <span style="color: #00ffff;">some</span>-condition-here) <span style="color: #00ffff;">AS</span> tmp2 <span style="color: #00ffff;">ON</span> (tmp1.id = tmp2.id)

<span style="color: #00ffff;">INNER</span> <span style="color: #00ffff;">JOIN</span> (<span style="color: #00ffff;">SELECT</span> baz <span style="color: #00ffff;">FROM</span> x <span style="color: #00ffff;">WHERE</span> <span style="color: #00ffff;">some</span>-condition-here) <span style="color: #00ffff;">AS</span> tmp3 <span style="color: #00ffff;">ON</span> (tmp2.id = tmp3.id))
</pre>
</div>

<p>
The same query could be expressed in s-sql as:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'foo 'bar 'baz
                    <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span>
                           (<span style="color: #98fb98; font-weight: bold;">:select</span> 'foo
                                    <span style="color: #98fb98; font-weight: bold;">:from</span> 'x
                                    <span style="color: #98fb98; font-weight: bold;">:where</span> 'x) <span style="color: #cd5c5c; font-weight: bold;">'tmp1)</span>
                    <span style="color: #98fb98; font-weight: bold;">:inner-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span>
                                 (<span style="color: #98fb98; font-weight: bold;">:select</span> 'bar
                                          <span style="color: #98fb98; font-weight: bold;">:from</span> 'x
                                          <span style="color: #98fb98; font-weight: bold;">:where</span> 'x) <span style="color: #cd5c5c; font-weight: bold;">'tmp2)</span>
                    <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'tmp1.id 'tmp2.id)
                    <span style="color: #98fb98; font-weight: bold;">:inner-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span>
                                 (<span style="color: #98fb98; font-weight: bold;">:select</span> 'baz
                                          <span style="color: #98fb98; font-weight: bold;">:from</span> 'x
                                          <span style="color: #98fb98; font-weight: bold;">:where</span> 'x)
                                 'tmp3)
                    <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'tmp2.id 'tmp3.id)))
</pre>
</div>

<p>
The pre-ansi shorthand example, using a countries and regions tables would look like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'countries.region-id 'regions.id)
                             (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"North America"</span>))))
</pre>
</div>
<p>
The full portable ansi version, using inner join would look like this.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'tmp1.name <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name 'region-id
                                               <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries)
                                 'tmp1)
                <span style="color: #98fb98; font-weight: bold;">:inner-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id
                                          <span style="color: #98fb98; font-weight: bold;">:from</span> 'regions
                                          <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'name <span style="color: #cd8162;">"North America"</span>))
                                 'tmp2)
                <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'tmp1.region-id 'tmp2.id)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdde9bcf" class="outline-4">
<h4 id="ee0a6fef-de2f-407e-9cc9-3667de7775dc"><a id="orgdde9bcf"></a>Outer Join</h4>
<div class="outline-text-4" id="text-ee0a6fef-de2f-407e-9cc9-3667de7775dc">
<p>
An outer join not only generates an inner join, it also joins the rows from one table that matches the conditions and adds null values for the joined columns from the second table (which obviously did not match the condition.) Under Postgresql, a "left join", "right join" or "full join" all imply an outer join.
</p>

<p>
A left join (or left outer join) looks at two tables, keeps the matched rows from both and the unmatched rows from the left table and drops the unmatched rows from the right table. A right outer join keeps the matched rows, the unmatched rows from the right table and drops the unmatched rows from the left table. A full outer join includes the rows that match from each table individually, with null values for the missing matching columns.
</p>
</div>
</div>

<div id="outline-container-orgbe3e8e3" class="outline-4">
<h4 id="3061c378-d2d1-4dda-833a-f1b3f8569018"><a id="orgbe3e8e3"></a>Left Join</h4>
<div class="outline-text-4" id="text-3061c378-d2d1-4dda-833a-f1b3f8569018">
<p>
Example: Here we assume two tables. A countries table and a many-to-many linking table named countries-topics. (There is an implicit third table named topics.) We are looking for records from the countries table which do not have a match in the countries-topics table. In other words, where do we have a note, but not matched it to a topic?
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.id 'countries.name
                               <span style="color: #98fb98; font-weight: bold;">:distinct</span> <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
      <span style="color: #98fb98; font-weight: bold;">:left-join</span> 'countries-topics
      <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'countries.id 'countries-topics.country-id)
      <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:is-null</span> 'countries-topics.country-id))
                      'countries.id))
</pre>
</div>

<p>
Here is a somewhat contrived example using a countries and regions table. We want to get the names of all the regions and also return the country names in one specified region. Assume that we only want the names of the countries in Central America, which happens to have a region-id of 3.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'tmp2.name 'tmp1.name
         <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name
                     <span style="color: #98fb98; font-weight: bold;">:from</span> 'regions)
                'tmp2)
         <span style="color: #98fb98; font-weight: bold;">:left-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name 'region-id
                          <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                          <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'region-id 3))
                     'tmp1)
         <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'tmp1.region-id 'tmp2.id)))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org7cf6297" class="outline-2">
<h2 id="95eaa508-3109-45ec-9194-38d9f1b4e098"><a id="org7cf6297"></a>Defined Operators</h2>
<div class="outline-text-2" id="text-95eaa508-3109-45ec-9194-38d9f1b4e098">
<p>
The following operators are defined:
</p>
</div>
