doc/s-sql.org
** sql-op :+, :*, :%, :&, :|, :||, :and, :or, :=, :/, :!=, :<, :>, :<=, :>=, :^, :union, :union-all, :intersect, :intersect-all, :except, :except-all (&rest args)
   :PROPERTIES:
   :ID:       405ec72e-7b79-4d96-aa32-1a3f931dd5a4
   :CUSTOM_ID: 1be1a168-6bc5-4df1-acc2-55d4f223d2c8
   :END:

These are expanded as infix operators. When meaningful, they allow more than
two arguments. :- can also be used as a unary operator to negate a value.
Note that the arguments to :union, :union-all, :intersect, and :except
should be queries (:select forms).

Note that you'll have to escape pipe characters to enter them as keywords. S-SQL
handles the empty keyword symbol (written :||) specially, and treats it like :\|\|,
so that it can be written without escapes. With :\|, this doesn't work.
** sql-op :or
   :PROPERTIES:
   :CUSTOM_ID: a052228e-bb93-42ed-8939-66d36a6e8cf7
   :END:
#+BEGIN_SRC lisp
(query (:select 'countries.name
                :from 'countries 'regions
                :where (:and
                        (:or (:= 'regions.name "North America")
                             (:= 'regions.name "Central America"))
                        (:= 'regions.id 'countries.region-id))))
#+END_SRC
or using parameterized queries
#+BEGIN_SRC lisp
(query (:select 'countries.name
                :from 'countries 'regions
                :where (:and
                        (:or (:= 'regions.name '$1)
                             (:= 'regions.name '$2))
                        (:= 'regions.id 'countries.region-id)))
  "North America" "Central America")
#+END_SRC
** sql-op :intersect
   :PROPERTIES:
   :CUSTOM_ID: 307eae77-4dae-4e28-a868-55a2dd9aa2eb
   :END:
Intersect produces a result contain rows that appear on all the sub-selects.
#+BEGIN_SRC lisp
(query (:intersect (:select 'countries.name
                            :from 'countries
                            :where (:< 'latitude 16.44))
                   (:select 'countries.name
                            :from 'countries 'regions
                            :where (:and (:= 'region-id 'regions.id)
                                         (:= 'regions.name "Caribbean")))))
#+END_SRC
** sql-op :union, :union-all
   :PROPERTIES:
   :CUSTOM_ID: 026a2773-c17f-4cb2-a86c-34babf8c48a2
   :END:

The union operation generally eliminates what it thinks are duplicate rows. The union-all operation preserves duplicate rows. The examples below use the union-all operator, but the syntax would be the same with union.
#+BEGIN_SRC lisp
(query (:select 'id 'name
                :from (:as (:union-all
                            (:select 'id 'name :from 'countries
                                     :where (:<= 'name "B" ))
                            (:select 'id 'name :from 'countries
                                     :where (:>= 'name "V" )))
                           'a)))

(query (:select 'a.id 'a.name 'a.region
                :from (:as (:union-all
                            (:select 'countries.id 'countries.name
                                     (:as 'regions.name 'region)
                                     :from 'countries 'regions
                                     :where (:and
                                             (:<= 'countries.name "B" )
                                             (:= 'regions.id 'countries.region-id )))
                            (:select 'countries.id 'countries.name
                                     (:as 'regions.name 'region)
                                     :from 'countries 'regions
                                     :where (:and
                                             (:>= 'countries.name "V" )
                                             (:= 'regions.id 'countries.region-id ))))
                           'a)
                :group-by 'a.id 'a.region 'a.name))
#+END_SRC

** sql-op :except, :except-all
   :PROPERTIES:
   :CUSTOM_ID: 4f77625f-4b6e-417d-8b56-d76835d6832d
   :END:
:except removes all matches. :except-all is slightly different.
If the first select statement has two rows that match a single row in the second
select statement, only one is removed.
#+BEGIN_SRC lisp
(query (:except (:select 'id 'name
                         :from 'countries
                         :where (:like 'name "%New%"))
                (:select 'id 'name
                         :from 'countries
                         :where (:like 'name "%Zealand%"))))

(query (:except-all (:select '* :from 'clients) (:select '* :from 'vips)))

#+END_SRC

