doc/s-sql.html

<div id="outline-container-org16eccba" class="outline-3">
<h3 id="1be1a168-6bc5-4df1-acc2-55d4f223d2c8"><a id="org16eccba"></a><a id="ID-405ec72e-7b79-4d96-aa32-1a3f931dd5a4"></a>sql-op :+, :*, :%, :&amp;, :|, :||, :and, :or, :=, :/, :!=, :&lt;, :&gt;, :&lt;=, :&gt;=, :^, :union, :union-all, :intersect, :intersect-all, :except, :except-all (&amp;rest args)</h3>
<div class="outline-text-3" id="text-1be1a168-6bc5-4df1-acc2-55d4f223d2c8">
<p>
These are expanded as infix operators. When meaningful, they allow more than
two arguments. :- can also be used as a unary operator to negate a value.
Note that the arguments to :union, :union-all, :intersect, and :except
should be queries (:select forms).
</p>

<p>
Note that you'll have to escape pipe characters to enter them as keywords. S-SQL
handles the empty keyword symbol (written :||) specially, and treats it like :\|\|,
so that it can be written without escapes. With :\|, this doesn't work.
</p>
</div>
</div>
<div id="outline-container-orgeaf9372" class="outline-3">
<h3 id="a052228e-bb93-42ed-8939-66d36a6e8cf7"><a id="orgeaf9372"></a>sql-op :or</h3>
<div class="outline-text-3" id="text-a052228e-bb93-42ed-8939-66d36a6e8cf7">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span>
                        (<span style="color: #98fb98; font-weight: bold;">:or</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"North America"</span>)
                             (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"Central America"</span>))
                        (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'countries.region-id))))
</pre>
</div>
<p>
or using parameterized queries
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span>
                        (<span style="color: #98fb98; font-weight: bold;">:or</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name '$1)
                             (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name '$2))
                        (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'countries.region-id)))
  <span style="color: #cd8162;">"North America"</span> <span style="color: #cd8162;">"Central America"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae81f49" class="outline-3">
<h3 id="307eae77-4dae-4e28-a868-55a2dd9aa2eb"><a id="orgae81f49"></a>sql-op :intersect</h3>
<div class="outline-text-3" id="text-307eae77-4dae-4e28-a868-55a2dd9aa2eb">
<p>
Intersect produces a result contain rows that appear on all the sub-selects.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:intersect</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.name
                            <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                            <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:&lt;</span> 'latitude 16.44))
                   (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.name
                            <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                            <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'region-id 'regions.id)
                                         (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"Caribbean"</span>)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8035a5a" class="outline-3">
<h3 id="026a2773-c17f-4cb2-a86c-34babf8c48a2"><a id="org8035a5a"></a>sql-op :union, :union-all</h3>
<div class="outline-text-3" id="text-026a2773-c17f-4cb2-a86c-34babf8c48a2">
<p>
The union operation generally eliminates what it thinks are duplicate rows. The union-all operation preserves duplicate rows. The examples below use the union-all operator, but the syntax would be the same with union.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:union-all</span>
                            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:&lt;=</span> 'name <span style="color: #cd8162;">"B"</span> ))
                            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:&gt;=</span> 'name <span style="color: #cd8162;">"V"</span> )))
                           'a)))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'a.id 'a.name 'a.region
                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:union-all</span>
                            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.id 'countries.name
                                     (<span style="color: #98fb98; font-weight: bold;">:as</span> 'regions.name 'region)
                                     <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span>
                                             (<span style="color: #98fb98; font-weight: bold;">:&lt;=</span> 'countries.name <span style="color: #cd8162;">"B"</span> )
                                             (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'countries.region-id )))
                            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.id 'countries.name
                                     (<span style="color: #98fb98; font-weight: bold;">:as</span> 'regions.name 'region)
                                     <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span>
                                             (<span style="color: #98fb98; font-weight: bold;">:&gt;=</span> 'countries.name <span style="color: #cd8162;">"V"</span> )
                                             (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'countries.region-id ))))
                           'a)
                <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'a.id 'a.region 'a.name))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0025ddc" class="outline-3">
<h3 id="4f77625f-4b6e-417d-8b56-d76835d6832d"><a id="org0025ddc"></a>sql-op :except, :except-all</h3>
<div class="outline-text-3" id="text-4f77625f-4b6e-417d-8b56-d76835d6832d">
<p>
:except removes all matches. :except-all is slightly different.
If the first select statement has two rows that match a single row in the second
select statement, only one is removed.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:except</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name
                         <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                         <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:like</span> 'name <span style="color: #cd8162;">"%New%"</span>))
                (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name
                         <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                         <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:like</span> 'name <span style="color: #cd8162;">"%Zealand%"</span>))))

(query (<span style="color: #98fb98; font-weight: bold;">:except-all</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'clients) (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'vips)))

</pre>
</div>
</div>
</div>
