doc/s-sql.html

<div id="outline-container-orge4c9f25" class="outline-3">
<h3 id="b3d56cb5-5e5d-45f2-bb3e-3076a02cbe39"><a id="orge4c9f25"></a><a id="ID-1604e97e-40e9-4fca-bf0a-897850766386"></a>sql-op :~, :not (arg)</h3>
<div class="outline-text-3" id="text-b3d56cb5-5e5d-45f2-bb3e-3076a02cbe39">
<p>
Unary operators for bitwise and logical negation.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'recommendedby
                           (<span style="color: #98fb98; font-weight: bold;">:count</span> '*)
                           <span style="color: #98fb98; font-weight: bold;">:from</span> 'cd.members
                           <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:not</span> (<span style="color: #98fb98; font-weight: bold;">:is-null</span> 'recommendedby))
                           <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'recommendedby)
                  'recommendedby))
</pre>
</div>
</div>
</div>
<div id="outline-container-org016b767" class="outline-3">
<h3 id="9966a954-465b-4623-8e42-8b13ce6ea116"><a id="org016b767"></a>sql-op :any, :any*</h3>
<div class="outline-text-3" id="text-9966a954-465b-4623-8e42-8b13ce6ea116">
<p>
Any needs to be considered as a special case. Quoting Marijn Haverbeke here,"Postgres has both a function-call-style any and an infix any, and S-SQL's syntax doesn't allow them to be distinguished." As a result, postmodern has a regular :any sql-op and a :any* sql-op, which expand slightly differently.
</p>

<p>
In general, the any qualifier in an sql statement looks at a subquery and does a comparison against that subquery. Sticking with our countries table, we have latitude, longitude data for every country (I'm not sure whether my table pulled the capital cities or the geographic center) and some designated a region for each country, so we have a region-id that matches the primary key 'id' in a regions table.
</p>

<p>
Out of curiosity, let's determine which countries in "North America" have a longitude less than any country in "South America". The standard sql could look like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #cd8162;">"select countries.name</span>
<span style="color: #cd8162;">        from countries,regions</span>
<span style="color: #cd8162;">        where regions.id=region_id</span>
<span style="color: #cd8162;">              and regions.name='North America'</span>
<span style="color: #cd8162;">              and longitude &gt; any(select longitude</span>
<span style="color: #cd8162;">                                         from countries, regions</span>
<span style="color: #cd8162;">                                         where region_id = regions.id</span>
<span style="color: #cd8162;">                                         and regions.name='South America')"</span>)
((<span style="color: #cd8162;">"Bermuda"</span>) (<span style="color: #cd8162;">"Greenland"</span>))
</pre>
</div>

<p>
This can be re-phrased in s-sql as
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.name
          <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
          <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'region-id)
                       (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"North America"</span>)
                       (<span style="color: #98fb98; font-weight: bold;">:&gt;</span> 'longitude
                           (<span style="color: #98fb98; font-weight: bold;">:any</span>
                            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'longitude
                                     <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'region-id)
                                                  (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"South America"</span>))))))))
((<span style="color: #cd8162;">"Bermuda"</span>) (<span style="color: #cd8162;">"Greenland"</span>))
</pre>
</div>

<p>
Subselects work fine in both regular sql and s-sql. If you have already calculated your subselect and put it in a variable, that variable needs to be a vector and whether you should use the :any sql-op or the :any* sql-op depends on your phrasing. (Notice that the second variation has an asterisk). (If you try to use a list, you will trigger an error message that you cannot convert that into an sql literal.)
</p>

<p>
The SQL keyword ANY can be used in a parameterized sql statement if you provide it with a vector. The following two toy examples work in raw sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #cd8162;">"select name from countries where id=any($1)"</span>
       (vector 21 22))
((<span style="color: #cd8162;">"Iceland"</span>) (<span style="color: #cd8162;">"US"</span>))

(<span style="color: #00ffff;">let</span> ((toy-query (vector 21 22)))
     (query <span style="color: #cd8162;">"select name from countries where id=any($1)"</span>
       toy-query))
((<span style="color: #cd8162;">"Iceland"</span>) (<span style="color: #cd8162;">"US"</span>))

</pre>
</div>

<p>
Now using s-sql and keeping with the toy example, notice that using :any does not work, but using :any* does work.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((toy-query (vector 21 22)))
  (query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                  <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                  <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id (<span style="color: #98fb98; font-weight: bold;">:any</span> '$1)))
         toy-query))
<span style="color: #cd4f39;">; </span><span style="color: #cd4f39;">Evaluation aborted on #&lt;CL-POSTGRES-ERROR:SYNTAX-ERROR-OR-ACCESS-VIOLATION {10030AF6A1}&gt;.</span>

(<span style="color: #00ffff;">let</span> ((toy-query (vector 21 22)))
  (query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                  <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                  <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id (<span style="color: #98fb98; font-weight: bold;">:any*</span> '$1)))
         toy-query))
((<span style="color: #cd8162;">"Iceland"</span>) (<span style="color: #cd8162;">"US"</span>))
</pre>
</div>
<p>
Going back to our earlier example, remember that I said that unless you use a subselect, you need to provide a vector to :any or :any*. A standard query returns a list, not a vector. So you would need to coerce the variable into a vector before you pass it to :any*. See below as an example.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((South-America
       (coerce
         (query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'longitude
                         <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                         <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'region-id)
                                      (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"South America"</span>)))
                 <span style="color: #98fb98; font-weight: bold;">:column</span>))
        'vector))
  (query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'countries.name
                  <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                  <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'region-id)
                               (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"North America"</span>)
                               (<span style="color: #98fb98; font-weight: bold;">:&gt;</span> 'longitude
                                   (<span style="color: #98fb98; font-weight: bold;">:any*</span> South-America))))))
((<span style="color: #cd8162;">"Bermuda"</span>) (<span style="color: #cd8162;">"Greenland"</span>))
</pre>
</div>
</div>
</div>
