doc/s-sql.org
** sql-op :function (name (&rest arg-types) return-type stability body)
   :PROPERTIES:
   :ID:       55203563-3759-427f-8147-2396c642144d
   :CUSTOM_ID: aa82bebc-cc27-4b8f-b59d-b27b4c788da3
   :END:

Create a stored procedure. The argument and return types are interpreted as
type names and not evaluated. Stability should be one of :immutable, :stable,
or :volatile (see the PostgreSQL documentation). For example, a function that
gets foobars by id:
#+BEGIN_SRC lisp
(:function 'get-foobar (integer) foobar :stable (:select '* :from 'foobar :where (:= 'id '$1)))
#+END_SRC

** sql-op :~, :~*, :!~, :!~* (string pattern)
   :PROPERTIES:
   :ID:       228320ed-6925-4a55-92c8-b48066f7e02c
   :CUSTOM_ID: 104689b2-d97e-434f-9abc-706779fb62c8
   :END:

Regular expression matching operators. The exclamation mark means 'does not match',
the asterisk makes the match case-insensitive.
#+BEGIN_SRC lisp
(query (:select (:regexp_match "foobarbequebaz" "bar.*que")) :single)

#("barbeque")

(query (:select (:regexp_match "foobarbequebaz" "bar.~que")) :single)

:NULL

(query (:select (:~ "foobarbequebaz" "bar.*que") ) :single)

t

(query (:select (:!~ "foobarbequebaz" "bar.*que") ) :single)

nil

(query (:select (:~ "foobarbequebaz" "barque") ) :single)

nil

(query (:select (:~ "foobarbequebaz" "barbeque") ) :single)

t

(query (:select (:~ "foobarBequebaz" "barbeque") ) :single)

nil

(query (:select (:~* "foobarBequebaz" "barbeque") ) :single)

t

(query (:select 'id 'text :from 'text-search :where (:~ 'text "sushi")))

#+END_SRC

** sql-op :like, :ilike (string pattern)
   :PROPERTIES:
   :ID:       89ce2b9e-50d8-4376-99e5-b085639f2cae
   :CUSTOM_ID: 917f42c1-8a9d-4c84-8523-6ee75e98a676
   :END:

Simple SQL string matching operators (:ilike is case-insensitive).
#+BEGIN_SRC lisp
(query (:select 'id 'name
                :from 'countries
                :where (:like 'name "%New%")))
#+END_SRC
** sql-op :@@
   :PROPERTIES:
   :ID:       7e33f04a-09f8-4177-bf8b-ae6f42eb33cc
   :CUSTOM_ID: 36910254-7f45-4cbb-a68f-bd5733f28bf5
   :END:

Fast Text Search match operator.

** sql-op :desc (column)
   :PROPERTIES:
   :ID:       bfa41b7a-e1be-42be-b1b7-ecaa0913391c
   :CUSTOM_ID: 9bbb3261-b84d-4a84-8d58-a30c165a0ca5
   :END:

Used to invert the meaning of an operator in an :order-by clause.
#+BEGIN_SRC lisp
(query (:order-by
        (:select 'location 'time 'report
                 :distinct-on 'location
                 :from 'weather-reports)
        'location  (:desc 'time)))
#+END_SRC
** sql-op :nulls-first, :nulls-last (column)
   :PROPERTIES:
   :ID:       53293652-8d98-40fb-b629-7f3350a1b16c
   :CUSTOM_ID: 0ea834ca-4deb-4da8-a492-1a73ae626e21
   :END:

Used to determine where :null values appear in an :order-by clause.

