doc/s-sql.html

<div id="outline-container-org973431a" class="outline-3">
<h3 id="aa82bebc-cc27-4b8f-b59d-b27b4c788da3"><a id="org973431a"></a><a id="ID-55203563-3759-427f-8147-2396c642144d"></a>sql-op :function (name (&amp;rest arg-types) return-type stability body)</h3>
<div class="outline-text-3" id="text-aa82bebc-cc27-4b8f-b59d-b27b4c788da3">
<p>
Create a stored procedure. The argument and return types are interpreted as
type names and not evaluated. Stability should be one of :immutable, :stable,
or :volatile (see the PostgreSQL documentation). For example, a function that
gets foobars by id:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #98fb98; font-weight: bold;">:function</span> 'get-foobar (integer) foobar <span style="color: #98fb98; font-weight: bold;">:stable</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'foobar <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id '$1)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5031b0e" class="outline-3">
<h3 id="104689b2-d97e-434f-9abc-706779fb62c8"><a id="org5031b0e"></a><a id="ID-228320ed-6925-4a55-92c8-b48066f7e02c"></a>sql-op :~, :~*, :!~, :!~* (string pattern)</h3>
<div class="outline-text-3" id="text-104689b2-d97e-434f-9abc-706779fb62c8">
<p>
Regular expression matching operators. The exclamation mark means 'does not match',
the asterisk makes the match case-insensitive.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regexp_match</span> <span style="color: #cd8162;">"foobarbequebaz"</span> <span style="color: #cd8162;">"bar.*que"</span>)) <span style="color: #98fb98; font-weight: bold;">:single</span>)

#(<span style="color: #cd8162;">"barbeque"</span>)

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regexp_match</span> <span style="color: #cd8162;">"foobarbequebaz"</span> <span style="color: #cd8162;">"bar.~que"</span>)) <span style="color: #98fb98; font-weight: bold;">:single</span>)

<span style="color: #98fb98; font-weight: bold;">:NULL</span>

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:~</span> <span style="color: #cd8162;">"foobarbequebaz"</span> <span style="color: #cd8162;">"bar.*que"</span>) ) <span style="color: #98fb98; font-weight: bold;">:single</span>)

t

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:!~</span> <span style="color: #cd8162;">"foobarbequebaz"</span> <span style="color: #cd8162;">"bar.*que"</span>) ) <span style="color: #98fb98; font-weight: bold;">:single</span>)

nil

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:~</span> <span style="color: #cd8162;">"foobarbequebaz"</span> <span style="color: #cd8162;">"barque"</span>) ) <span style="color: #98fb98; font-weight: bold;">:single</span>)

nil

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:~</span> <span style="color: #cd8162;">"foobarbequebaz"</span> <span style="color: #cd8162;">"barbeque"</span>) ) <span style="color: #98fb98; font-weight: bold;">:single</span>)

t

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:~</span> <span style="color: #cd8162;">"foobarBequebaz"</span> <span style="color: #cd8162;">"barbeque"</span>) ) <span style="color: #98fb98; font-weight: bold;">:single</span>)

nil

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:~*</span> <span style="color: #cd8162;">"foobarBequebaz"</span> <span style="color: #cd8162;">"barbeque"</span>) ) <span style="color: #98fb98; font-weight: bold;">:single</span>)

t

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'text <span style="color: #98fb98; font-weight: bold;">:from</span> 'text-search <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:~</span> 'text <span style="color: #cd8162;">"sushi"</span>)))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgec53576" class="outline-3">
<h3 id="917f42c1-8a9d-4c84-8523-6ee75e98a676"><a id="orgec53576"></a><a id="ID-89ce2b9e-50d8-4376-99e5-b085639f2cae"></a>sql-op :like, :ilike (string pattern)</h3>
<div class="outline-text-3" id="text-917f42c1-8a9d-4c84-8523-6ee75e98a676">
<p>
Simple SQL string matching operators (:ilike is case-insensitive).
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:like</span> 'name <span style="color: #cd8162;">"%New%"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6a69632" class="outline-3">
<h3 id="36910254-7f45-4cbb-a68f-bd5733f28bf5"><a id="org6a69632"></a><a id="ID-7e33f04a-09f8-4177-bf8b-ae6f42eb33cc"></a>sql-op :@@</h3>
<div class="outline-text-3" id="text-36910254-7f45-4cbb-a68f-bd5733f28bf5">
<p>
Fast Text Search match operator.
</p>
</div>
</div>

<div id="outline-container-org843698f" class="outline-3">
<h3 id="9bbb3261-b84d-4a84-8d58-a30c165a0ca5"><a id="org843698f"></a><a id="ID-bfa41b7a-e1be-42be-b1b7-ecaa0913391c"></a>sql-op :desc (column)</h3>
<div class="outline-text-3" id="text-9bbb3261-b84d-4a84-8d58-a30c165a0ca5">
<p>
Used to invert the meaning of an operator in an :order-by clause.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span>
        (<span style="color: #98fb98; font-weight: bold;">:select</span> 'location 'time 'report
                 <span style="color: #98fb98; font-weight: bold;">:distinct-on</span> 'location
                 <span style="color: #98fb98; font-weight: bold;">:from</span> 'weather-reports)
        'location  (<span style="color: #98fb98; font-weight: bold;">:desc</span> 'time)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d3bb58" class="outline-3">
<h3 id="0ea834ca-4deb-4da8-a492-1a73ae626e21"><a id="org2d3bb58"></a><a id="ID-53293652-8d98-40fb-b629-7f3350a1b16c"></a>sql-op :nulls-first, :nulls-last (column)</h3>
<div class="outline-text-3" id="text-0ea834ca-4deb-4da8-a492-1a73ae626e21">
<p>
Used to determine where :null values appear in an :order-by clause.
</p>
</div>
</div>
