doc/s-sql.org
** sql-op :as (form name &rest fields)
   :PROPERTIES:
   :ID:       ca6fe6aa-07ad-4931-afe5-9d9087059dca
   :CUSTOM_ID: d7692fef-4904-47a3-bdc6-2c697c89f9c9
   :END:

Also known in some explanations as "alias". This assigns a name to a column or
table in a :select form. When fields are given, they are added after the name,
in parentheses. For example, (:as 'table1 't1 'foo 'bar)
becomes table1 AS t1(foo, bar). When you need to specify types for the fields,
you can do something like (:as 'table2 't2 ('foo integer)). Note that names are
quoted, types are not (when using sql-compile or sql-template, you can leave
out the quotes entirely).
#+BEGIN_SRC lisp
(query (:select (:as 'countries.name 'country)
                (:as 'regions.name 'region)
                :from 'countries 'regions
                       :where (:and (:= 'regions.id 'region-id)
                                     (:= 'regions.name "Central America")))
        :alists)

(((:COUNTRY . "Belize") (:REGION . "Central America")) ((:COUNTRY . "Costa Rica")
(:REGION . "Central America")) ((:COUNTRY . "El Salvador")
(:REGION . "Central America")) ((:COUNTRY . "Guatemala")
(:REGION . "Central America")) ((:COUNTRY . "Panama") (:REGION . "Central America"))
((:COUNTRY . "Nicaragua") (:REGION . "Central America")))
#+END_SRC
The following uses aliases for both columns and tables in the from and inner-join clauses:
#+BEGIN_SRC lisp
(query (:order-by
        (:select (:as 'recs.firstname 'firstname)
                 (:as 'recs.surname 'surname)
                 :distinct
                 :from (:as 'cd.members 'mems)
                 :inner-join (:as 'cd.members 'recs)
                 :on (:= 'recs.memid 'mems.recommendedby))
        'surname 'firstname))
#+END_SRC

Note: Postmodern does not allow you to create an unescaped string alias. In other words, you cannot generate this:
#+BEGIN_SRC lisp
"select sum(slots as "Total Slots" from cd.bookings"
#+END_SRC

without using :raw

** sql-op :cast (query)
   :PROPERTIES:
   :ID:       fdab4fe0-46bb-4240-b629-773c21b8d304
   :CUSTOM_ID: 9550c5e3-dfb3-4997-9762-ab5eb2f468ee
   :END:

The CAST operator. Takes a query as an argument, and returns the result
explicitly cast by postgresql to a specific type. Unlike :type, :cast can
pass the type as a variable.
#+BEGIN_SRC lisp
(query (:select (:cast (:as "20" 'integer)))
        :single)
20

(let ((type 'text))
   (query (:select (:cast (:as "20" type)))
     :single))
"20"

(let ((type 'integer))
   (query (:select (:cast (:as "20" type)))
     :single))
20

(query (:union (:select (:as 1 'real))
               (:select (:cast (:as "2.2" 'real)))))
((1.0) (2.2))
#+END_SRC
** sql-op :type (query)
   :PROPERTIES:
   :ID:       249f05e6-b7c7-4b53-a215-73673f9aa2b0
   :CUSTOM_ID: a90093e3-2e1f-4694-825b-eb800103d64e
   :END:
Is similar to cast but uses the postgresql :: formating. Unlike cast it will not
accept a variable as the type.

E.g.
#+BEGIN_SRC lisp
(sql (:select (:as (:- (:type (:now) 'date) 'x) 'some-date) :from (:as (:generate-series 1 10) 'x)))

"(SELECT (now()::DATE - x) AS some_date FROM generate_series(1, 10) AS x)"
#+END_SRC
** sql-op :create-composite-type (type-name &rest args)
   :PROPERTIES:
   :ID:       6fdeb899-f180-47f7-b8e1-6ad314c7952b
   :CUSTOM_ID: 353c0984-83e9-490f-b88a-789aacfc667f
   :END:
Creates a composite type with a type-name and two or more columns. E.g.
#+BEGIN_SRC lisp
(query (:create-composite-type 'fullname (first-name text) (last-name text)))
#+END_SRC
** sql-op :exists (query)
   :PROPERTIES:
   :ID:       edab7fef-c6c1-4875-8b41-54bf05242554
   :CUSTOM_ID: bd2e387f-90fb-4688-89db-dadc148886f4
   :END:

The EXISTS operator. Takes a query as an argument, and returns true or false
depending on whether that query returns any rows. In the example below, it is
applied to a subquery.
#+BEGIN_SRC lisp
(query (:select 'id 'name
                :from 'regions
                :where (:exists
                        (:select 'region-id
                         :from 'countries
                         :where (:and
                                  (:= 'countries.name "Costa Rica")
                                  (:= 'regions.id 'countries.region-id))))))
#+END_SRC
** sql-op :is-null (arg)
   :PROPERTIES:
   :ID:       48e3d777-1fde-4e60-b8d2-d8f7b8fea7bf
   :CUSTOM_ID: 6316788c-b2f7-4fd1-bc64-626bea092016
   :END:

Test whether a value is null.
#+BEGIN_SRC lisp
(query (:select 'ta :from 'a :where (:not (:is-null 'ta))))
#+END_SRC
