doc/s-sql.html

<div id="outline-container-orgeba46cc" class="outline-3">
<h3 id="d7692fef-4904-47a3-bdc6-2c697c89f9c9"><a id="orgeba46cc"></a><a id="ID-ca6fe6aa-07ad-4931-afe5-9d9087059dca"></a>sql-op :as (form name &amp;rest fields)</h3>
<div class="outline-text-3" id="text-d7692fef-4904-47a3-bdc6-2c697c89f9c9">
<p>
Also known in some explanations as "alias". This assigns a name to a column or
table in a :select form. When fields are given, they are added after the name,
in parentheses. For example, (:as 'table1 't1 'foo 'bar)
becomes table1 AS t1(foo, bar). When you need to specify types for the fields,
you can do something like (:as 'table2 't2 ('foo integer)). Note that names are
quoted, types are not (when using sql-compile or sql-template, you can leave
out the quotes entirely).
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'countries.name 'country)
                (<span style="color: #98fb98; font-weight: bold;">:as</span> 'regions.name 'region)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries 'regions
                       <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'region-id)
                                     (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.name <span style="color: #cd8162;">"Central America"</span>)))
        <span style="color: #98fb98; font-weight: bold;">:alists</span>)

(((<span style="color: #98fb98; font-weight: bold;">:COUNTRY</span> . <span style="color: #cd8162;">"Belize"</span>) (<span style="color: #98fb98; font-weight: bold;">:REGION</span> . <span style="color: #cd8162;">"Central America"</span>)) ((<span style="color: #98fb98; font-weight: bold;">:COUNTRY</span> . <span style="color: #cd8162;">"Costa Rica"</span>)
(<span style="color: #98fb98; font-weight: bold;">:REGION</span> . <span style="color: #cd8162;">"Central America"</span>)) ((<span style="color: #98fb98; font-weight: bold;">:COUNTRY</span> . <span style="color: #cd8162;">"El Salvador"</span>)
(<span style="color: #98fb98; font-weight: bold;">:REGION</span> . <span style="color: #cd8162;">"Central America"</span>)) ((<span style="color: #98fb98; font-weight: bold;">:COUNTRY</span> . <span style="color: #cd8162;">"Guatemala"</span>)
(<span style="color: #98fb98; font-weight: bold;">:REGION</span> . <span style="color: #cd8162;">"Central America"</span>)) ((<span style="color: #98fb98; font-weight: bold;">:COUNTRY</span> . <span style="color: #cd8162;">"Panama"</span>) (<span style="color: #98fb98; font-weight: bold;">:REGION</span> . <span style="color: #cd8162;">"Central America"</span>))
((<span style="color: #98fb98; font-weight: bold;">:COUNTRY</span> . <span style="color: #cd8162;">"Nicaragua"</span>) (<span style="color: #98fb98; font-weight: bold;">:REGION</span> . <span style="color: #cd8162;">"Central America"</span>)))
</pre>
</div>
<p>
The following uses aliases for both columns and tables in the from and inner-join clauses:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span>
        (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'recs.firstname 'firstname)
                 (<span style="color: #98fb98; font-weight: bold;">:as</span> 'recs.surname 'surname)
                 <span style="color: #98fb98; font-weight: bold;">:distinct</span>
                 <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'cd.members 'mems)
                 <span style="color: #98fb98; font-weight: bold;">:inner-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'cd.members 'recs)
                 <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'recs.memid 'mems.recommendedby))
        'surname 'firstname))
</pre>
</div>

<p>
Note: Postmodern does not allow you to create an unescaped string alias. In other words, you cannot generate this:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #cd8162;">"select sum(slots as "</span>Total Slots<span style="color: #cd8162;">" from cd.bookings"</span>
</pre>
</div>

<p>
without using :raw
</p>
</div>
</div>

<div id="outline-container-org903e641" class="outline-3">
<h3 id="9550c5e3-dfb3-4997-9762-ab5eb2f468ee"><a id="org903e641"></a><a id="ID-fdab4fe0-46bb-4240-b629-773c21b8d304"></a>sql-op :cast (query)</h3>
<div class="outline-text-3" id="text-9550c5e3-dfb3-4997-9762-ab5eb2f468ee">
<p>
The CAST operator. Takes a query as an argument, and returns the result
explicitly cast by postgresql to a specific type. Unlike :type, :cast can
pass the type as a variable.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:cast</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> <span style="color: #cd8162;">"20"</span> 'integer)))
        <span style="color: #98fb98; font-weight: bold;">:single</span>)
20

(<span style="color: #00ffff;">let</span> ((type 'text))
   (query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:cast</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> <span style="color: #cd8162;">"20"</span> type)))
     <span style="color: #98fb98; font-weight: bold;">:single</span>))
<span style="color: #cd8162;">"20"</span>

(<span style="color: #00ffff;">let</span> ((type 'integer))
   (query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:cast</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> <span style="color: #cd8162;">"20"</span> type)))
     <span style="color: #98fb98; font-weight: bold;">:single</span>))
20

(query (<span style="color: #98fb98; font-weight: bold;">:union</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 1 'real))
               (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:cast</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> <span style="color: #cd8162;">"2.2"</span> 'real)))))
((1.0) (2.2))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3536a3c" class="outline-3">
<h3 id="a90093e3-2e1f-4694-825b-eb800103d64e"><a id="org3536a3c"></a><a id="ID-249f05e6-b7c7-4b53-a215-73673f9aa2b0"></a>sql-op :type (query)</h3>
<div class="outline-text-3" id="text-a90093e3-2e1f-4694-825b-eb800103d64e">
<p>
Is similar to cast but uses the postgresql :: formating. Unlike cast it will not
accept a variable as the type.
</p>

<p>
E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:-</span> (<span style="color: #98fb98; font-weight: bold;">:type</span> (<span style="color: #98fb98; font-weight: bold;">:now</span>) 'date) 'x) 'some-date) <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:generate-series</span> 1 10) 'x)))

<span style="color: #cd8162;">"(SELECT (now()::DATE - x) AS some_date FROM generate_series(1, 10) AS x)"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge046388" class="outline-3">
<h3 id="353c0984-83e9-490f-b88a-789aacfc667f"><a id="orge046388"></a><a id="ID-6fdeb899-f180-47f7-b8e1-6ad314c7952b"></a>sql-op :create-composite-type (type-name &amp;rest args)</h3>
<div class="outline-text-3" id="text-353c0984-83e9-490f-b88a-789aacfc667f">
<p>
Creates a composite type with a type-name and two or more columns. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:create-composite-type</span> 'fullname (first-name text) (last-name text)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org83dfda2" class="outline-3">
<h3 id="bd2e387f-90fb-4688-89db-dadc148886f4"><a id="org83dfda2"></a><a id="ID-edab7fef-c6c1-4875-8b41-54bf05242554"></a>sql-op :exists (query)</h3>
<div class="outline-text-3" id="text-bd2e387f-90fb-4688-89db-dadc148886f4">
<p>
The EXISTS operator. Takes a query as an argument, and returns true or false
depending on whether that query returns any rows. In the example below, it is
applied to a subquery.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'regions
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:exists</span>
                        (<span style="color: #98fb98; font-weight: bold;">:select</span> 'region-id
                         <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                         <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span>
                                  (<span style="color: #98fb98; font-weight: bold;">:=</span> 'countries.name <span style="color: #cd8162;">"Costa Rica"</span>)
                                  (<span style="color: #98fb98; font-weight: bold;">:=</span> 'regions.id 'countries.region-id))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgadd1bf0" class="outline-3">
<h3 id="6316788c-b2f7-4fd1-bc64-626bea092016"><a id="orgadd1bf0"></a><a id="ID-48e3d777-1fde-4e60-b8d2-d8f7b8fea7bf"></a>sql-op :is-null (arg)</h3>
<div class="outline-text-3" id="text-6316788c-b2f7-4fd1-bc64-626bea092016">
<p>
Test whether a value is null.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'ta <span style="color: #98fb98; font-weight: bold;">:from</span> 'a <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:not</span> (<span style="color: #98fb98; font-weight: bold;">:is-null</span> 'ta))))
</pre>
</div>
</div>
</div>
