doc/s-sql.org
** sql-op :not-null (arg)
   :PROPERTIES:
   :ID:       74c212eb-330e-459a-bdc4-2d2e75046972
   :CUSTOM_ID: d9feff95-b4ce-4809-93fc-886abd6b4467
   :END:
Test whether a value is not null.
#+BEGIN_SRC lisp
(query (:select 'ta :from 'a :where (:not-null 'ta)))
#+END_SRC
** sql-op :in (value set)
   :PROPERTIES:
   :ID:       45c17b50-7b34-42d9-8dd2-08ccd12fa7c0
   :CUSTOM_ID: 92a30d4e-ea95-45be-b80c-02f89f00c8ce
   :END:

Test whether a value is in a set of values.
#+BEGIN_SRC lisp
(query (:select 'name
                :from 'countries
                :where (:in 'id
                            (:set 20 21 23))))

(query (:select 'region 'product (:as (:sum 'quantity) 'product-units)
                (:as (:sum 'amount) 'product-sales)
                :from 'orders
                :where (:in 'region (:select 'region :from 'top-regions))
                :group-by 'region 'product))
#+END_SRC
** sql-op :not-in (value set)
   :PROPERTIES:
   :ID:       f8f9f42f-00b7-4b17-b2fb-2ef90dd8ec2c
   :CUSTOM_ID: d7b8aafa-6c0b-423c-82ee-170c9d562fe3
   :END:

Inverse of the above.

** sql-op :set (&rest elements)
   :PROPERTIES:
   :ID:       72eea20e-6e5f-4a9a-ba2f-f5f23327b397
   :CUSTOM_ID: 59c50390-eaef-4dd4-99a6-6615f3d8740c
   :END:

Denote a set of values. This operator has two interfaces. When
the elements are known at compile-time, they can be given as
multiple arguments to the operator. When they are not, a
single argument that evaluates to a list should be used.

The following would be the syntax in postmodern sql where the set is a list. If
you want to use a vector, then you need to use Any:

The following are equivalent
#+BEGIN_SRC lisp
(query (:select 'name
                :from 'countries
                :where (:in 'id
                            (:set 20 21 23))))

(let ((x (list 20 21 23)))
  (query (:select 'name
                  :from 'countries
                  :where (:in 'id
                              (:set x)))))

(query (:select 'name
                :from 'countries
                :where (:in 'id (:set (list 20 21 23)))))

#+END_SRC
However, the following will generate an error about inability to convert to an sql literal

#+BEGIN_SRC lisp
(query (:select 'name
                :from 'countries
                :where (:in 'id
                            (:set '(20 21 23)))))
#+END_SRC
Now with selecting a dao
#+BEGIN_SRC lisp
(select-dao 'countries
            (:in 'id
                 (:set (list 20 21 23
#+END_SRC
Now with selecting from a vector. Note both the use of any* and := instead of :in.
#+BEGIN_SRC lisp
(let ((x (vector 20 21 23)))
  (query (:select 'name
                  :from 'countries
                  :where (:= 'id (:any* x)))))
#+END_SRC
Note that the responses will still come back in a list of lists

IMPORTANT: If you are trying to use a list in a parametized statement, you can't. You have to convert the list to a vector and use "any" rather than "in."

** sql-op :array (query)
   :PROPERTIES:
   :ID:       f7a7e6fb-00f9-407b-b929-78f17e164052
   :CUSTOM_ID: 0ba8931b-6937-4ead-8d4e-af8ac2274683
   :END:

This is used when calling a select query into an array.  See [[file:array-notes.html][array-notes.html]]
for more detailed notes on the use of arrays.
#+BEGIN_SRC lisp
(query (:order-by
        (:select 'r.rolename
                 (:as (:array
                       (:select 'b.rolename
                                :from (:as 'pg_catalog.pg-auth-members 'm)
                                :inner-join (:as 'pg-catalog.pg-roles 'b)
                                :on (:= 'm.roleid 'b.oid)
                                :where (:= 'm.member 'r.oid )))
                      'memberof)

                 :from (:as 'pg-catalog.pg-roles 'r))
        1))

#+END_SRC

** sql-op :array[] (&rest args)
   :PROPERTIES:
   :ID:       1b9af15e-051a-401f-a251-1a7173685c9e
   :CUSTOM_ID: 3add4360-f9c0-4226-b083-ee50e7f0c436
   :END:

This is the general operator for arrays. It also handles statements that include
functions in the query such as (:+ 1 2), (:pi) in the array. See [[file:array-notes.html][array-notes.html]]
for more detailed notes on the use of arrays.
#+BEGIN_SRC lisp
(query (:select (:array-prepend 1 (:array[] 2 3))))

((#(1 2 3)))

(query (:select (:array-prepend 1 (:array[] 2 3)))
       :single)

#(1 2 3)
#+END_SRC

** sql-op :[] (form start &optional end)
   :PROPERTIES:
   :ID:       7afc83f1-4054-4a6c-8ea2-99549e037998
   :CUSTOM_ID: f0db95cd-c5ae-4942-a157-e3bd92fe8453
   :END:

Dereference an array value. If end is provided, extract a slice of the array.
Sample usage below, but also see [[file:array-notes.html][array-notes.html]] for more detailed notes on
the use of arrays.
#+BEGIN_SRC lisp
(query (:select 'receipe-id (:[] 'tags 2 3)
                :from 'receipe-tags-array
                :where (:= 'receipe-id 3)))
#+END_SRC

