doc/s-sql.html
<div id="outline-container-org407076d" class="outline-3">
<h3 id="d9feff95-b4ce-4809-93fc-886abd6b4467"><a id="org407076d"></a><a id="ID-74c212eb-330e-459a-bdc4-2d2e75046972"></a>sql-op :not-null (arg)</h3>
<div class="outline-text-3" id="text-d9feff95-b4ce-4809-93fc-886abd6b4467">
<p>
Test whether a value is not null.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'ta <span style="color: #98fb98; font-weight: bold;">:from</span> 'a <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:not-null</span> 'ta)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5811531" class="outline-3">
<h3 id="92a30d4e-ea95-45be-b80c-02f89f00c8ce"><a id="org5811531"></a><a id="ID-45c17b50-7b34-42d9-8dd2-08ccd12fa7c0"></a>sql-op :in (value set)</h3>
<div class="outline-text-3" id="text-92a30d4e-ea95-45be-b80c-02f89f00c8ce">
<p>
Test whether a value is in a set of values.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:in</span> 'id
                            (<span style="color: #98fb98; font-weight: bold;">:set</span> 20 21 23))))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'region 'product (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'quantity) 'product-units)
                (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'amount) 'product-sales)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'orders
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:in</span> 'region (<span style="color: #98fb98; font-weight: bold;">:select</span> 'region <span style="color: #98fb98; font-weight: bold;">:from</span> 'top-regions))
                <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'region 'product))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c59988" class="outline-3">
<h3 id="d7b8aafa-6c0b-423c-82ee-170c9d562fe3"><a id="org0c59988"></a><a id="ID-f8f9f42f-00b7-4b17-b2fb-2ef90dd8ec2c"></a>sql-op :not-in (value set)</h3>
<div class="outline-text-3" id="text-d7b8aafa-6c0b-423c-82ee-170c9d562fe3">
<p>
Inverse of the above.
</p>
</div>
</div>

<div id="outline-container-orge835b65" class="outline-3">
<h3 id="59c50390-eaef-4dd4-99a6-6615f3d8740c"><a id="orge835b65"></a><a id="ID-72eea20e-6e5f-4a9a-ba2f-f5f23327b397"></a>sql-op :set (&amp;rest elements)</h3>
<div class="outline-text-3" id="text-59c50390-eaef-4dd4-99a6-6615f3d8740c">
<p>
Denote a set of values. This operator has two interfaces. When
the elements are known at compile-time, they can be given as
multiple arguments to the operator. When they are not, a
single argument that evaluates to a list should be used.
</p>

<p>
The following would be the syntax in postmodern sql where the set is a list. If
you want to use a vector, then you need to use Any:
</p>

<p>
The following are equivalent
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:in</span> 'id
                            (<span style="color: #98fb98; font-weight: bold;">:set</span> 20 21 23))))

(<span style="color: #00ffff;">let</span> ((x (list 20 21 23)))
  (query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                  <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                  <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:in</span> 'id
                              (<span style="color: #98fb98; font-weight: bold;">:set</span> x)))))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:in</span> 'id (<span style="color: #98fb98; font-weight: bold;">:set</span> (list 20 21 23)))))

</pre>
</div>
<p>
However, the following will generate an error about inability to convert to an sql literal
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:in</span> 'id
                            (<span style="color: #98fb98; font-weight: bold;">:set</span> '(20 21 23)))))
</pre>
</div>
<p>
Now with selecting a dao
</p>
<div class="org-src-container">
<pre class="src src-lisp">(select-dao 'countries
            (<span style="color: #98fb98; font-weight: bold;">:in</span> 'id
                 (<span style="color: #98fb98; font-weight: bold;">:set</span> (list 20 21 23
</pre>
</div>
<p>
Now with selecting from a vector. Note both the use of any* and := instead of :in.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((x (vector 20 21 23)))
  (query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                  <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                  <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id (<span style="color: #98fb98; font-weight: bold;">:any*</span> x)))))
</pre>
</div>
<p>
Note that the responses will still come back in a list of lists
</p>

<p>
IMPORTANT: If you are trying to use a list in a parametized statement, you can't. You have to convert the list to a vector and use "any" rather than "in."
</p>
</div>
</div>

<div id="outline-container-orge4abe31" class="outline-3">
<h3 id="0ba8931b-6937-4ead-8d4e-af8ac2274683"><a id="orge4abe31"></a><a id="ID-f7a7e6fb-00f9-407b-b929-78f17e164052"></a>sql-op :array (query)</h3>
<div class="outline-text-3" id="text-0ba8931b-6937-4ead-8d4e-af8ac2274683">
<p>
This is used when calling a select query into an array.  See <a href="array-notes.html">array-notes.html</a>
for more detailed notes on the use of arrays.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span>
        (<span style="color: #98fb98; font-weight: bold;">:select</span> 'r.rolename
                 (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:array</span>
                       (<span style="color: #98fb98; font-weight: bold;">:select</span> 'b.rolename
                                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'pg_catalog.pg-auth-members 'm)
                                <span style="color: #98fb98; font-weight: bold;">:inner-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'pg-catalog.pg-roles 'b)
                                <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'm.roleid 'b.oid)
                                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'm.member 'r.oid )))
                      'memberof)

                 <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'pg-catalog.pg-roles 'r))
        1))

</pre>
</div>
</div>
</div>

<div id="outline-container-org08ad980" class="outline-3">
<h3 id="3add4360-f9c0-4226-b083-ee50e7f0c436"><a id="org08ad980"></a><a id="ID-1b9af15e-051a-401f-a251-1a7173685c9e"></a>sql-op :array[] (&amp;rest args)</h3>
<div class="outline-text-3" id="text-3add4360-f9c0-4226-b083-ee50e7f0c436">
<p>
This is the general operator for arrays. It also handles statements that include
functions in the query such as (:+ 1 2), (:pi) in the array. See <a href="array-notes.html">array-notes.html</a>
for more detailed notes on the use of arrays.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:array-prepend</span> 1 (<span style="color: #98fb98; font-weight: bold;">:array[]</span> 2 3))))

((#(1 2 3)))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:array-prepend</span> 1 (<span style="color: #98fb98; font-weight: bold;">:array[]</span> 2 3)))
       <span style="color: #98fb98; font-weight: bold;">:single</span>)

#(1 2 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ef4746" class="outline-3">
<h3 id="f0db95cd-c5ae-4942-a157-e3bd92fe8453"><a id="org7ef4746"></a><a id="ID-7afc83f1-4054-4a6c-8ea2-99549e037998"></a>sql-op :[] (form start &amp;optional end)</h3>
<div class="outline-text-3" id="text-f0db95cd-c5ae-4942-a157-e3bd92fe8453">
<p>
Dereference an array value. If end is provided, extract a slice of the array.
Sample usage below, but also see <a href="array-notes.html">array-notes.html</a> for more detailed notes on
the use of arrays.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'receipe-id (<span style="color: #98fb98; font-weight: bold;">:[]</span> 'tags 2 3)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'receipe-tags-array
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'receipe-id 3)))
</pre>
</div>
</div>
</div>
