doc/s-sql.org
** sql-op :extract (unit form)
   :PROPERTIES:
   :ID:       2ed4ee9b-b199-43df-9b4b-f33d67629793
   :CUSTOM_ID: 9d015a75-4987-4fc1-aa9b-6d17e2253eb0
   :END:

Extract a field from a date/time value. For example, (:extract :month (:now)).
#+BEGIN_SRC lisp
(query (:order-by
        (:select 'facid
                 (:as (:extract 'month 'starttime) 'month)
                 (:as (:sum 'slots) 'total-slots)
                 :from 'cd.bookings
                 :where (:and (:>= 'starttime "2012-01-01")
                              (:< 'starttime "2013-01-01"))
                 :group-by 'facid 'month)
        'facid 'month))
#+END_SRC
** sql-op :case (&rest clauses)
   :PROPERTIES:
   :ID:       95c998be-86a0-4553-ba2d-b1afa04205d6
   :CUSTOM_ID: afdd292b-e971-4a08-8d11-d441f1813f55
   :END:

A conditional expression. Clauses should take the form (test value). If
test is :else, an ELSE clause will be generated.
#+BEGIN_SRC lisp
(query (:select 'name
                (:as (:case ((:> 'monthlymaintenance 100) "expensive")
                            (:else "cheap")) 'cost)
                :from 'cd.facilities))
#+END_SRC
** sql-op :between (n start end)
   :PROPERTIES:
   :ID:       3eb62a27-e798-47c9-99a3-34efb86b0a6e
   :CUSTOM_ID: 3a29d134-3777-4558-8fbd-4825f3294b0a
   :END:

Test whether a value lies between two other values.
#+BEGIN_SRC lisp
(query (:select 'name
                :from 'countries
                :where (:between 'latitude -10 10))
       :column)
#+END_SRC
** sql-op :between-symmetric (n start end)
   :PROPERTIES:
   :ID:       7acf3e85-924c-42cb-84ec-4ab0430f6fc0
   :CUSTOM_ID: 8fd9bc96-0ba1-4afa-8cd3-1e1487699c8e
   :END:

Works like :between, except that the start value is not required to be
less than the end value.

** sql-op :dot (&rest names)
   :PROPERTIES:
   :ID:       5d7287f0-9527-46da-8bc7-8220b49b53a2
   :CUSTOM_ID: 7bb48541-f6ee-45fd-96a8-9e3411baeb8a
   :END:

Can be used to combine multiple names into a name of the form A.B to
refer to a column in a table, or a table in a schema. Note that you
can also just use a symbol with a dot in it.

** sql-op :type (form type)
   :PROPERTIES:
   :ID:       ccedb33a-7e65-4a25-9e0a-a5611665c9a8
   :CUSTOM_ID: 8fd30e57-b1e6-4c96-a5ba-e5fb7e5e0c7e
   :END:

Add a type declaration to a value, as in in "4.3::real". The second
argument is not evaluated normally, but put through sql-type-name to
get a type identifier.
#+BEGIN_SRC lisp
(query (:select (:type 1.0 int)))
#+END_SRC
** sql-op :raw (string)
   :PROPERTIES:
   :ID:       4833bb9a-223b-4d29-a9ca-8e243abb1fab
   :CUSTOM_ID: 31bb4caa-a93b-43f1-a2ca-c4676602daca
   :END:

Insert a string as-is into the query. This can be useful for doing things
that the syntax does not support, or to re-use parts of a query across
multiple queries:
#+BEGIN_SRC lisp
(let* ((test (sql (:and (:= 'foo 22) (:not-null 'bar))))
       (rows (query (:select '* :from 'baz :where (:raw test)))))
  (query (:delete-from 'baz :where (:raw test)))
  (do-stuff rows))
#+END_SRC

** sql-op :fetch (form amount &optional offset)
   :PROPERTIES:
   :ID:       0be0c31e-5246-42f3-a091-ccc8808e5d90
   :CUSTOM_ID: f995ea76-dbd8-48b6-9f69-9c27b1c22579
   :END:
Fetch is a more efficient way to do pagination instead of using limit and
offset. Fetch allows you to retrieve a limited set of rows, optionally offset
by a specified number of rows. In order to ensure this works correctly, you
should use the order-by clause. If the amount is not provided, it assumes
you only want to return 1 row.
https://www.postgresql.org/docs/current/sql-select.html

Examples:
#+BEGIN_SRC lisp
(query (:fetch (:order-by (:select 'id :from 'historical-events) 'id) 5))

((1) (2) (3) (4) (5))

(query (:fetch (:order-by (:select 'id :from 'historical-events) 'id) 5 10))

((11) (12) (13) (14) (15))
#+END_SRC

** sql-op :limit (query amount &optional offset)
   :PROPERTIES:
   :ID:       1b0cc29f-7b0a-4bca-8f79-5e763fc9a356
   :CUSTOM_ID: ea31c6a0-e40e-41e0-9d2e-98eb08da67e5
   :END:

In S-SQL limit is not part of the select operator, but an extra
operator that is applied to a query (this works out better when limiting
the union or intersection of multiple queries, same for sorting).
It limits the number of results to the amount given as the second
argument, and optionally offsets the result by the amount given
as the third argument.
#+BEGIN_SRC lisp
(query (:limit (:order-by (:select 'surname :distinct :from 'cd.members) 'surname) 10))
#+END_SRC
** sql-op :order-by (query &rest exprs)
   :PROPERTIES:
   :ID:       df5b679e-5f4b-4599-b533-82c3e9d4f13b
   :CUSTOM_ID: 3254857d-911f-403d-86c2-0d908f9df089
   :END:

Order the results of a query by the given expressions. See :desc for
when you want to invert an ordering. Note: This is not the same as
passing an :order-by parameter to an aggregation operator.
For that see Aggregation Operators.
#+BEGIN_SRC lisp
(query (:order-by (:select 'id 'name 'city 'salary (:every (:like 'name "J%"))
                                          :from 'employee
                                          :group-by 'name 'id 'salary 'city)
                                 'name))
#+END_SRC
