doc/s-sql.html

<div id="outline-container-org6079891" class="outline-3">
<h3 id="9d015a75-4987-4fc1-aa9b-6d17e2253eb0"><a id="org6079891"></a><a id="ID-2ed4ee9b-b199-43df-9b4b-f33d67629793"></a>sql-op :extract (unit form)</h3>
<div class="outline-text-3" id="text-9d015a75-4987-4fc1-aa9b-6d17e2253eb0">
<p>
Extract a field from a date/time value. For example, (:extract :month (:now)).
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span>
        (<span style="color: #98fb98; font-weight: bold;">:select</span> 'facid
                 (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:extract</span> 'month 'starttime) 'month)
                 (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'slots) 'total-slots)
                 <span style="color: #98fb98; font-weight: bold;">:from</span> 'cd.bookings
                 <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:&gt;=</span> 'starttime <span style="color: #cd8162;">"2012-01-01"</span>)
                              (<span style="color: #98fb98; font-weight: bold;">:&lt;</span> 'starttime <span style="color: #cd8162;">"2013-01-01"</span>))
                 <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'facid 'month)
        'facid 'month))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga88ef6b" class="outline-3">
<h3 id="afdd292b-e971-4a08-8d11-d441f1813f55"><a id="orga88ef6b"></a><a id="ID-95c998be-86a0-4553-ba2d-b1afa04205d6"></a>sql-op :case (&amp;rest clauses)</h3>
<div class="outline-text-3" id="text-afdd292b-e971-4a08-8d11-d441f1813f55">
<p>
A conditional expression. Clauses should take the form (test value). If
test is :else, an ELSE clause will be generated.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:case</span> ((<span style="color: #98fb98; font-weight: bold;">:&gt;</span> 'monthlymaintenance 100) <span style="color: #cd8162;">"expensive"</span>)
                            (<span style="color: #98fb98; font-weight: bold;">:else</span> <span style="color: #cd8162;">"cheap"</span>)) <span style="color: #cd5c5c; font-weight: bold;">'cost)</span>
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'cd.facilities))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb0a2a94" class="outline-3">
<h3 id="3a29d134-3777-4558-8fbd-4825f3294b0a"><a id="orgb0a2a94"></a><a id="ID-3eb62a27-e798-47c9-99a3-34efb86b0a6e"></a>sql-op :between (n start end)</h3>
<div class="outline-text-3" id="text-3a29d134-3777-4558-8fbd-4825f3294b0a">
<p>
Test whether a value lies between two other values.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'name
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'countries
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:between</span> 'latitude -10 10))
       <span style="color: #98fb98; font-weight: bold;">:column</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8643308" class="outline-3">
<h3 id="8fd9bc96-0ba1-4afa-8cd3-1e1487699c8e"><a id="org8643308"></a><a id="ID-7acf3e85-924c-42cb-84ec-4ab0430f6fc0"></a>sql-op :between-symmetric (n start end)</h3>
<div class="outline-text-3" id="text-8fd9bc96-0ba1-4afa-8cd3-1e1487699c8e">
<p>
Works like :between, except that the start value is not required to be
less than the end value.
</p>
</div>
</div>

<div id="outline-container-org0a908df" class="outline-3">
<h3 id="7bb48541-f6ee-45fd-96a8-9e3411baeb8a"><a id="org0a908df"></a><a id="ID-5d7287f0-9527-46da-8bc7-8220b49b53a2"></a>sql-op :dot (&amp;rest names)</h3>
<div class="outline-text-3" id="text-7bb48541-f6ee-45fd-96a8-9e3411baeb8a">
<p>
Can be used to combine multiple names into a name of the form A.B to
refer to a column in a table, or a table in a schema. Note that you
can also just use a symbol with a dot in it.
</p>
</div>
</div>

<div id="outline-container-orge392a83" class="outline-3">
<h3 id="8fd30e57-b1e6-4c96-a5ba-e5fb7e5e0c7e"><a id="orge392a83"></a><a id="ID-ccedb33a-7e65-4a25-9e0a-a5611665c9a8"></a>sql-op :type (form type)</h3>
<div class="outline-text-3" id="text-8fd30e57-b1e6-4c96-a5ba-e5fb7e5e0c7e">
<p>
Add a type declaration to a value, as in in "4.3::real". The second
argument is not evaluated normally, but put through sql-type-name to
get a type identifier.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:type</span> 1.0 int)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdfdf226" class="outline-3">
<h3 id="31bb4caa-a93b-43f1-a2ca-c4676602daca"><a id="orgdfdf226"></a><a id="ID-4833bb9a-223b-4d29-a9ca-8e243abb1fab"></a>sql-op :raw (string)</h3>
<div class="outline-text-3" id="text-31bb4caa-a93b-43f1-a2ca-c4676602daca">
<p>
Insert a string as-is into the query. This can be useful for doing things
that the syntax does not support, or to re-use parts of a query across
multiple queries:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let*</span> ((test (sql (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'foo 22) (<span style="color: #98fb98; font-weight: bold;">:not-null</span> 'bar))))
       (rows (query (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'baz <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:raw</span> test)))))
  (query (<span style="color: #98fb98; font-weight: bold;">:delete-from</span> 'baz <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:raw</span> test)))
  (<span style="color: #00ffff;">do-stuff</span> rows))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgade4902" class="outline-3">
<h3 id="f995ea76-dbd8-48b6-9f69-9c27b1c22579"><a id="orgade4902"></a><a id="ID-0be0c31e-5246-42f3-a091-ccc8808e5d90"></a>sql-op :fetch (form amount &amp;optional offset)</h3>
<div class="outline-text-3" id="text-f995ea76-dbd8-48b6-9f69-9c27b1c22579">
<p>
Fetch is a more efficient way to do pagination instead of using limit and
offset. Fetch allows you to retrieve a limited set of rows, optionally offset
by a specified number of rows. In order to ensure this works correctly, you
should use the order-by clause. If the amount is not provided, it assumes
you only want to return 1 row.
<a href="https://www.postgresql.org/docs/current/sql-select.html">https://www.postgresql.org/docs/current/sql-select.html</a>
</p>

<p>
Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:fetch</span> (<span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id <span style="color: #98fb98; font-weight: bold;">:from</span> 'historical-events) 'id) 5))

((1) (2) (3) (4) (5))

(query (<span style="color: #98fb98; font-weight: bold;">:fetch</span> (<span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id <span style="color: #98fb98; font-weight: bold;">:from</span> 'historical-events) 'id) 5 10))

((11) (12) (13) (14) (15))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3f7e84" class="outline-3">
<h3 id="ea31c6a0-e40e-41e0-9d2e-98eb08da67e5"><a id="orge3f7e84"></a><a id="ID-1b0cc29f-7b0a-4bca-8f79-5e763fc9a356"></a>sql-op :limit (query amount &amp;optional offset)</h3>
<div class="outline-text-3" id="text-ea31c6a0-e40e-41e0-9d2e-98eb08da67e5">
<p>
In S-SQL limit is not part of the select operator, but an extra
operator that is applied to a query (this works out better when limiting
the union or intersection of multiple queries, same for sorting).
It limits the number of results to the amount given as the second
argument, and optionally offsets the result by the amount given
as the third argument.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:limit</span> (<span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'surname <span style="color: #98fb98; font-weight: bold;">:distinct</span> <span style="color: #98fb98; font-weight: bold;">:from</span> 'cd.members) 'surname) 10))
</pre>
</div>
</div>
</div>
<div id="outline-container-org173671e" class="outline-3">
<h3 id="3254857d-911f-403d-86c2-0d908f9df089"><a id="org173671e"></a><a id="ID-df5b679e-5f4b-4599-b533-82c3e9d4f13b"></a>sql-op :order-by (query &amp;rest exprs)</h3>
<div class="outline-text-3" id="text-3254857d-911f-403d-86c2-0d908f9df089">
<p>
Order the results of a query by the given expressions. See :desc for
when you want to invert an ordering. Note: This is not the same as
passing an :order-by parameter to an aggregation operator.
For that see Aggregation Operators.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name 'city 'salary (<span style="color: #98fb98; font-weight: bold;">:every</span> (<span style="color: #98fb98; font-weight: bold;">:like</span> 'name <span style="color: #cd8162;">"J%"</span>))
                                          <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee
                                          <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'name 'id 'salary 'city)
                                 'name))
</pre>
</div>
</div>
</div>
