doc/s-sql.org
** sql-op :values
   :PROPERTIES:
   :ID:       d7cc1523-6341-4d80-a08a-c76898a99501
   :CUSTOM_ID: a8c0dd8a-c505-4389-bbcd-48b80346ac9a
   :END:

Values computes a row value or set of row values for use in a specific
query. See the postgresql docs at:
https://www.postgresql.org/docs/current/static/queries-values.html
and https://www.postgresql.org/docs/current/static/sql-values.html
Example:
#+BEGIN_SRC lisp
(query (:select '*
                :from (:as (:values (:set 1 "one")
                                    (:set 2 "two")
                                    (:set 3 "three"))
                           (:t1 'num 'letter))))

(query (:select 'a 'b 'c (:cast (:as (:* 50 (:random)) 'int))
                :from (:as (:values (:set "a") (:set "b")) (:d1 'a))
                (:as (:values (:set "c") (:set "d")) (:d2 'b))
                (:as (:values (:set "e") (:set "f")) (:d3 'c))))

(query
 (:with-recursive
  (:as (:t1 'n)
       (:union-all (:values (:set 1))
                   (:select (:+ 'n 1)
                            :from 't1
                            :where (:< 'n 100))))
  (:select (:sum 'n) :from 't1))
 :single)
#+END_SRC

** sql-op :empty-set
   :PROPERTIES:
   :ID:       a7daaf56-9824-4a6f-8ada-313221e034cb
   :CUSTOM_ID: 5479e5a3-be95-4fe1-a57c-340a2b99c9d9
   :END:

This is a fudge. It returns a string "()" where something like '()
would return "false" or :() would throw an error. Example:
#+BEGIN_SRC lisp
(query (:select 'appnumber 'day (:sum 'inserts)
                (:sum 'updates) (:sum 'deletes) (:sum 'transactions)
                :from 'db-details
                :group-by (:grouping-sets (:set 'appnumber 'day (:empty-set)))))
#+END_SRC

** sql-op :group-by
   :PROPERTIES:
   :ID:       8f5b4a28-a801-424d-9ff6-4460fa7f048d
   :CUSTOM_ID: fa3913b4-e12c-4d0c-bf49-40cf2499f9fc
   :END:

https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-GROUPING-SETS
The GROUP BY Clause is used to group together those rows in a table that
have the same values in all the columns listed. The order in which the
columns are listed does not matter. The effect is to combine each set of
rows having common values into one group row that represents all rows in
the group. This is done to eliminate redundancy in the output and/or compute
aggregates that apply to these groups. Example:
#+BEGIN_SRC lisp
(query (:order-by
        (:select 'mems.surname 'mems.firstname 'mems.memid (:as (:min 'bks.starttime) 'starttime)
                 :from (:as 'cd.bookings 'bks)
                 :inner-join (:as 'cd.members 'mems)
                 :on (:= 'mems.memid 'bks.memid)
                 :where (:>= 'starttime "2012-09-01")
                 :group-by 'mems.surname 'mems.firstname 'mems.memid)
        'mems.memid))
#+END_SRC

** sql-op :grouping-sets
   :PROPERTIES:
   :ID:       dfcde273-6c53-488a-b8d2-43adc3a95d23
   :CUSTOM_ID: 4c93cbde-53ef-4d61-8c4c-acfd2837cec2
   :END:

https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-GROUPING-SETS
More complex grouping operations are possible using the concept of grouping
sets. The data selected by the FROM and WHERE clauses is grouped separately
by each specified grouping set, aggregates computed for each group just as
for simple GROUP BY clauses, and then the results returned.
This operator requires postgresql 9.5 or later. For example:
#+BEGIN_SRC lisp
(query (:select 'city (:as (:extract 'year 'start-date)  'joining-year) (:as (:count 1) 'employee_count)
                :from 'employee
                :group-by (:grouping-sets (:set 'city (:extract 'year 'start-date)))))
#+END_SRC

* Time, Date and Interval Operators
  :PROPERTIES:
  :ID:       d07d0cf2-6766-4b7a-af0b-57a0c2b754eb
  :CUSTOM_ID: 186c6802-90ca-448e-9bc5-019dba16c2b6
  :END:
** sql-op :interval (arg)
   :PROPERTIES:
   :ID:       330de3f2-1869-47a2-8a0d-467a38e3254f
   :CUSTOM_ID: 53cf3df4-8330-48a0-ac38-2956b91c7d38
   :END:
Creates an interval data type, generally represented in postmodern as an alist
** sql-op :current-date ()
   :PROPERTIES:
   :ID:       6d1cf4f1-89f8-4586-9e19-58c6003e5166
   :CUSTOM_ID: d6e950aa-06c6-48ea-82fe-bc97a494aa74
   :END:
#+BEGIN_SRC lisp
(query (:select (:current-date)) :single)
#+END_SRC
** sql-op :current-time ()
   :PROPERTIES:
   :ID:       2f80fe21-7abe-4eed-aa57-1b8a11cddfd1
   :CUSTOM_ID: 87c5bbc8-e73b-4153-aeff-22e934d0f83f
   :END:
** sql-op :current-timestamp ()
   :PROPERTIES:
   :ID:       5c124bd3-f248-45dd-9965-51c368cd3225
   :CUSTOM_ID: 137a71a4-920a-4ba0-a8e8-4d60027c4a8f
   :END:
