doc/s-sql.html
<div id="outline-container-org08059bc" class="outline-3">
<h3 id="a8c0dd8a-c505-4389-bbcd-48b80346ac9a"><a id="org08059bc"></a><a id="ID-d7cc1523-6341-4d80-a08a-c76898a99501"></a>sql-op :values</h3>
<div class="outline-text-3" id="text-a8c0dd8a-c505-4389-bbcd-48b80346ac9a">
<p>
Values computes a row value or set of row values for use in a specific
query. See the postgresql docs at:
<a href="https://www.postgresql.org/docs/current/static/queries-values.html">https://www.postgresql.org/docs/current/static/queries-values.html</a>
and <a href="https://www.postgresql.org/docs/current/static/sql-values.html">https://www.postgresql.org/docs/current/static/sql-values.html</a>
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> '*
                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:values</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> 1 <span style="color: #cd8162;">"one"</span>)
                                    (<span style="color: #98fb98; font-weight: bold;">:set</span> 2 <span style="color: #cd8162;">"two"</span>)
                                    (<span style="color: #98fb98; font-weight: bold;">:set</span> 3 <span style="color: #cd8162;">"three"</span>))
                           (<span style="color: #98fb98; font-weight: bold;">:t1</span> 'num 'letter))))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'a 'b 'c (<span style="color: #98fb98; font-weight: bold;">:cast</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:*</span> 50 (<span style="color: #98fb98; font-weight: bold;">:random</span>)) 'int))
                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:values</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> <span style="color: #cd8162;">"a"</span>) (<span style="color: #98fb98; font-weight: bold;">:set</span> <span style="color: #cd8162;">"b"</span>)) (<span style="color: #98fb98; font-weight: bold;">:d1</span> 'a))
                (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:values</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> <span style="color: #cd8162;">"c"</span>) (<span style="color: #98fb98; font-weight: bold;">:set</span> <span style="color: #cd8162;">"d"</span>)) (<span style="color: #98fb98; font-weight: bold;">:d2</span> 'b))
                (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:values</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> <span style="color: #cd8162;">"e"</span>) (<span style="color: #98fb98; font-weight: bold;">:set</span> <span style="color: #cd8162;">"f"</span>)) (<span style="color: #98fb98; font-weight: bold;">:d3</span> 'c))))

(query
 (<span style="color: #00ffff;">:with-recursive</span>
  (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:t1</span> 'n)
       (<span style="color: #98fb98; font-weight: bold;">:union-all</span> (<span style="color: #98fb98; font-weight: bold;">:values</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> 1))
                   (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:+</span> 'n 1)
                            <span style="color: #98fb98; font-weight: bold;">:from</span> 't1
                            <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:&lt;</span> 'n 100))))
  (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'n) <span style="color: #98fb98; font-weight: bold;">:from</span> 't1))
 <span style="color: #98fb98; font-weight: bold;">:single</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1299383" class="outline-3">
<h3 id="5479e5a3-be95-4fe1-a57c-340a2b99c9d9"><a id="org1299383"></a><a id="ID-a7daaf56-9824-4a6f-8ada-313221e034cb"></a>sql-op :empty-set</h3>
<div class="outline-text-3" id="text-5479e5a3-be95-4fe1-a57c-340a2b99c9d9">
<p>
This is a fudge. It returns a string "()" where something like '()
would return "false" or :() would throw an error. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'appnumber 'day (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'inserts)
                (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'updates) (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'deletes) (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'transactions)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'db-details
                <span style="color: #98fb98; font-weight: bold;">:group-by</span> (<span style="color: #98fb98; font-weight: bold;">:grouping-sets</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> 'appnumber 'day (<span style="color: #98fb98; font-weight: bold;">:empty-set</span>)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd74bf75" class="outline-3">
<h3 id="fa3913b4-e12c-4d0c-bf49-40cf2499f9fc"><a id="orgd74bf75"></a><a id="ID-8f5b4a28-a801-424d-9ff6-4460fa7f048d"></a>sql-op :group-by</h3>
<div class="outline-text-3" id="text-fa3913b4-e12c-4d0c-bf49-40cf2499f9fc">
<p>
<a href="https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-GROUPING-SETS">https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-GROUPING-SETS</a>
The GROUP BY Clause is used to group together those rows in a table that
have the same values in all the columns listed. The order in which the
columns are listed does not matter. The effect is to combine each set of
rows having common values into one group row that represents all rows in
the group. This is done to eliminate redundancy in the output and/or compute
aggregates that apply to these groups. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:order-by</span>
        (<span style="color: #98fb98; font-weight: bold;">:select</span> 'mems.surname 'mems.firstname 'mems.memid (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:min</span> 'bks.starttime) 'starttime)
                 <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'cd.bookings 'bks)
                 <span style="color: #98fb98; font-weight: bold;">:inner-join</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'cd.members 'mems)
                 <span style="color: #98fb98; font-weight: bold;">:on</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'mems.memid 'bks.memid)
                 <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:&gt;=</span> 'starttime <span style="color: #cd8162;">"2012-09-01"</span>)
                 <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'mems.surname 'mems.firstname 'mems.memid)
        'mems.memid))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6897bc3" class="outline-3">
<h3 id="4c93cbde-53ef-4d61-8c4c-acfd2837cec2"><a id="org6897bc3"></a><a id="ID-dfcde273-6c53-488a-b8d2-43adc3a95d23"></a>sql-op :grouping-sets</h3>
<div class="outline-text-3" id="text-4c93cbde-53ef-4d61-8c4c-acfd2837cec2">
<p>
<a href="https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-GROUPING-SETS">https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-GROUPING-SETS</a>
More complex grouping operations are possible using the concept of grouping
sets. The data selected by the FROM and WHERE clauses is grouped separately
by each specified grouping set, aggregates computed for each group just as
for simple GROUP BY clauses, and then the results returned.
This operator requires postgresql 9.5 or later. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'city (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:extract</span> 'year 'start-date)  'joining-year) (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> 1) 'employee_count)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee
                <span style="color: #98fb98; font-weight: bold;">:group-by</span> (<span style="color: #98fb98; font-weight: bold;">:grouping-sets</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> 'city (<span style="color: #98fb98; font-weight: bold;">:extract</span> 'year 'start-date)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd92dda4" class="outline-2">
<h2 id="186c6802-90ca-448e-9bc5-019dba16c2b6"><a id="orgd92dda4"></a><a id="ID-d07d0cf2-6766-4b7a-af0b-57a0c2b754eb"></a>Time, Date and Interval Operators</h2>
<div class="outline-text-2" id="text-186c6802-90ca-448e-9bc5-019dba16c2b6">
</div>
<div id="outline-container-org80e92e3" class="outline-3">
<h3 id="53cf3df4-8330-48a0-ac38-2956b91c7d38"><a id="org80e92e3"></a><a id="ID-330de3f2-1869-47a2-8a0d-467a38e3254f"></a>sql-op :interval (arg)</h3>
<div class="outline-text-3" id="text-53cf3df4-8330-48a0-ac38-2956b91c7d38">
<p>
Creates an interval data type, generally represented in postmodern as an alist
</p>
</div>
</div>
<div id="outline-container-org09ba746" class="outline-3">
<h3 id="d6e950aa-06c6-48ea-82fe-bc97a494aa74"><a id="org09ba746"></a><a id="ID-6d1cf4f1-89f8-4586-9e19-58c6003e5166"></a>sql-op :current-date ()</h3>
<div class="outline-text-3" id="text-d6e950aa-06c6-48ea-82fe-bc97a494aa74">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:current-date</span>)) <span style="color: #98fb98; font-weight: bold;">:single</span>)
</pre>
</div>
</div>
</div>
