doc/s-sql.org
** sql-op :timestamp (arg)
   :PROPERTIES:
   :ID:       1969c373-6093-46dc-9f41-001190399cbd
   :CUSTOM_ID: 71e1c8be-cc8b-4f63-b3ea-db3b07a5889b
   :END:
** sql-op :age (&rest args)
   :PROPERTIES:
   :ID:       e4872980-3b59-4cd5-844b-ce8912160010
   :CUSTOM_ID: 749635eb-c348-4caf-bb1a-d5539c05855f
   :END:
** sql-op :date (arg)
   :PROPERTIES:
   :ID:       e155b65b-05d2-4583-a185-419817382e37
   :CUSTOM_ID: 3bd223c7-e831-4aed-8548-1a9fed07c5f1
   :END:
** sql-op :make-interval (&rest args)
   :PROPERTIES:
   :ID:       2794d9dd-9ab6-4d4b-8b9f-49056d214b67
   :CUSTOM_ID: d56adeb5-4970-4dce-9134-fa57e4970f8c
   :END:
Takes lists of (time-unit value) and returns a timestamp type. Example:

#+BEGIN_SRC lisp
(query (:select (:make-interval ("days" 4) ("hours" 10) ("secs" 1.2)))
       :single)
#+END_SRC
** sql-op :make-timestamp (&rest args)
   :PROPERTIES:
   :ID:       f4e7bf1a-25b1-4c2b-8794-9550164a0ee1
   :CUSTOM_ID: 84d2e537-b154-4b0f-b9cc-e5125a3e0dea
   :END:
Takes lists of (time-unit value) and returns a timestamptz type. Example:
#+BEGIN_SRC lisp
(query (:select
          (:make-timestamptz ("year" 2014) ("month" 1) ("mday" 13)
                             ("hour" 21) ("min" 50) ("sec" 0)))
       :single)
#+END_SRC
** sql-op :make-timestamptz (&rest args)
   :PROPERTIES:
   :ID:       b6f82034-e002-4dd2-9bde-ae025176cb9a
   :CUSTOM_ID: eeaacf24-8c35-4487-819c-8e90c191a58a
   :END:
Takes lists of (time-unit value) and returns a timestamptz type. Example:
#+BEGIN_SRC lisp
(query (:select
          (:make-timestamptz ("year" 2014) ("month" 1) ("mday" 13)
                             ("hour" 21) ("min" 50) ("sec" 0) ("timezone" "Asia/Tokyo")))
       :single)
#+END_SRC

* Aggregation Operators
  :PROPERTIES:
  :ID:       cd2bdccf-0de5-4b57-a195-0c94029e8c8e
  :CUSTOM_ID: 049f6d6c-0b9e-4734-9322-7f1e6b1ab867
  :END:
** sql-op :count (&rest args)
   :PROPERTIES:
   :ID:       40eed2a4-b3f5-4380-a3b7-16a5bdcbe0b3
   :CUSTOM_ID: 5c3961bb-cee1-41b2-b146-3bda791733ee
   :END:

Count returns the number of rows for which the expression is not null.
It can be the number of rows collected by the select statement as in:
#+BEGIN_SRC lisp
(query (:select (:count '*)
                :from 'table1
                :where (:= 'price 100)))
#+END_SRC

or it can be a smaller number of rows based on the allowed keyword
parameters :distinct and :filter or some other type of condition as in:
#+BEGIN_SRC lisp
(query (:select (:count 'memid :distinct)
                :from 'cd.bookings))
#+END_SRC
or

#+BEGIN_SRC lisp
(query (:select (:as (:count '* :distinct) 'unfiltered)
                (:as (:count '* :filter (:= 1 'bid))
                     'filtered)
                :from 'testtable))
#+END_SRC

Note that if used, the filter must be last in the count args. If distinct
is used, it must come before filter. Unlike standard sql, the word 'where'
is not used inside the filter clause. E.g.
#+BEGIN_SRC lisp
(query (:select (:count '*)
                (:count '* :filter (:= 1 'bid))
                'id
                :from 'pbbench-history))
#+END_SRC

See tests.lisp for examples.

** sql-op :avg (&rest rest args)
   :PROPERTIES:
   :ID:       0e6463d4-d83c-493b-8989-4819c6e9f914
   :CUSTOM_ID: 48665fbf-e60e-4cdf-8e9d-028d7afc13eb
   :END:

Avg calculates the average value of a list of values. Note that if the
filter keyword is used, the filter must be last in the avg args. If distinct
is used, it must come before filter. E.g. See tests.lisp for more examples.
#+BEGIN_SRC lisp
(query (:select (:avg '*) (:avg '* :filter (:= 1 'bid)) 'id
                :from 'pbbench-history))
#+END_SRC

** sql-op :sum (&rest rest args)
   :PROPERTIES:
   :ID:       d8379b94-922b-47d3-9161-5da838b43f42
   :CUSTOM_ID: 46dfd0b3-e871-4981-963b-739aea4ee9b1
   :END:

Sum calculates the total of a list of values. Note that if the keyword filter
is used, the filter must be last in the sum args. If distinct is used, it
must come before filter. Unlike standard sql, the word 'where' is not used
inside the filter clause (s-sql will properly expand it). See tests.lisp
for more examples.
#+BEGIN_SRC lisp
(query (:select (:sum '*) (:sum '* :filter (:= 1 'bid)) 'id
                :from 'pbbench-history))
#+END_SRC

** sql-op ::max (&rest args)
   :PROPERTIES:
   :ID:       66db79ad-e7d4-43dd-a6af-fe3085c16d12
   :CUSTOM_ID: 1ac43f47-1a8f-47e9-a00f-06e93091ec73
   :END:

max returns the maximum value of a set of values. Note that if the filter
keyword is used, the filter must be last in the max args. If distinct is
used, it must come before filter. Unlike standard sql, the word 'where'
is not used inside the filter clause (s-sql will properly expand it).
See tests.lisp for more examples.

#+BEGIN_SRC lisp
(query (:select (:max '*) (:max '* :filter (:= 1 'bid)) 'id
                :from 'pbbench-history))
#+END_SRC
