doc/s-sql.html
<div id="outline-container-orgca3288b" class="outline-3">
<h3 id="87c5bbc8-e73b-4153-aeff-22e934d0f83f"><a id="orgca3288b"></a><a id="ID-2f80fe21-7abe-4eed-aa57-1b8a11cddfd1"></a>sql-op :current-time ()</h3>
<div class="outline-text-3" id="text-87c5bbc8-e73b-4153-aeff-22e934d0f83f">
</div>
</div>
<div id="outline-container-org6e69a2c" class="outline-3">
<h3 id="137a71a4-920a-4ba0-a8e8-4d60027c4a8f"><a id="org6e69a2c"></a><a id="ID-5c124bd3-f248-45dd-9965-51c368cd3225"></a>sql-op :current-timestamp ()</h3>
<div class="outline-text-3" id="text-137a71a4-920a-4ba0-a8e8-4d60027c4a8f">
</div>
</div>
<div id="outline-container-org2b40619" class="outline-3">
<h3 id="71e1c8be-cc8b-4f63-b3ea-db3b07a5889b"><a id="org2b40619"></a><a id="ID-1969c373-6093-46dc-9f41-001190399cbd"></a>sql-op :timestamp (arg)</h3>
<div class="outline-text-3" id="text-71e1c8be-cc8b-4f63-b3ea-db3b07a5889b">
</div>
</div>
<div id="outline-container-org7ea219a" class="outline-3">
<h3 id="749635eb-c348-4caf-bb1a-d5539c05855f"><a id="org7ea219a"></a><a id="ID-e4872980-3b59-4cd5-844b-ce8912160010"></a>sql-op :age (&amp;rest args)</h3>
<div class="outline-text-3" id="text-749635eb-c348-4caf-bb1a-d5539c05855f">
</div>
</div>
<div id="outline-container-orgcfc0e55" class="outline-3">
<h3 id="3bd223c7-e831-4aed-8548-1a9fed07c5f1"><a id="orgcfc0e55"></a><a id="ID-e155b65b-05d2-4583-a185-419817382e37"></a>sql-op :date (arg)</h3>
<div class="outline-text-3" id="text-3bd223c7-e831-4aed-8548-1a9fed07c5f1">
</div>
</div>
<div id="outline-container-org6efb683" class="outline-3">
<h3 id="d56adeb5-4970-4dce-9134-fa57e4970f8c"><a id="org6efb683"></a><a id="ID-2794d9dd-9ab6-4d4b-8b9f-49056d214b67"></a>sql-op :make-interval (&amp;rest args)</h3>
<div class="outline-text-3" id="text-d56adeb5-4970-4dce-9134-fa57e4970f8c">
<p>
Takes lists of (time-unit value) and returns a timestamp type. Example:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:make-interval</span> (<span style="color: #cd8162;">"days"</span> 4) (<span style="color: #cd8162;">"hours"</span> 10) (<span style="color: #cd8162;">"secs"</span> 1.2)))
       <span style="color: #98fb98; font-weight: bold;">:single</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc2f5e8e" class="outline-3">
<h3 id="84d2e537-b154-4b0f-b9cc-e5125a3e0dea"><a id="orgc2f5e8e"></a><a id="ID-f4e7bf1a-25b1-4c2b-8794-9550164a0ee1"></a>sql-op :make-timestamp (&amp;rest args)</h3>
<div class="outline-text-3" id="text-84d2e537-b154-4b0f-b9cc-e5125a3e0dea">
<p>
Takes lists of (time-unit value) and returns a timestamptz type. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span>
          (<span style="color: #98fb98; font-weight: bold;">:make-timestamptz</span> (<span style="color: #cd8162;">"year"</span> 2014) (<span style="color: #cd8162;">"month"</span> 1) (<span style="color: #cd8162;">"mday"</span> 13)
                             (<span style="color: #cd8162;">"hour"</span> 21) (<span style="color: #cd8162;">"min"</span> 50) (<span style="color: #cd8162;">"sec"</span> 0)))
       <span style="color: #98fb98; font-weight: bold;">:single</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c79b9d" class="outline-3">
<h3 id="eeaacf24-8c35-4487-819c-8e90c191a58a"><a id="org4c79b9d"></a><a id="ID-b6f82034-e002-4dd2-9bde-ae025176cb9a"></a>sql-op :make-timestamptz (&amp;rest args)</h3>
<div class="outline-text-3" id="text-eeaacf24-8c35-4487-819c-8e90c191a58a">
<p>
Takes lists of (time-unit value) and returns a timestamptz type. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span>
          (<span style="color: #98fb98; font-weight: bold;">:make-timestamptz</span> (<span style="color: #cd8162;">"year"</span> 2014) (<span style="color: #cd8162;">"month"</span> 1) (<span style="color: #cd8162;">"mday"</span> 13)
                             (<span style="color: #cd8162;">"hour"</span> 21) (<span style="color: #cd8162;">"min"</span> 50) (<span style="color: #cd8162;">"sec"</span> 0) (<span style="color: #cd8162;">"timezone"</span> <span style="color: #cd8162;">"Asia/Tokyo"</span>)))
       <span style="color: #98fb98; font-weight: bold;">:single</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org83b7b9d" class="outline-2">
<h2 id="049f6d6c-0b9e-4734-9322-7f1e6b1ab867"><a id="org83b7b9d"></a><a id="ID-cd2bdccf-0de5-4b57-a195-0c94029e8c8e"></a>Aggregation Operators</h2>
<div class="outline-text-2" id="text-049f6d6c-0b9e-4734-9322-7f1e6b1ab867">
</div>
<div id="outline-container-org980a916" class="outline-3">
<h3 id="5c3961bb-cee1-41b2-b146-3bda791733ee"><a id="org980a916"></a><a id="ID-40eed2a4-b3f5-4380-a3b7-16a5bdcbe0b3"></a>sql-op :count (&amp;rest args)</h3>
<div class="outline-text-3" id="text-5c3961bb-cee1-41b2-b146-3bda791733ee">
<p>
Count returns the number of rows for which the expression is not null.
It can be the number of rows collected by the select statement as in:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> '*)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'table1
                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'price 100)))
</pre>
</div>

<p>
or it can be a smaller number of rows based on the allowed keyword
parameters :distinct and :filter or some other type of condition as in:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> 'memid <span style="color: #98fb98; font-weight: bold;">:distinct</span>)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'cd.bookings))
</pre>
</div>
<p>
or
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> '* <span style="color: #98fb98; font-weight: bold;">:distinct</span>) 'unfiltered)
                (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> '* <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 1 'bid))
                     'filtered)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'testtable))
</pre>
</div>

<p>
Note that if used, the filter must be last in the count args. If distinct
is used, it must come before filter. Unlike standard sql, the word 'where'
is not used inside the filter clause. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:count</span> '*)
                (<span style="color: #98fb98; font-weight: bold;">:count</span> '* <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 1 'bid))
                'id
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'pbbench-history))
</pre>
</div>

<p>
See tests.lisp for examples.
</p>
</div>
</div>

<div id="outline-container-org848f0dd" class="outline-3">
<h3 id="48665fbf-e60e-4cdf-8e9d-028d7afc13eb"><a id="org848f0dd"></a><a id="ID-0e6463d4-d83c-493b-8989-4819c6e9f914"></a>sql-op :avg (&amp;rest rest args)</h3>
<div class="outline-text-3" id="text-48665fbf-e60e-4cdf-8e9d-028d7afc13eb">
<p>
Avg calculates the average value of a list of values. Note that if the
filter keyword is used, the filter must be last in the avg args. If distinct
is used, it must come before filter. E.g. See tests.lisp for more examples.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:avg</span> '*) (<span style="color: #98fb98; font-weight: bold;">:avg</span> '* <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 1 'bid)) 'id
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'pbbench-history))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe2eb90" class="outline-3">
<h3 id="46dfd0b3-e871-4981-963b-739aea4ee9b1"><a id="orgbe2eb90"></a><a id="ID-d8379b94-922b-47d3-9161-5da838b43f42"></a>sql-op :sum (&amp;rest rest args)</h3>
<div class="outline-text-3" id="text-46dfd0b3-e871-4981-963b-739aea4ee9b1">
<p>
Sum calculates the total of a list of values. Note that if the keyword filter
is used, the filter must be last in the sum args. If distinct is used, it
must come before filter. Unlike standard sql, the word 'where' is not used
inside the filter clause (s-sql will properly expand it). See tests.lisp
for more examples.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> '*) (<span style="color: #98fb98; font-weight: bold;">:sum</span> '* <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 1 'bid)) 'id
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'pbbench-history))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb24daa" class="outline-3">
<h3 id="1ac43f47-1a8f-47e9-a00f-06e93091ec73"><a id="orgfb24daa"></a><a id="ID-66db79ad-e7d4-43dd-a6af-fe3085c16d12"></a>sql-op ::max (&amp;rest args)</h3>
<div class="outline-text-3" id="text-1ac43f47-1a8f-47e9-a00f-06e93091ec73">
<p>
max returns the maximum value of a set of values. Note that if the filter
keyword is used, the filter must be last in the max args. If distinct is
used, it must come before filter. Unlike standard sql, the word 'where'
is not used inside the filter clause (s-sql will properly expand it).
See tests.lisp for more examples.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:max</span> '*) (<span style="color: #98fb98; font-weight: bold;">:max</span> '* <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 1 'bid)) 'id
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'pbbench-history))
</pre>
</div>
</div>
</div>
