doc/s-sql.org
** sql-op ::min (&rest args)
   :PROPERTIES:
   :ID:       02c03a2a-114d-4b4b-8214-12411c979a0f
   :CUSTOM_ID: 8e60fdc7-5a1c-470e-a261-1a20eb951041
   :END:

min returns the minimum value of a set of values. Note that if the filter
keyword is used, the filter must be last in the min args. If distinct is
used, it must come before filter. Unlike standard sql, the word 'where'
is not used inside the filter clause (s-sql will properly expand it).
See tests.lisp for more examples.
#+BEGIN_SRC lisp
(query (:select (:min '*) (:min '* :filter (:= 1 'bid)) 'id
                :from 'pbbench-history))
#+END_SRC

** sql-op ::every (&rest args)
   :PROPERTIES:
   :ID:       3683daea-ef97-4cb9-a78e-aa40fc3df983
   :CUSTOM_ID: ab71a751-14bd-4741-b617-7c70fa92f646
   :END:

Every returns true if all input values are true, otherwise false. Note
that if the filter keyword is used, the filter must be last in the every
args. If distinct is used, it must come before filter. Unlike standard sql,
the word 'where' is not used inside the filter clause (s-sql will
properly expand it). See tests.lisp for more examples.
#+BEGIN_SRC lisp
(query (:select '* (:every (:like 'studname "%h"))
                :from 'tbl-students
                :group-by 'studname 'studid 'studgrades))
#+END_SRC

** sql-op :percentile-cont (&rest args)
   :PROPERTIES:
   :ID:       3a6ee0b8-64cd-4937-b769-95f3ec44c32a
   :CUSTOM_ID: d48c7eda-562a-432e-99ae-d30be866f264
   :END:

Requires Postgresql 9.4 or higher. Percentile-cont returns a value
corresponding to the specified fraction in the ordering, interpolating
between adjacent input items if needed. There are two required keyword
parameters :fraction and :order-by. If the fraction value is an array,
then it returns an array of results matching the shape of the fractions
parameter, with each non-null element replaced by the value corresponding
to that percentile. Examples:
#+BEGIN_SRC lisp
(query (:select (:percentile-cont :fraction 0.5 :order-by 'number-of-staff)
                :from 'schools))

(query (:select (:percentile-cont :fraction array[0.25 0.5 0.75 1]
                                  :order-by 'number-of-staff)
                :from  'schools))
#+END_SRC


** sql-op :percentile-dist (&rest args)
   :PROPERTIES:
   :ID:       5f53ac18-189b-4df7-99ac-02ebbd8a9606
   :CUSTOM_ID: 2370935a-ca34-4678-94ac-4ab00ee3217a
   :END:

Requires Postgresql 9.4 or higher. There are two required keyword parameters
:fraction and :order-by. Percentile-dist returns the first input value whose
position in the ordering equals or exceeds the specified fraction. If the
fraction parameter is an array eturns an array of results matching the shape
of the fractions parameter, with each non-null element replaced by the input
value corresponding to that percentile. Examples:

#+BEGIN_SRC lisp
(query (:select (:percentile-dist :fraction 0.5
                                  :order-by 'number-of-staff)
                :from 'schools))

(query (:select (:percentile-dist :fraction array[0.25 0.5 0.75 1]
                                  :order-by 'number-of-staff)
                :from  'schools))

#+END_SRC

** sql-op :corr (y x)
   :PROPERTIES:
   :ID:       36db9511-5ba0-4dfc-9646-71b2d47857b0
   :CUSTOM_ID: 3562be1d-bb9a-4f2c-91b9-0f702b28ad87
   :END:

The corr function returns the correlation coefficient between a set of
dependent and independent variables. Example:
#+BEGIN_SRC lisp
(query (:select (:corr 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :covar-pop (y x)
   :PROPERTIES:
   :ID:       e6b20c69-d328-4a59-b030-9c03c9201305
   :CUSTOM_ID: 953ac246-3f0a-4205-9022-4c8b7959a0bf
   :END:

The covar-pop function returns the population covariance between a set of
dependent and independent variables. Example:
#+BEGIN_SRC lisp
(query (:select (:covar-pop 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :covar-samp (y x)
   :PROPERTIES:
   :ID:       9112880c-0d43-43bb-96b0-416e4f1e2bc3
   :CUSTOM_ID: 70244980-e6f3-4a69-bcd2-611a0e9f6f30
   :END:
#+BEGIN_SRC lisp
(query (:select (:covar-samp 'height 'weight)
                :from 'people))
#+END_SRC
The covar-samp function returns the sample covariance between a set of
dependent and independent variables. Example:

** sql-op :string-agg (&rest args)
   :PROPERTIES:
   :ID:       cd16b4cb-51f9-4bff-ac6e-7482fc2e1ffa
   :CUSTOM_ID: cd215fe6-223f-4bfb-828d-5e0f4fd7e464
   :END:

String-agg allows you to concatenate strings using different types of
delimiter symbols. Allowable optional keyword parameters are :distinct,
:order-by and :filter Note that order-by in string-agg requires
postgresql 9.0 or later. Filter requires postgresql 9.4 or later.
See tests.lisp for more examples.
#+BEGIN_SRC lisp
(query (:select (:as (:string-agg 'bp.step-type \",\" )
                     'step-summary)
                :from 'business-process))

(query (:select 'mid (:as (:string-agg  'y \",\" :distinct :order-by (:desc 'y))
                          'words)
                :from 'moves))

(query (:select (:string-agg  'name "," :order-by (:desc 'name) :filter (:< 'id 4))
                :from 'employee))
#+END_SRC

