doc/s-sql.html
<div id="outline-container-org87004bf" class="outline-3">
<h3 id="8e60fdc7-5a1c-470e-a261-1a20eb951041"><a id="org87004bf"></a><a id="ID-02c03a2a-114d-4b4b-8214-12411c979a0f"></a>sql-op ::min (&amp;rest args)</h3>
<div class="outline-text-3" id="text-8e60fdc7-5a1c-470e-a261-1a20eb951041">
<p>
min returns the minimum value of a set of values. Note that if the filter
keyword is used, the filter must be last in the min args. If distinct is
used, it must come before filter. Unlike standard sql, the word 'where'
is not used inside the filter clause (s-sql will properly expand it).
See tests.lisp for more examples.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:min</span> '*) (<span style="color: #98fb98; font-weight: bold;">:min</span> '* <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 1 'bid)) 'id
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'pbbench-history))
</pre>
</div>
</div>
</div>

<div id="outline-container-org493f545" class="outline-3">
<h3 id="ab71a751-14bd-4741-b617-7c70fa92f646"><a id="org493f545"></a><a id="ID-3683daea-ef97-4cb9-a78e-aa40fc3df983"></a>sql-op ::every (&amp;rest args)</h3>
<div class="outline-text-3" id="text-ab71a751-14bd-4741-b617-7c70fa92f646">
<p>
Every returns true if all input values are true, otherwise false. Note
that if the filter keyword is used, the filter must be last in the every
args. If distinct is used, it must come before filter. Unlike standard sql,
the word 'where' is not used inside the filter clause (s-sql will
properly expand it). See tests.lisp for more examples.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> '* (<span style="color: #98fb98; font-weight: bold;">:every</span> (<span style="color: #98fb98; font-weight: bold;">:like</span> 'studname <span style="color: #cd8162;">"%h"</span>))
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'tbl-students
                <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'studname 'studid 'studgrades))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfecbadd" class="outline-3">
<h3 id="d48c7eda-562a-432e-99ae-d30be866f264"><a id="orgfecbadd"></a><a id="ID-3a6ee0b8-64cd-4937-b769-95f3ec44c32a"></a>sql-op :percentile-cont (&amp;rest args)</h3>
<div class="outline-text-3" id="text-d48c7eda-562a-432e-99ae-d30be866f264">
<p>
Requires Postgresql 9.4 or higher. Percentile-cont returns a value
corresponding to the specified fraction in the ordering, interpolating
between adjacent input items if needed. There are two required keyword
parameters :fraction and :order-by. If the fraction value is an array,
then it returns an array of results matching the shape of the fractions
parameter, with each non-null element replaced by the value corresponding
to that percentile. Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:percentile-cont</span> <span style="color: #98fb98; font-weight: bold;">:fraction</span> 0.5 <span style="color: #98fb98; font-weight: bold;">:order-by</span> 'number-of-staff)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'schools))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:percentile-cont</span> <span style="color: #98fb98; font-weight: bold;">:fraction</span> array[0.25 0.5 0.75 1]
                                  <span style="color: #98fb98; font-weight: bold;">:order-by</span> 'number-of-staff)
                <span style="color: #98fb98; font-weight: bold;">:from</span>  'schools))
</pre>
</div>
</div>
</div>


<div id="outline-container-org2a8e09c" class="outline-3">
<h3 id="2370935a-ca34-4678-94ac-4ab00ee3217a"><a id="org2a8e09c"></a><a id="ID-5f53ac18-189b-4df7-99ac-02ebbd8a9606"></a>sql-op :percentile-dist (&amp;rest args)</h3>
<div class="outline-text-3" id="text-2370935a-ca34-4678-94ac-4ab00ee3217a">
<p>
Requires Postgresql 9.4 or higher. There are two required keyword parameters
:fraction and :order-by. Percentile-dist returns the first input value whose
position in the ordering equals or exceeds the specified fraction. If the
fraction parameter is an array eturns an array of results matching the shape
of the fractions parameter, with each non-null element replaced by the input
value corresponding to that percentile. Examples:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:percentile-dist</span> <span style="color: #98fb98; font-weight: bold;">:fraction</span> 0.5
                                  <span style="color: #98fb98; font-weight: bold;">:order-by</span> 'number-of-staff)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'schools))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:percentile-dist</span> <span style="color: #98fb98; font-weight: bold;">:fraction</span> array[0.25 0.5 0.75 1]
                                  <span style="color: #98fb98; font-weight: bold;">:order-by</span> 'number-of-staff)
                <span style="color: #98fb98; font-weight: bold;">:from</span>  'schools))

</pre>
</div>
</div>
</div>

<div id="outline-container-org51b9771" class="outline-3">
<h3 id="3562be1d-bb9a-4f2c-91b9-0f702b28ad87"><a id="org51b9771"></a><a id="ID-36db9511-5ba0-4dfc-9646-71b2d47857b0"></a>sql-op :corr (y x)</h3>
<div class="outline-text-3" id="text-3562be1d-bb9a-4f2c-91b9-0f702b28ad87">
<p>
The corr function returns the correlation coefficient between a set of
dependent and independent variables. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:corr</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org801c35b" class="outline-3">
<h3 id="953ac246-3f0a-4205-9022-4c8b7959a0bf"><a id="org801c35b"></a><a id="ID-e6b20c69-d328-4a59-b030-9c03c9201305"></a>sql-op :covar-pop (y x)</h3>
<div class="outline-text-3" id="text-953ac246-3f0a-4205-9022-4c8b7959a0bf">
<p>
The covar-pop function returns the population covariance between a set of
dependent and independent variables. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:covar-pop</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cff34c" class="outline-3">
<h3 id="70244980-e6f3-4a69-bcd2-611a0e9f6f30"><a id="org5cff34c"></a><a id="ID-9112880c-0d43-43bb-96b0-416e4f1e2bc3"></a>sql-op :covar-samp (y x)</h3>
<div class="outline-text-3" id="text-70244980-e6f3-4a69-bcd2-611a0e9f6f30">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:covar-samp</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
<p>
The covar-samp function returns the sample covariance between a set of
dependent and independent variables. Example:
</p>
</div>
</div>

<div id="outline-container-org731e6c6" class="outline-3">
<h3 id="cd215fe6-223f-4bfb-828d-5e0f4fd7e464"><a id="org731e6c6"></a><a id="ID-cd16b4cb-51f9-4bff-ac6e-7482fc2e1ffa"></a>sql-op :string-agg (&amp;rest args)</h3>
<div class="outline-text-3" id="text-cd215fe6-223f-4bfb-828d-5e0f4fd7e464">
<p>
String-agg allows you to concatenate strings using different types of
delimiter symbols. Allowable optional keyword parameters are :distinct,
:order-by and :filter Note that order-by in string-agg requires
postgresql 9.0 or later. Filter requires postgresql 9.4 or later.
See tests.lisp for more examples.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:string-agg</span> 'bp.step-type \",\" )
                     'step-summary)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'business-process))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'mid (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:string-agg</span>  'y \",\" <span style="color: #98fb98; font-weight: bold;">:distinct</span> <span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:desc</span> 'y))
                          'words)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'moves))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:string-agg</span>  'name <span style="color: #cd8162;">","</span> <span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:desc</span> 'name) <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:&lt;</span> 'id 4))
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee))
</pre>
</div>
</div>
</div>
