doc/s-sql.org
** sql-op :array-agg (&rest args)
   :PROPERTIES:
   :ID:       dbf248ce-f480-4940-93d6-837aaa22529d
   :CUSTOM_ID: 97e03db4-7789-4bf7-9b0b-d115046ff4f7
   :END:

Array-agg returns a list of values concatenated into an arrays.
Allowable optional keyword parameters are :distinct, :order-by
and :filter.

Note that order-by in array-agg requires postgresql 9.0 or later.
Filter requires postgresql 9.4 or later. See [[file:array-notes.html][array-notes.html]] for more
detailed notes on the use of arrays.

Example with Filter:
#+BEGIN_SRC lisp
(query (:select 'g.id
                (:as (:array-agg 'g.users :filter (:= 'g.canonical \"Y\"))
                     'canonical-users)
                (:as (:array-agg 'g.users :filter (:= 'g.canonical \"N\"))
                     'non-canonical-users)
                :from (:as 'groups 'g)
                :group-by 'g.id))
#+END_SRC

** sql-op :mode (&rest args)
   :PROPERTIES:
   :ID:       be548451-659d-46ca-b31b-9d308b8b5cba
   :CUSTOM_ID: d01db5a4-eb43-4025-ae79-99191226462e
   :END:

Mode is used to find the most frequent input value in a group.
See e.g. https://www.postgresql.org/docs/10/static/functions-aggregate.html#FUNCTIONS-ORDEREDSET-TABLE
and article at https://tapoueh.org/blog/2017/11/the-mode-ordered-set-aggregate-function
#+BEGIN_SRC lisp
(query (:select (:mode 'items)
                :from 'item-table))
#+END_SRC

** sql-op :regr_avgx (y x)
   :PROPERTIES:
   :ID:       5c3e2dc0-d238-4116-91fd-a8111225ee94
   :CUSTOM_ID: e13eb576-0122-4f37-a562-e17e2ab0139c
   :END:

The regr_avgx function returns the average of the independent variable
(sum(X)/N) Example:
#+BEGIN_SRC lisp
(query (:select (:regr_avgx 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :regr_avgy (y x)
   :PROPERTIES:
   :ID:       2fc66640-03e7-4796-8209-69fba9f346a4
   :CUSTOM_ID: 5aa7f48a-7a16-49d8-8430-1e4937d6c28c
   :END:

The regr_avgy function returns the average of the dependent variable
(sum(Y)/N). Example:
#+BEGIN_SRC lisp

#+END_SRC
(query (:select (:regr_avgy 'height 'weight)
                :from 'people))
** sql-op :regr_count (y x)
   :PROPERTIES:
   :ID:       293a2e93-93bf-4c08-b0f4-6d3dfe0feb6b
   :CUSTOM_ID: db67bccf-132b-43ce-bf1c-e0067d7bf40f
   :END:

The regr_count function returns the number of input rows in which both
expressions are nonnull. Example:
#+BEGIN_SRC lisp
(query (:select (:regr_count 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :regr_intercept (y x)
   :PROPERTIES:
   :ID:       8b92dc89-b251-4bac-ba53-58251e98d3f5
   :CUSTOM_ID: ef9bd421-d14d-4b1f-9ed8-d17e39da6633
   :END:

The regr_intercept function returns the y-intercept of the least-squares-fit
linear equation determined by the (X, Y) pairs. Example:
#+BEGIN_SRC lisp
(query (:select (:regr_intercept 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :regr_r2 (y x)
   :PROPERTIES:
   :ID:       09020f6e-166a-40e8-85ea-fdaced1f7808
   :CUSTOM_ID: db9ef2ff-7928-4471-890f-3ef70833409a
   :END:

The regr_r2 function returns the square of the correlation coefficient. Example:
#+BEGIN_SRC lisp
(query (:select (:regr_r2 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :regr_slope (y x)
   :PROPERTIES:
   :ID:       b22a7906-c571-4463-884f-4067d51cf0ac
   :CUSTOM_ID: 88eeb544-9950-402d-95be-5c37875ae64d
   :END:

The regr_slope function returns the slope of the least-squares-fit linear
equation determined by the (X, Y) pairs. Example:
#+BEGIN_SRC lisp
(query (:select (:regr_slope 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :regr_sxx (y x)
   :PROPERTIES:
   :ID:       9c7cc59e-419d-4161-9711-de2c9b0c27ec
   :CUSTOM_ID: 8f506e5f-1256-462a-a814-55f690573b41
   :END:

The regr_sxx function returns the sum(X^2) - sum(X)^2/N (“sum of squares” of
the independent variable). Example:
#+BEGIN_SRC lisp
(query (:select (:regr_sxx 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :regr_sxy (y x)
   :PROPERTIES:
   :ID:       24f03953-7fea-4b18-8d69-ccd5b6d9f1f5
   :CUSTOM_ID: 410432a6-33a2-4757-9392-f3caacf8fb79
   :END:

The regr_sxy function returns the sum(X*Y) - sum(X) * sum(Y)/N (“sum of products”
of independent times dependent variable). Example:
#+BEGIN_SRC lisp
(query (:select (:regr_sxy 'height 'weight)
                :from 'people))
#+END_SRC

** sql-op :regr_syy (y x)
   :PROPERTIES:
   :ID:       34f776b1-d29d-4d49-a66b-21262379510b
   :CUSTOM_ID: 8c2a625b-8b29-40d7-a96f-d32d9c6a7c3f
   :END:

The regr_syy function returns the sum(Y^2) - sum(Y)^2/N (“sum of squares”
of the dependent variable). Example:
#+BEGIN_SRC lisp
(query (:select (:regr_syy 'salary 'age)
                :from 'employee))
#+END_SRC

** sql-op :stddev (&rest args)
   :PROPERTIES:
   :ID:       e0558145-d8e0-4ea3-b9ae-cc92ef332b70
   :CUSTOM_ID: 14985ca9-ddfd-45b5-81a4-6c372367a7f2
   :END:

The stddev function returns the the sample standard deviation of the input
values. It is a historical alias for stddev-samp. Example:
#+BEGIN_SRC lisp
(query (:select (:stddev 'salary)
                :from 'employee))
#+END_SRC

