doc/s-sql.html

<div id="outline-container-orgf7796e5" class="outline-3">
<h3 id="97e03db4-7789-4bf7-9b0b-d115046ff4f7"><a id="orgf7796e5"></a><a id="ID-dbf248ce-f480-4940-93d6-837aaa22529d"></a>sql-op :array-agg (&amp;rest args)</h3>
<div class="outline-text-3" id="text-97e03db4-7789-4bf7-9b0b-d115046ff4f7">
<p>
Array-agg returns a list of values concatenated into an arrays.
Allowable optional keyword parameters are :distinct, :order-by
and :filter.
</p>

<p>
Note that order-by in array-agg requires postgresql 9.0 or later.
Filter requires postgresql 9.4 or later. See <a href="array-notes.html">array-notes.html</a> for more
detailed notes on the use of arrays.
</p>

<p>
Example with Filter:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'g.id
                (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:array-agg</span> 'g.users <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'g.canonical \"Y\"))
                     'canonical-users)
                (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:array-agg</span> 'g.users <span style="color: #98fb98; font-weight: bold;">:filter</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'g.canonical \"N\"))
                     'non-canonical-users)
                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'groups 'g)
                <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'g.id))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga90dfde" class="outline-3">
<h3 id="d01db5a4-eb43-4025-ae79-99191226462e"><a id="orga90dfde"></a><a id="ID-be548451-659d-46ca-b31b-9d308b8b5cba"></a>sql-op :mode (&amp;rest args)</h3>
<div class="outline-text-3" id="text-d01db5a4-eb43-4025-ae79-99191226462e">
<p>
Mode is used to find the most frequent input value in a group.
See e.g. <a href="https://www.postgresql.org/docs/10/static/functions-aggregate.html#FUNCTIONS-ORDEREDSET-TABLE">https://www.postgresql.org/docs/10/static/functions-aggregate.html#FUNCTIONS-ORDEREDSET-TABLE</a>
and article at <a href="https://tapoueh.org/blog/2017/11/the-mode-ordered-set-aggregate-function">https://tapoueh.org/blog/2017/11/the-mode-ordered-set-aggregate-function</a>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:mode</span> 'items)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'item-table))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4305259" class="outline-3">
<h3 id="e13eb576-0122-4f37-a562-e17e2ab0139c"><a id="org4305259"></a><a id="ID-5c3e2dc0-d238-4116-91fd-a8111225ee94"></a>sql-op :regr_avgx (y x)</h3>
<div class="outline-text-3" id="text-e13eb576-0122-4f37-a562-e17e2ab0139c">
<p>
The regr_avgx function returns the average of the independent variable
(sum(X)/N) Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_avgx</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org16772ff" class="outline-3">
<h3 id="5aa7f48a-7a16-49d8-8430-1e4937d6c28c"><a id="org16772ff"></a><a id="ID-2fc66640-03e7-4796-8209-69fba9f346a4"></a>sql-op :regr_avgy (y x)</h3>
<div class="outline-text-3" id="text-5aa7f48a-7a16-49d8-8430-1e4937d6c28c">
<p>
The regr_avgy function returns the average of the dependent variable
(sum(Y)/N). Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
<p>
(query (:select (:regr_avgy 'height 'weight)
                :from 'people))
</p>
</div>
</div>
<div id="outline-container-org19eb783" class="outline-3">
<h3 id="db67bccf-132b-43ce-bf1c-e0067d7bf40f"><a id="org19eb783"></a><a id="ID-293a2e93-93bf-4c08-b0f4-6d3dfe0feb6b"></a>sql-op :regr_count (y x)</h3>
<div class="outline-text-3" id="text-db67bccf-132b-43ce-bf1c-e0067d7bf40f">
<p>
The regr_count function returns the number of input rows in which both
expressions are nonnull. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_count</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org43cf1e2" class="outline-3">
<h3 id="ef9bd421-d14d-4b1f-9ed8-d17e39da6633"><a id="org43cf1e2"></a><a id="ID-8b92dc89-b251-4bac-ba53-58251e98d3f5"></a>sql-op :regr_intercept (y x)</h3>
<div class="outline-text-3" id="text-ef9bd421-d14d-4b1f-9ed8-d17e39da6633">
<p>
The regr_intercept function returns the y-intercept of the least-squares-fit
linear equation determined by the (X, Y) pairs. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_intercept</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bfc4ff" class="outline-3">
<h3 id="db9ef2ff-7928-4471-890f-3ef70833409a"><a id="org4bfc4ff"></a><a id="ID-09020f6e-166a-40e8-85ea-fdaced1f7808"></a>sql-op :regr_r2 (y x)</h3>
<div class="outline-text-3" id="text-db9ef2ff-7928-4471-890f-3ef70833409a">
<p>
The regr_r2 function returns the square of the correlation coefficient. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_r2</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org19541f3" class="outline-3">
<h3 id="88eeb544-9950-402d-95be-5c37875ae64d"><a id="org19541f3"></a><a id="ID-b22a7906-c571-4463-884f-4067d51cf0ac"></a>sql-op :regr_slope (y x)</h3>
<div class="outline-text-3" id="text-88eeb544-9950-402d-95be-5c37875ae64d">
<p>
The regr_slope function returns the slope of the least-squares-fit linear
equation determined by the (X, Y) pairs. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_slope</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6837d9f" class="outline-3">
<h3 id="8f506e5f-1256-462a-a814-55f690573b41"><a id="org6837d9f"></a><a id="ID-9c7cc59e-419d-4161-9711-de2c9b0c27ec"></a>sql-op :regr_sxx (y x)</h3>
<div class="outline-text-3" id="text-8f506e5f-1256-462a-a814-55f690573b41">
<p>
The regr_sxx function returns the sum(X^2) - sum(X)^2/N (“sum of squares” of
the independent variable). Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_sxx</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgccdad10" class="outline-3">
<h3 id="410432a6-33a2-4757-9392-f3caacf8fb79"><a id="orgccdad10"></a><a id="ID-24f03953-7fea-4b18-8d69-ccd5b6d9f1f5"></a>sql-op :regr_sxy (y x)</h3>
<div class="outline-text-3" id="text-410432a6-33a2-4757-9392-f3caacf8fb79">
<p>
The regr_sxy function returns the sum(X*Y) - sum(X) * sum(Y)/N (“sum of products”
of independent times dependent variable). Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_sxy</span> 'height 'weight)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'people))
</pre>
</div>
</div>
</div>

<div id="outline-container-org40df3f2" class="outline-3">
<h3 id="8c2a625b-8b29-40d7-a96f-d32d9c6a7c3f"><a id="org40df3f2"></a><a id="ID-34f776b1-d29d-4d49-a66b-21262379510b"></a>sql-op :regr_syy (y x)</h3>
<div class="outline-text-3" id="text-8c2a625b-8b29-40d7-a96f-d32d9c6a7c3f">
<p>
The regr_syy function returns the sum(Y^2) - sum(Y)^2/N (“sum of squares”
of the dependent variable). Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:regr_syy</span> 'salary 'age)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee))
</pre>
</div>
</div>
</div>

<div id="outline-container-org289620c" class="outline-3">
<h3 id="14985ca9-ddfd-45b5-81a4-6c372367a7f2"><a id="org289620c"></a><a id="ID-e0558145-d8e0-4ea3-b9ae-cc92ef332b70"></a>sql-op :stddev (&amp;rest args)</h3>
<div class="outline-text-3" id="text-14985ca9-ddfd-45b5-81a4-6c372367a7f2">
<p>
The stddev function returns the the sample standard deviation of the input
values. It is a historical alias for stddev-samp. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:stddev</span> 'salary)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee))
</pre>
</div>
</div>
</div>
