doc/s-sql.org
** sql-op :stddev-pop (&rest args)
   :PROPERTIES:
   :ID:       e4eeac17-7d09-45d8-8589-47d9b09a95d2
   :CUSTOM_ID: f0893825-0ec3-40a7-8c55-2fb7fbb83e56
   :END:

The stddev-pop function returns the population standard deviation of the
input values. Example:
#+BEGIN_SRC lisp
(query (:select (:stddev-pop 'salary)
                :from 'employee))
#+END_SRC

** sql-op :stddev-samp (&rest args)
   :PROPERTIES:
   :ID:       4095965c-e969-4663-9ae4-2becfe72de7a
   :CUSTOM_ID: 71fa53eb-9b24-41a8-aef5-88a2c3d69f7f
   :END:

The stddev-samp function returns the sample standard deviation of the
input values. Example:
#+BEGIN_SRC lisp
(query (:select (:stddev-samp 'salary)
                :from 'employee))
#+END_SRC

** sql-op :variance (&rest args)
   :PROPERTIES:
   :ID:       e4cd292a-4d33-434d-a698-4ae921a3173b
   :CUSTOM_ID: 4c10fed0-0f57-458a-9069-5c145c4863a7
   :END:

Variance is a historical alias for var_samp. The variance function returns
the sample variance of the input values (square of the sample standard deviation).
Example:
#+BEGIN_SRC lisp
(query (:select (:variance 'salary)
                :from 'employee))
#+END_SRC

** sql-op :var-pop (&rest args)
   :PROPERTIES:
   :ID:       d72f79cc-b7b1-4481-a93f-6d565c6a582b
   :CUSTOM_ID: d94ae20b-6b41-44cc-a038-dd6d2c7ff0a9
   :END:

The var-pop function returns the population variance of the input values
(square of the population standard deviation). Example:
#+BEGIN_SRC lisp
(query (:select (:var-pop 'salary)
                :from 'employee)
       :single)
#+END_SRC

** sql-op :var-samp (&rest args)
   :PROPERTIES:
   :ID:       12a5e8ba-4467-4411-a604-c8152c3fbc7d
   :CUSTOM_ID: 50bb4418-560b-468a-8181-c93a96167699
   :END:

The var-samp function returns the sample variance of the input values
(square of the sample standard deviation). Example:
#+BEGIN_SRC lisp
(query (:select (:var-samp 'salary)
                :from 'employee)
       :single)
#+END_SRC

Window Functions
** sql-op :over (form &rest args)
   :PROPERTIES:
   :ID:       bb6eb9f2-d9ed-4348-9467-79cae9b78819
   :CUSTOM_ID: d301c1e9-2e17-4572-80d0-ead54969a39d
   :END:

Over, partition-by and window are so-called window functions. A window
function performs a calculation across a set of table rows that are
somehow related to the current row.
#+BEGIN_SRC lisp
(query (:select 'salary (:over (:sum 'salary))
                :from 'empsalary))
#+END_SRC

** sql-op :partition-by (&rest args)
   :PROPERTIES:
   :ID:       53d1397d-4f1d-4833-b0c1-79d18e943f8b
   :CUSTOM_ID: 4f263804-9832-4210-bf7c-7fce8551f422
   :END:

Args is a list of one or more columns to partition by, optionally
followed by an :order-by clause.
#+BEGIN_SRC lisp
(query (:select 'depname 'subdepname 'empno 'salary
                (:over (:avg 'salary)
                       (:partition-by 'depname 'subdepname))
                :from 'empsalary))
#+END_SRC

Note the use of :order-by without parens:
#+BEGIN_SRC lisp
(query (:select 'depname 'empno 'salary
                (:over (:rank)
                       (:partition-by 'depname :order-by (:desc 'salary)))
                :from 'empsalary))
#+END_SRC


** sql-op :window (form)
   :PROPERTIES:
   :ID:       63d29a3b-c105-4e09-ab3b-ca5e4ece17af
   :CUSTOM_ID: 3c8d74c5-b57f-4ae2-9b54-fc19c562cc25
   :END:
#+BEGIN_SRC lisp
(query (:select (:over (:sum 'salary) 'w)
                (:over (:avg 'salary) 'w)
                :from 'empsalary :window
                (:as 'w (:partition-by 'depname :order-by (:desc 'salary)))))
#+END_SRC

** sql-op :with (&rest args)
   :PROPERTIES:
   :ID:       38fc8a49-9a90-4f6c-930f-c704964ec991
   :CUSTOM_ID: b3e25bc1-6e1b-4f3b-aadc-d694a32d6363
   :END:

With provides a way to write auxillary statements for use in a larger query,
often referred to as Common Table Expressions or CTEs.
#+BEGIN_SRC lisp
(query (:with (:as 'upd
                   (:parens
                    (:update 'employees :set 'sales-count (:+ 'sales-count 1)
                             :where (:= 'id
                                        (:select 'sales-person
                                                 :from 'accounts
                                                 :where (:= 'name "Acme Corporation")))
                             :returning '*)))
              (:insert-into 'employees-log
                            (:select '* (:current-timestamp) :from
                                     'upd))))
#+END_SRC

