doc/s-sql.html

<div id="outline-container-org5282232" class="outline-3">
<h3 id="f0893825-0ec3-40a7-8c55-2fb7fbb83e56"><a id="org5282232"></a><a id="ID-e4eeac17-7d09-45d8-8589-47d9b09a95d2"></a>sql-op :stddev-pop (&amp;rest args)</h3>
<div class="outline-text-3" id="text-f0893825-0ec3-40a7-8c55-2fb7fbb83e56">
<p>
The stddev-pop function returns the population standard deviation of the
input values. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:stddev-pop</span> 'salary)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee))
</pre>
</div>
</div>
</div>

<div id="outline-container-org75c92ef" class="outline-3">
<h3 id="71fa53eb-9b24-41a8-aef5-88a2c3d69f7f"><a id="org75c92ef"></a><a id="ID-4095965c-e969-4663-9ae4-2becfe72de7a"></a>sql-op :stddev-samp (&amp;rest args)</h3>
<div class="outline-text-3" id="text-71fa53eb-9b24-41a8-aef5-88a2c3d69f7f">
<p>
The stddev-samp function returns the sample standard deviation of the
input values. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:stddev-samp</span> 'salary)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c33dbf" class="outline-3">
<h3 id="4c10fed0-0f57-458a-9069-5c145c4863a7"><a id="org3c33dbf"></a><a id="ID-e4cd292a-4d33-434d-a698-4ae921a3173b"></a>sql-op :variance (&amp;rest args)</h3>
<div class="outline-text-3" id="text-4c10fed0-0f57-458a-9069-5c145c4863a7">
<p>
Variance is a historical alias for var_samp. The variance function returns
the sample variance of the input values (square of the sample standard deviation).
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:variance</span> 'salary)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8648d55" class="outline-3">
<h3 id="d94ae20b-6b41-44cc-a038-dd6d2c7ff0a9"><a id="org8648d55"></a><a id="ID-d72f79cc-b7b1-4481-a93f-6d565c6a582b"></a>sql-op :var-pop (&amp;rest args)</h3>
<div class="outline-text-3" id="text-d94ae20b-6b41-44cc-a038-dd6d2c7ff0a9">
<p>
The var-pop function returns the population variance of the input values
(square of the population standard deviation). Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:var-pop</span> 'salary)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee)
       <span style="color: #98fb98; font-weight: bold;">:single</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e3f068" class="outline-3">
<h3 id="50bb4418-560b-468a-8181-c93a96167699"><a id="org7e3f068"></a><a id="ID-12a5e8ba-4467-4411-a604-c8152c3fbc7d"></a>sql-op :var-samp (&amp;rest args)</h3>
<div class="outline-text-3" id="text-50bb4418-560b-468a-8181-c93a96167699">
<p>
The var-samp function returns the sample variance of the input values
(square of the sample standard deviation). Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:var-samp</span> 'salary)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee)
       <span style="color: #98fb98; font-weight: bold;">:single</span>)
</pre>
</div>

<p>
Window Functions
</p>
</div>
</div>
<div id="outline-container-org85b8ba6" class="outline-3">
<h3 id="d301c1e9-2e17-4572-80d0-ead54969a39d"><a id="org85b8ba6"></a><a id="ID-bb6eb9f2-d9ed-4348-9467-79cae9b78819"></a>sql-op :over (form &amp;rest args)</h3>
<div class="outline-text-3" id="text-d301c1e9-2e17-4572-80d0-ead54969a39d">
<p>
Over, partition-by and window are so-called window functions. A window
function performs a calculation across a set of table rows that are
somehow related to the current row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'salary (<span style="color: #98fb98; font-weight: bold;">:over</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'salary))
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'empsalary))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b1a3d6" class="outline-3">
<h3 id="4f263804-9832-4210-bf7c-7fce8551f422"><a id="org0b1a3d6"></a><a id="ID-53d1397d-4f1d-4833-b0c1-79d18e943f8b"></a>sql-op :partition-by (&amp;rest args)</h3>
<div class="outline-text-3" id="text-4f263804-9832-4210-bf7c-7fce8551f422">
<p>
Args is a list of one or more columns to partition by, optionally
followed by an :order-by clause.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'depname 'subdepname 'empno 'salary
                (<span style="color: #98fb98; font-weight: bold;">:over</span> (<span style="color: #98fb98; font-weight: bold;">:avg</span> 'salary)
                       (<span style="color: #98fb98; font-weight: bold;">:partition-by</span> 'depname 'subdepname))
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'empsalary))
</pre>
</div>

<p>
Note the use of :order-by without parens:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'depname 'empno 'salary
                (<span style="color: #98fb98; font-weight: bold;">:over</span> (<span style="color: #98fb98; font-weight: bold;">:rank</span>)
                       (<span style="color: #98fb98; font-weight: bold;">:partition-by</span> 'depname <span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:desc</span> 'salary)))
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'empsalary))
</pre>
</div>
</div>
</div>


<div id="outline-container-org302a6af" class="outline-3">
<h3 id="3c8d74c5-b57f-4ae2-9b54-fc19c562cc25"><a id="org302a6af"></a><a id="ID-63d29a3b-c105-4e09-ab3b-ca5e4ece17af"></a>sql-op :window (form)</h3>
<div class="outline-text-3" id="text-3c8d74c5-b57f-4ae2-9b54-fc19c562cc25">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:over</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'salary) 'w)
                (<span style="color: #98fb98; font-weight: bold;">:over</span> (<span style="color: #98fb98; font-weight: bold;">:avg</span> 'salary) 'w)
                <span style="color: #98fb98; font-weight: bold;">:from</span> 'empsalary <span style="color: #98fb98; font-weight: bold;">:window</span>
                (<span style="color: #98fb98; font-weight: bold;">:as</span> 'w (<span style="color: #98fb98; font-weight: bold;">:partition-by</span> 'depname <span style="color: #98fb98; font-weight: bold;">:order-by</span> (<span style="color: #98fb98; font-weight: bold;">:desc</span> 'salary)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d85288" class="outline-3">
<h3 id="b3e25bc1-6e1b-4f3b-aadc-d694a32d6363"><a id="org2d85288"></a><a id="ID-38fc8a49-9a90-4f6c-930f-c704964ec991"></a>sql-op :with (&amp;rest args)</h3>
<div class="outline-text-3" id="text-b3e25bc1-6e1b-4f3b-aadc-d694a32d6363">
<p>
With provides a way to write auxillary statements for use in a larger query,
often referred to as Common Table Expressions or CTEs.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:with</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'upd
                   (<span style="color: #98fb98; font-weight: bold;">:parens</span>
                    (<span style="color: #98fb98; font-weight: bold;">:update</span> 'employees <span style="color: #98fb98; font-weight: bold;">:set</span> 'sales-count (<span style="color: #98fb98; font-weight: bold;">:+</span> 'sales-count 1)
                             <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id
                                        (<span style="color: #98fb98; font-weight: bold;">:select</span> 'sales-person
                                                 <span style="color: #98fb98; font-weight: bold;">:from</span> 'accounts
                                                 <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'name <span style="color: #cd8162;">"Acme Corporation"</span>)))
                             <span style="color: #98fb98; font-weight: bold;">:returning</span> '*)))
              (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'employees-log
                            (<span style="color: #98fb98; font-weight: bold;">:select</span> '* (<span style="color: #98fb98; font-weight: bold;">:current-timestamp</span>) <span style="color: #98fb98; font-weight: bold;">:from</span>
                                     'upd))))
</pre>
</div>
</div>
</div>
