doc/s-sql.html

<div id="outline-container-orgda82fc9" class="outline-3">
<h3 id="95faa857-c1b9-4a85-a5a9-1fcbb12d4d1a"><a id="orgda82fc9"></a><a id="ID-78be2433-4c26-4e2c-b333-e234393b5dc1"></a>sql-op :with-recursive (&amp;rest args)</h3>
<div class="outline-text-3" id="text-95faa857-c1b9-4a85-a5a9-1fcbb12d4d1a">
<p>
Recursive modifier to a WITH statement, allowing the query to refer to its own output.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #00ffff;">:with-recursive</span>
      (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:t1</span> 'n)
           (<span style="color: #98fb98; font-weight: bold;">:union-all</span> (<span style="color: #98fb98; font-weight: bold;">:values</span> (<span style="color: #98fb98; font-weight: bold;">:set</span> 1))
                       (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:+</span> 'n 1)
                                <span style="color: #98fb98; font-weight: bold;">:from</span> 't1
                                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:&lt;</span> 'n 100))))
      (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'n) <span style="color: #98fb98; font-weight: bold;">:from</span> 't1)))

(query (<span style="color: #00ffff;">:with-recursive</span>
      (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:included_parts</span> 'sub-part 'part 'quantity)
           (<span style="color: #98fb98; font-weight: bold;">:union-all</span>
            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'sub-part 'part 'quantity
                     <span style="color: #98fb98; font-weight: bold;">:from</span> 'parts
                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'part <span style="color: #cd8162;">"our-product"</span>))
            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'p.sub-part 'p.part 'p.quantity
                     <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'included-parts 'pr)
                     (<span style="color: #98fb98; font-weight: bold;">:as</span> 'parts 'p)
                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'p.part 'pr.sub-part) )))
      (<span style="color: #98fb98; font-weight: bold;">:select</span> 'sub-part (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:sum</span> 'quantity) 'total-quantity)
               <span style="color: #98fb98; font-weight: bold;">:from</span> 'included-parts
               <span style="color: #98fb98; font-weight: bold;">:group-by</span> 'sub-part)))

(query (<span style="color: #00ffff;">:with-recursive</span>
      (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:search-graph</span> 'id 'link 'data 'depth)
           (<span style="color: #98fb98; font-weight: bold;">:union-all</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> 'g.id 'g.link 'g.data 1
                                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'graph 'g))
                       (<span style="color: #98fb98; font-weight: bold;">:select</span> 'g.id 'g.link 'g.data (<span style="color: #98fb98; font-weight: bold;">:+</span> 'sg.depth 1)
                                <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'graph 'g) (<span style="color: #98fb98; font-weight: bold;">:as</span> 'search-graph 'sg)
                                <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'g.id 'sg.link))))
      (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'search-graph)))

(query (<span style="color: #00ffff;">:with-recursive</span>
      (<span style="color: #98fb98; font-weight: bold;">:as</span> (<span style="color: #98fb98; font-weight: bold;">:search-graph</span> 'id 'link 'data'depth 'path 'cycle)
           (<span style="color: #98fb98; font-weight: bold;">:union-all</span>
            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'g.id 'g.link 'g.data 1
                     (<span style="color: #98fb98; font-weight: bold;">:[]</span> 'g.f1 'g.f2) nil
                     <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'graph 'g))
            (<span style="color: #98fb98; font-weight: bold;">:select</span> 'g.id 'g.link 'g.data (<span style="color: #98fb98; font-weight: bold;">:+</span> 'sg.depth 1)
                     (:|| 'path (<span style="color: #98fb98; font-weight: bold;">:row</span> 'g.f1 'g.f2))
                     (<span style="color: #98fb98; font-weight: bold;">:=</span> (<span style="color: #98fb98; font-weight: bold;">:row</span> 'g.f1 'g.f2)
                         (<span style="color: #98fb98; font-weight: bold;">:any*</span> 'path))
                     <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'graph 'g)
                     (<span style="color: #98fb98; font-weight: bold;">:as</span> 'search-graph 'sg)
                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'g.id 'sg.link)
                                  (<span style="color: #98fb98; font-weight: bold;">:not</span> 'cycle)))))
      (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'search-graph)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2f0d7c5" class="outline-2">
<h2 id="f09702d4-8c8c-4887-bc90-bbeeb7a6fd20"><a id="org2f0d7c5"></a><a id="ID-dbedabf5-eaf5-4adb-b323-b42926acc81a"></a>Table Functions</h2>
<div class="outline-text-2" id="text-f09702d4-8c8c-4887-bc90-bbeeb7a6fd20">
</div>
<div id="outline-container-org3c2cd49" class="outline-3">
<h3 id="0342b8ed-2ad6-4128-aa0d-143934d21a96"><a id="org3c2cd49"></a><a id="ID-ace310e6-8bd1-4211-bf66-ef56c9b7e872"></a>sql-op :for-update (query &amp;key of nowait)</h3>
<div class="outline-text-3" id="text-0342b8ed-2ad6-4128-aa0d-143934d21a96">
<p>
Locks the selected rows against concurrent updates. This will prevent the
rows from being modified or deleted by other transactions until the current
transaction ends. The :of keyword should be followed by one or more table
names. If provided, PostgreSQL will lock these tables instead of the ones
detected in the select statement. The :nowait keyword should be provided
by itself (with no argument attached to it), after all the :of arguments.
If :nowait is provided, PostgreSQL will throw an error if a table cannot be
locked immediately, instead of pausing until it's possible.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:for-update</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> <span style="color: #98fb98; font-weight: bold;">:*</span> <span style="color: #98fb98; font-weight: bold;">:from</span> 'foo 'bar 'baz) <span style="color: #98fb98; font-weight: bold;">:of</span> 'bar 'baz <span style="color: #98fb98; font-weight: bold;">:nowait</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2413428" class="outline-3">
<h3 id="be469ee7-32e2-49e2-9080-75e8ff7808e0"><a id="org2413428"></a><a id="ID-457394be-ef0d-444a-ad33-fefbc39363e3"></a>sql-op :for-share (query &amp;key of nowait)</h3>
<div class="outline-text-3" id="text-be469ee7-32e2-49e2-9080-75e8ff7808e0">
<p>
Similar to :for-update, except it acquires a shared lock on the table,
allowing other transactions to perform :for-share selects on the locked
tables.
</p>
</div>
</div>
