doc/s-sql.org
** sql-op :insert-into (table &rest rest)
   :PROPERTIES:
   :ID:       a63202ff-4aa9-4af3-9b82-254516db07e1
   :CUSTOM_ID: 62cd3ff0-f034-46fc-a28e-c9875b577c40
   :END:

Use insert-into when you are either inserting from a select clause and you do not need to specify specific columns:
#+BEGIN_SRC lisp
(query (:insert-into 'table1
         (:select 'c1 'c2 :from 'table2)))
#+END_SRC
or you are alternating specific columns and values for a single row:
#+BEGIN_SRC lisp
(query (:insert-into 'my-table :set 'field-1 42 'field-2 "foobar"))
#+END_SRC
You can use parameterized variables in the insert statement.
#+BEGIN_SRC lisp
(let ((name "test-cat4"))
  (query (:insert-into 'categories :set 'name '$1) name))
#+END_SRC
It is possible to add :returning, followed by a list of field names or
expressions, at the end of the :insert-into form. This will cause the
query to return the values of these expressions as a single row.
#+BEGIN_SRC lisp
(query (:insert-into 'my-table
        :set 'field-1 42 'field-2 "foobar"
        :returning '*))

(query (:insert-into 'my-table
        :set 'field-1 42 'field-2 "foobar"
        :returning 'id))
#+END_SRC
In Postgresql versions 9.5 and above, it is possible to add
:on-conflict-do-nothing (if the item already exists, do nothing). If you want to specify the unique column to be checked for conflict, use :on-conflict 'column-name :do-nothing. If you do not want to specify the unique column name, use :on-conflict-do-nothing.
#+BEGIN_SRC lisp
(query (:insert-into 'test-table :set 'column-A '$1 'column-B '$2
                     :on-conflict 'column-A :do-nothing
                     :where (:= 'test-table.column-A '$1)
                     :returning '*)
        "c" 37)

(query (:insert-into 'test-table :set 'column-A '$1 'column-B '$2
                     :on-conflict-do-nothing 'column-A
                     :where (:= 'test-table.column-A '$1)
                     :returning '*)
        "c" 37)
#+END_SRC
If your insertion is setting a column that is an identity column with a value normally created by the system and you want to override that, you can use the :overriding-system-value keyword:
#+BEGIN_SRC lisp
(query (:insert-into 'table1  :set 'c1 "A" 'c2 "B" :overriding-system-value))

(query (:insert-rows-into 'table1
        :overriding-user-value
        :values '(((:select 'c1 'c2 :from 'table2)))))
#+END_SRC

To create what is commonly known as an upsert, use :on-conflict-update
(if the item already exists, update the values)
followed by a list of field names which are checked for the conflict
then using :update-set followed by a list of field names or expressions
following the syntax for updating a table. This is sometimes called
an "upsert". Note that as per the postgresql sql documentation you must
prepend the table name to the column in the where statement if you are updating.
#+BEGIN_SRC lisp
(query (:insert-into 'test-table :set 'column-A '$1 'column-B '$2
                     :on-conflict-update 'column-A
                     :update-set 'column-B '$2
                     :where (:= 'test-table.column-A '$1)
                     :returning '*)
        "c" 37)
#+END_SRC
If the destination table has identity columns and you want to override those identity columns with specific values, you should specify :overriding-system-value.
#+BEGIN_SRC lisp
(query (:insert-into 'test-table
        :set 'column-A '$1 'column-B '$2
        :overriding-system-value
        :on-conflict-update 'column-A
        :update-set 'column-B '$2
        :where (:= 'test-table.column-A '$1)
        :returning '*)
        "c" 37)
#+END_SRC
If you are selecting from another table which has column names the same as your destination table and you want to keep the destination table's identity column values, then you can use :overriding-user-value. E.g.
#+BEGIN_SRC lisp
(query (:insert-into 'table1
         :overriding-user-value
         (:select 'c1 'c2 :from 'table2)))
#+END_SRC
