doc/s-sql.html

<div id="outline-container-orga3e433b" class="outline-3">
<h3 id="62cd3ff0-f034-46fc-a28e-c9875b577c40"><a id="orga3e433b"></a><a id="ID-a63202ff-4aa9-4af3-9b82-254516db07e1"></a>sql-op :insert-into (table &amp;rest rest)</h3>
<div class="outline-text-3" id="text-62cd3ff0-f034-46fc-a28e-c9875b577c40">
<p>
Use insert-into when you are either inserting from a select clause and you do not need to specify specific columns:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'table1
         (<span style="color: #98fb98; font-weight: bold;">:select</span> 'c1 'c2 <span style="color: #98fb98; font-weight: bold;">:from</span> 'table2)))
</pre>
</div>
<p>
or you are alternating specific columns and values for a single row:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'my-table <span style="color: #98fb98; font-weight: bold;">:set</span> 'field-1 42 'field-2 <span style="color: #cd8162;">"foobar"</span>))
</pre>
</div>
<p>
You can use parameterized variables in the insert statement.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((name <span style="color: #cd8162;">"test-cat4"</span>))
  (query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'categories <span style="color: #98fb98; font-weight: bold;">:set</span> 'name '$1) name))
</pre>
</div>
<p>
It is possible to add :returning, followed by a list of field names or
expressions, at the end of the :insert-into form. This will cause the
query to return the values of these expressions as a single row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'my-table
        <span style="color: #98fb98; font-weight: bold;">:set</span> 'field-1 42 'field-2 <span style="color: #cd8162;">"foobar"</span>
        <span style="color: #98fb98; font-weight: bold;">:returning</span> '*))

(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'my-table
        <span style="color: #98fb98; font-weight: bold;">:set</span> 'field-1 42 'field-2 <span style="color: #cd8162;">"foobar"</span>
        <span style="color: #98fb98; font-weight: bold;">:returning</span> 'id))
</pre>
</div>
<p>
In Postgresql versions 9.5 and above, it is possible to add
:on-conflict-do-nothing (if the item already exists, do nothing). If you want to specify the unique column to be checked for conflict, use :on-conflict 'column-name :do-nothing. If you do not want to specify the unique column name, use :on-conflict-do-nothing.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-table <span style="color: #98fb98; font-weight: bold;">:set</span> 'column-A '$1 'column-B '$2
                     <span style="color: #98fb98; font-weight: bold;">:on-conflict</span> 'column-A <span style="color: #98fb98; font-weight: bold;">:do-nothing</span>
                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'test-table.column-A '$1)
                     <span style="color: #98fb98; font-weight: bold;">:returning</span> '*)
        <span style="color: #cd8162;">"c"</span> 37)

(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-table <span style="color: #98fb98; font-weight: bold;">:set</span> 'column-A '$1 'column-B '$2
                     <span style="color: #98fb98; font-weight: bold;">:on-conflict-do-nothing</span> 'column-A
                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'test-table.column-A '$1)
                     <span style="color: #98fb98; font-weight: bold;">:returning</span> '*)
        <span style="color: #cd8162;">"c"</span> 37)
</pre>
</div>
<p>
If your insertion is setting a column that is an identity column with a value normally created by the system and you want to override that, you can use the :overriding-system-value keyword:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'table1  <span style="color: #98fb98; font-weight: bold;">:set</span> 'c1 <span style="color: #cd8162;">"A"</span> 'c2 <span style="color: #cd8162;">"B"</span> <span style="color: #98fb98; font-weight: bold;">:overriding-system-value</span>))

(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'table1
        <span style="color: #98fb98; font-weight: bold;">:overriding-user-value</span>
        <span style="color: #98fb98; font-weight: bold;">:values</span> '(((<span style="color: #98fb98; font-weight: bold;">:select</span> 'c1 'c2 <span style="color: #98fb98; font-weight: bold;">:from</span> 'table2)))))
</pre>
</div>

<p>
To create what is commonly known as an upsert, use :on-conflict-update
(if the item already exists, update the values)
followed by a list of field names which are checked for the conflict
then using :update-set followed by a list of field names or expressions
following the syntax for updating a table. This is sometimes called
an "upsert". Note that as per the postgresql sql documentation you must
prepend the table name to the column in the where statement if you are updating.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-table <span style="color: #98fb98; font-weight: bold;">:set</span> 'column-A '$1 'column-B '$2
                     <span style="color: #98fb98; font-weight: bold;">:on-conflict-update</span> 'column-A
                     <span style="color: #98fb98; font-weight: bold;">:update-set</span> 'column-B '$2
                     <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'test-table.column-A '$1)
                     <span style="color: #98fb98; font-weight: bold;">:returning</span> '*)
        <span style="color: #cd8162;">"c"</span> 37)
</pre>
</div>
<p>
If the destination table has identity columns and you want to override those identity columns with specific values, you should specify :overriding-system-value.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-table
        <span style="color: #98fb98; font-weight: bold;">:set</span> 'column-A '$1 'column-B '$2
        <span style="color: #98fb98; font-weight: bold;">:overriding-system-value</span>
        <span style="color: #98fb98; font-weight: bold;">:on-conflict-update</span> 'column-A
        <span style="color: #98fb98; font-weight: bold;">:update-set</span> 'column-B '$2
        <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'test-table.column-A '$1)
        <span style="color: #98fb98; font-weight: bold;">:returning</span> '*)
        <span style="color: #cd8162;">"c"</span> 37)
</pre>
</div>
<p>
If you are selecting from another table which has column names the same as your destination table and you want to keep the destination table's identity column values, then you can use :overriding-user-value. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'table1
         <span style="color: #98fb98; font-weight: bold;">:overriding-user-value</span>
         (<span style="color: #98fb98; font-weight: bold;">:select</span> 'c1 'c2 <span style="color: #98fb98; font-weight: bold;">:from</span> 'table2)))
</pre>
</div>
</div>
</div>
