doc/s-sql.org
** sql-op :insert-rows-into (table &rest rest)
   :PROPERTIES:
   :ID:       26d60b83-60f5-4bb4-8a03-cd897a455139
   :CUSTOM_ID: ce43d017-71a6-4205-80aa-372c0882d5a4
   :END:
Insert-rows-into provides the ability to insert multiple rows into a table without using a select statement. (Insert-rows-into keeps the VALUES key word in the resulting sql. If you do use a select statement, Postgresql requires that it only return one row.)

Specify the columns first with the keyword :columns then provide a list of lists of the values as a parameter to the keyword :values. Example:
#+BEGIN_SRC lisp
(query (:insert-rows-into 'my-table
        :columns 'field-1 'field-2
        :values '((42 "foobar") (23 "foobaz"))))
#+END_SRC
An example using a select statement returning one row:
#+BEGIN_SRC lisp
(squery (:insert-rows-into 't6
         :columns 'tags
         :values '(((:select 'id
                     :from 't5)))))
#+END_SRC
If you will use the default columns, this can be simplified and the :columns
parameters can be dropped. Example:
#+BEGIN_SRC lisp
(query (:insert-rows-into 'my-table
        :values '((42 "foobar") (23 "foobaz"))))
#+END_SRC
If your insertion is setting a column that is an identity column with a value normally created by the system and you want to override that, you can use the :overriding-system-value keyword:
#+BEGIN_SRC lisp
(query (:insert-rows-into 'table1
                   :columns 'c1 'c2
                   :overriding-system-value
                   :values '((1 "a") (2 "b"))))

(query (:insert-rows-into 'table1
        :overriding-system-value
        :values '(((:select 'c1 'c2 :from 'table2)))))
#+END_SRC
Similarly to :insert-into, :insert-rows-into allows the "upsert" use of :on-conflict. Again, if you want to specify the unique column to be checked for conflict, use :on-conflict 'column-name :do-nothing. If you do not want to specify the unique column name, use :on-conflict-do-nothing. The following example uses :on-conflict-do-nothing
#+BEGIN_SRC lisp
(query (:insert-rows-into 'distributors
        :columns 'did 'dname
        :values '((10 "Conrad International"))
        :on-conflict-do-nothing
        :where 'is-active))

(query (:insert-rows-into 'distributors
        :columns 'did 'dname
        :values '((10 "Conrad International"))
        :on-conflict 'did
        :do-nothing
        :where 'is-active))
#+END_SRC
or :on-conflict-update
#+BEGIN_SRC lisp
(query (:insert-rows-into 'distributors
        :columns 'did 'dname
        :values '((5 "Gizmo Transglobal") (6 "Associated Computing Inc."))
        :on-conflict-update 'did
        :update-set 'dname 'excluded.dname))
#+END_SRC
You can use :on-conflict-on-constraint to check for conflicts on constraints.
#+BEGIN_SRC lisp
(query (:insert-rows-into 'test :columns 'some-key 'some-val
                                :values '(("a" 3) ("b" 6) ("c" 7))
                                :on-conflict-on-constraint 'somekey
                                :do-nothing
                   :returning '*))

(query (:insert-rows-into 'test :columns 'some-key 'some-val
                                :values '(("a" 2) ("b" 6) ("c" 7))
                                :on-conflict-on-constraint 'somekey
                                :update-set 'some-val 'excluded.some-val
                   :returning '*))
#+END_SRC
** sql-op :update (table &rest rest)
   :PROPERTIES:
   :ID:       bbf790c1-9baa-4cf0-900c-16a5a2bc2081
   :CUSTOM_ID: fadb04ea-7827-477c-bc40-8e5baf263690
   :END:

Update values in a table. After the table name there should follow the
keyword :set and any number of alternating field names and values, like
for :insert-into. Next comes the optional keyword :from, followed by at
least one table name and then any number of join statements, like for
:select. After the joins, an optional :where keyword followed by the condition,
and :returning keyword followed by a list of field names or expressions
indicating values to be returned as query result.

** sql-op :delete-from (table &rest rest)
   :PROPERTIES:
   :ID:       cdee608e-71cb-4d41-9e1d-a21b7728d956
   :CUSTOM_ID: bf5b4590-222e-43e1-9048-bfca812ac026
   :END:

Delete rows from the named table. Can be given a :where argument followed
by a condition, and a :returning argument, followed by one or more
expressions that should be returned for every deleted row.
#+BEGIN_SRC lisp
(query (:delete-from 'cd.bookings :where (:= 'id 5)))
#+END_SRC
** sql-op :create-table (name (&rest columns) &rest options)
   :PROPERTIES:
   :ID:       4096efd3-8b88-4c50-8a02-d3f1a1b0d682
   :CUSTOM_ID: 44269d47-6da9-407e-a52f-407b2720a359
   :END:

Create a new table. The simplest example would pass two parameters,
the table name and a list of lists providing information for each column.
For example:
#+BEGIN_SRC lisp
(query (:create-table 'george ((id :type integer))))
#+END_SRC
where 'george is the name of the table, it has 1 column named id
which is limited to integers. There are no indexes or keys in this
example.

See [[file:create-tables.html]] for more detailed examples.

