doc/s-sql.html
<div id="outline-container-orgb9f8cdd" class="outline-3">
<h3 id="ce43d017-71a6-4205-80aa-372c0882d5a4"><a id="orgb9f8cdd"></a><a id="ID-26d60b83-60f5-4bb4-8a03-cd897a455139"></a>sql-op :insert-rows-into (table &amp;rest rest)</h3>
<div class="outline-text-3" id="text-ce43d017-71a6-4205-80aa-372c0882d5a4">
<p>
Insert-rows-into provides the ability to insert multiple rows into a table without using a select statement. (Insert-rows-into keeps the VALUES key word in the resulting sql. If you do use a select statement, Postgresql requires that it only return one row.)
</p>

<p>
Specify the columns first with the keyword :columns then provide a list of lists of the values as a parameter to the keyword :values. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'my-table
        <span style="color: #98fb98; font-weight: bold;">:columns</span> 'field-1 'field-2
        <span style="color: #98fb98; font-weight: bold;">:values</span> '((42 <span style="color: #cd8162;">"foobar"</span>) (23 <span style="color: #cd8162;">"foobaz"</span>))))
</pre>
</div>
<p>
An example using a select statement returning one row:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(squery (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 't6
         <span style="color: #98fb98; font-weight: bold;">:columns</span> 'tags
         <span style="color: #98fb98; font-weight: bold;">:values</span> '(((<span style="color: #98fb98; font-weight: bold;">:select</span> 'id
                     <span style="color: #98fb98; font-weight: bold;">:from</span> 't5)))))
</pre>
</div>
<p>
If you will use the default columns, this can be simplified and the :columns
parameters can be dropped. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'my-table
        <span style="color: #98fb98; font-weight: bold;">:values</span> '((42 <span style="color: #cd8162;">"foobar"</span>) (23 <span style="color: #cd8162;">"foobaz"</span>))))
</pre>
</div>
<p>
If your insertion is setting a column that is an identity column with a value normally created by the system and you want to override that, you can use the :overriding-system-value keyword:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'table1
                   <span style="color: #98fb98; font-weight: bold;">:columns</span> 'c1 'c2
                   <span style="color: #98fb98; font-weight: bold;">:overriding-system-value</span>
                   <span style="color: #98fb98; font-weight: bold;">:values</span> '((1 <span style="color: #cd8162;">"a"</span>) (2 <span style="color: #cd8162;">"b"</span>))))

(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'table1
        <span style="color: #98fb98; font-weight: bold;">:overriding-system-value</span>
        <span style="color: #98fb98; font-weight: bold;">:values</span> '(((<span style="color: #98fb98; font-weight: bold;">:select</span> 'c1 'c2 <span style="color: #98fb98; font-weight: bold;">:from</span> 'table2)))))
</pre>
</div>
<p>
Similarly to :insert-into, :insert-rows-into allows the "upsert" use of :on-conflict. Again, if you want to specify the unique column to be checked for conflict, use :on-conflict 'column-name :do-nothing. If you do not want to specify the unique column name, use :on-conflict-do-nothing. The following example uses :on-conflict-do-nothing
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'distributors
        <span style="color: #98fb98; font-weight: bold;">:columns</span> 'did 'dname
        <span style="color: #98fb98; font-weight: bold;">:values</span> '((10 <span style="color: #cd8162;">"Conrad International"</span>))
        <span style="color: #98fb98; font-weight: bold;">:on-conflict-do-nothing</span>
        <span style="color: #98fb98; font-weight: bold;">:where</span> 'is-active))

(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'distributors
        <span style="color: #98fb98; font-weight: bold;">:columns</span> 'did 'dname
        <span style="color: #98fb98; font-weight: bold;">:values</span> '((10 <span style="color: #cd8162;">"Conrad International"</span>))
        <span style="color: #98fb98; font-weight: bold;">:on-conflict</span> 'did
        <span style="color: #98fb98; font-weight: bold;">:do-nothing</span>
        <span style="color: #98fb98; font-weight: bold;">:where</span> 'is-active))
</pre>
</div>
<p>
or :on-conflict-update
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'distributors
        <span style="color: #98fb98; font-weight: bold;">:columns</span> 'did 'dname
        <span style="color: #98fb98; font-weight: bold;">:values</span> '((5 <span style="color: #cd8162;">"Gizmo Transglobal"</span>) (6 <span style="color: #cd8162;">"Associated Computing Inc."</span>))
        <span style="color: #98fb98; font-weight: bold;">:on-conflict-update</span> 'did
        <span style="color: #98fb98; font-weight: bold;">:update-set</span> 'dname 'excluded.dname))
</pre>
</div>
<p>
You can use :on-conflict-on-constraint to check for conflicts on constraints.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'test <span style="color: #98fb98; font-weight: bold;">:columns</span> 'some-key 'some-val
                                <span style="color: #98fb98; font-weight: bold;">:values</span> '((<span style="color: #cd8162;">"a"</span> 3) (<span style="color: #cd8162;">"b"</span> 6) (<span style="color: #cd8162;">"c"</span> 7))
                                <span style="color: #98fb98; font-weight: bold;">:on-conflict-on-constraint</span> 'somekey
                                <span style="color: #98fb98; font-weight: bold;">:do-nothing</span>
                   <span style="color: #98fb98; font-weight: bold;">:returning</span> '*))

(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'test <span style="color: #98fb98; font-weight: bold;">:columns</span> 'some-key 'some-val
                                <span style="color: #98fb98; font-weight: bold;">:values</span> '((<span style="color: #cd8162;">"a"</span> 2) (<span style="color: #cd8162;">"b"</span> 6) (<span style="color: #cd8162;">"c"</span> 7))
                                <span style="color: #98fb98; font-weight: bold;">:on-conflict-on-constraint</span> 'somekey
                                <span style="color: #98fb98; font-weight: bold;">:update-set</span> 'some-val 'excluded.some-val
                   <span style="color: #98fb98; font-weight: bold;">:returning</span> '*))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfd444ac" class="outline-3">
<h3 id="fadb04ea-7827-477c-bc40-8e5baf263690"><a id="orgfd444ac"></a><a id="ID-bbf790c1-9baa-4cf0-900c-16a5a2bc2081"></a>sql-op :update (table &amp;rest rest)</h3>
<div class="outline-text-3" id="text-fadb04ea-7827-477c-bc40-8e5baf263690">
<p>
Update values in a table. After the table name there should follow the
keyword :set and any number of alternating field names and values, like
for :insert-into. Next comes the optional keyword :from, followed by at
least one table name and then any number of join statements, like for
:select. After the joins, an optional :where keyword followed by the condition,
and :returning keyword followed by a list of field names or expressions
indicating values to be returned as query result.
</p>
</div>
</div>

<div id="outline-container-org72ccff8" class="outline-3">
<h3 id="bf5b4590-222e-43e1-9048-bfca812ac026"><a id="org72ccff8"></a><a id="ID-cdee608e-71cb-4d41-9e1d-a21b7728d956"></a>sql-op :delete-from (table &amp;rest rest)</h3>
<div class="outline-text-3" id="text-bf5b4590-222e-43e1-9048-bfca812ac026">
<p>
Delete rows from the named table. Can be given a :where argument followed
by a condition, and a :returning argument, followed by one or more
expressions that should be returned for every deleted row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:delete-from</span> 'cd.bookings <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id 5)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org91c1a76" class="outline-3">
<h3 id="44269d47-6da9-407e-a52f-407b2720a359"><a id="org91c1a76"></a><a id="ID-4096efd3-8b88-4c50-8a02-d3f1a1b0d682"></a>sql-op :create-table (name (&amp;rest columns) &amp;rest options)</h3>
<div class="outline-text-3" id="text-44269d47-6da9-407e-a52f-407b2720a359">
<p>
Create a new table. The simplest example would pass two parameters,
the table name and a list of lists providing information for each column.
For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:create-table</span> 'george ((id <span style="color: #98fb98; font-weight: bold;">:type</span> integer))))
</pre>
</div>
<p>
where 'george is the name of the table, it has 1 column named id
which is limited to integers. There are no indexes or keys in this
example.
</p>

<p>
See <a href="create-tables.html">create-tables.html</a> for more detailed examples.
</p>
</div>
