doc/s-sql.org
*** Column Definition parameters
    :PROPERTIES:
    :ID:       d0a01fab-1489-47dd-8307-30c28351e8af
    :CUSTOM_ID: 174224d0-57c7-475c-b916-dc7f68faea29
    :END:
After the table name a list of column definitions
follows, which are lists that start with a name, followed by one or
more of the following keyword arguments:

- :type

This one is required. It specifies the type of the column. Use a type like
(or db-null integer) to specify a column that may have NULL values.

- :default

Provides a default value for the field.

- :unique

If this argument is non-nil, the values of the column must be unique.

- :primary-key

When non-nil, the column is a primary key of the table.

- :check

Adds a constraint to this column. The value provided for this argument must
be an S-SQL expression that returns a boolean value. It can refer to other
columns in the table if needed.

- :references

Adds a foreign key constraint to this table. The argument provided must be a
list of the form (target &optional on-delete on-update). When target is a
symbol, it names the table to whose primary key this constraint refers. When
it is a list, its first element is the table, and its second element the
column within that table that the key refers to. on-delete and on-update
can be used to specify the actions that must be taken when the row that this
key refers to is deleted or changed. Allowed values are :restrict, :set-null,

- :set-default, :cascade, and :no-action.

*** Table Constraints
    :PROPERTIES:
    :ID:       6ee6a88c-1810-41f9-8cad-2c7d347f9c4a
    :CUSTOM_ID: ea63c829-b727-430c-a00e-49910cfe11dc
    :END:
After the list of columns, zero or more extra options (table constraints) can
be specified. These are lists starting with one of the following keywords:

- :check

Adds a constraint to the table. Takes a single S-SQL expression that produces
a boolean as its argument.

- :primary-key

Specifies a primary key for the table. The arguments to this option are the
names of the columns that this key consists of.

- :unique

Adds a unique constraint to a group of columns. Again, the arguments are a
list of symbols that indicate the relevant columns.

- :foreign-key

Create a foreign key. The arguments should have the form
(columns target &optional on-delete on-update), where columns is a list of
columns that are used by this key, while the rest of the arguments have
the same meaning as they have in the :references option for columns.
Every list can start with :constraint name to create a specifically named
constraint.

Note that, unlike most other operators, :create-table expects most of its
arguments to be unquoted symbols. The exception to this is the value
of :check constraints: These must be normal S-SQL expressions, which means
that any column names they contain should be quoted. When programmatically
generating table definitions, sql-compile is usually more practical than
the sql macro.

Here is an example of a :create-table form:
#+BEGIN_SRC lisp
(:create-table enemy
  ((name :type string :primary-key t)
   (age :type integer)
   (address :type (or db-null string) :references (important-addresses :cascade :cascade))
   (fatal-weakness :type text :default "None")
   (identifying-color :type (string 20) :unique t))
  (:foreign-key (identifying-color) (colors name))
  (:constraint enemy-age-check :check (:> 'age 12)))
#+END_SRC
For more detail and examples on building tables
using the s-sql approach, see [[file:create-tables.html][create-tables.html]]

** sql-op :alter-table (name action &rest args)
   :PROPERTIES:
   :ID:       936e7ced-7f31-4c94-9d39-81b11e2cd1cd
   :CUSTOM_ID: d97682ed-4e3f-4a3d-b870-fb6692081361
   :END:

Alters named table. Currently changing a column's data type is not supported.
The meaning of args depends on action:

- :add-column

Adds column to table. args should be a column in the same form as for :create-table.
#+BEGIN_SRC lisp
(query (:alter-table "packages" :add-column 'system-data-p :type (or boolean db-null)))
#+END_SRC

- :set-default

Adds or changes a default value for a column
#+BEGIN_SRC lisp
(query (:alter-table 'countries :alter-column 'updated-at :set-default  (:now)))
#+END_SRC

- :drop-column

Drops a column from the table.
#+BEGIN_SRC lisp
(query (:alter-table "test-uniq" :drop-column 'address))
#+END_SRC

- :add-constraint

Adds a named constraint to the table.
#+BEGIN_SRC lisp
(query (:alter-table "test-uniq" :add-constraint silly-key :primary-key 'code 'title))

(query (:alter-table enemy :add-constraint enemy-age-check :check (:> 'age 21)))
#+END_SRC

- :drop-constraint

Drops constraint. First of args should name a constraint to be dropped; second,
optional argument specifies behaviour regarding objects dependent on the
constraint and it may equal :cascade or :restrict.
#+BEGIN_SRC lisp
(query (alter-table enemy :drop-constraint enemy-age-check))
#+END_SRC

- :add

Adds an unnamed constraint to table. args should be a constraint in the same
form as for :create-table. (This is for backwards-compatibility, you should
use named constraints.)

- :rename

Adds the ability to rename a table.

- :rename-column

Adds the ability to rename a column of a table.
#+BEGIN_SRC lisp
(query (:alter-table "test-uniq" :rename-column 'address 'city))
#+END_SRC

