doc/s-sql.html

<div id="outline-container-org39e22d7" class="outline-4">
<h4 id="174224d0-57c7-475c-b916-dc7f68faea29"><a id="org39e22d7"></a><a id="ID-d0a01fab-1489-47dd-8307-30c28351e8af"></a>Column Definition parameters</h4>
<div class="outline-text-4" id="text-174224d0-57c7-475c-b916-dc7f68faea29">
<p>
After the table name a list of column definitions
follows, which are lists that start with a name, followed by one or
more of the following keyword arguments:
</p>

<ul class="org-ul">
<li>:type</li>
</ul>

<p>
This one is required. It specifies the type of the column. Use a type like
(or db-null integer) to specify a column that may have NULL values.
</p>

<ul class="org-ul">
<li>:default</li>
</ul>

<p>
Provides a default value for the field.
</p>

<ul class="org-ul">
<li>:unique</li>
</ul>

<p>
If this argument is non-nil, the values of the column must be unique.
</p>

<ul class="org-ul">
<li>:primary-key</li>
</ul>

<p>
When non-nil, the column is a primary key of the table.
</p>

<ul class="org-ul">
<li>:check</li>
</ul>

<p>
Adds a constraint to this column. The value provided for this argument must
be an S-SQL expression that returns a boolean value. It can refer to other
columns in the table if needed.
</p>

<ul class="org-ul">
<li>:references</li>
</ul>

<p>
Adds a foreign key constraint to this table. The argument provided must be a
list of the form (target &amp;optional on-delete on-update). When target is a
symbol, it names the table to whose primary key this constraint refers. When
it is a list, its first element is the table, and its second element the
column within that table that the key refers to. on-delete and on-update
can be used to specify the actions that must be taken when the row that this
key refers to is deleted or changed. Allowed values are :restrict, :set-null,
</p>

<ul class="org-ul">
<li>:set-default, :cascade, and :no-action.</li>
</ul>
</div>
</div>

<div id="outline-container-org40cc3a9" class="outline-4">
<h4 id="ea63c829-b727-430c-a00e-49910cfe11dc"><a id="org40cc3a9"></a><a id="ID-6ee6a88c-1810-41f9-8cad-2c7d347f9c4a"></a>Table Constraints</h4>
<div class="outline-text-4" id="text-ea63c829-b727-430c-a00e-49910cfe11dc">
<p>
After the list of columns, zero or more extra options (table constraints) can
be specified. These are lists starting with one of the following keywords:
</p>

<ul class="org-ul">
<li>:check</li>
</ul>

<p>
Adds a constraint to the table. Takes a single S-SQL expression that produces
a boolean as its argument.
</p>

<ul class="org-ul">
<li>:primary-key</li>
</ul>

<p>
Specifies a primary key for the table. The arguments to this option are the
names of the columns that this key consists of.
</p>

<ul class="org-ul">
<li>:unique</li>
</ul>

<p>
Adds a unique constraint to a group of columns. Again, the arguments are a
list of symbols that indicate the relevant columns.
</p>

<ul class="org-ul">
<li>:foreign-key</li>
</ul>

<p>
Create a foreign key. The arguments should have the form
(columns target &amp;optional on-delete on-update), where columns is a list of
columns that are used by this key, while the rest of the arguments have
the same meaning as they have in the :references option for columns.
Every list can start with :constraint name to create a specifically named
constraint.
</p>

<p>
Note that, unlike most other operators, :create-table expects most of its
arguments to be unquoted symbols. The exception to this is the value
of :check constraints: These must be normal S-SQL expressions, which means
that any column names they contain should be quoted. When programmatically
generating table definitions, sql-compile is usually more practical than
the sql macro.
</p>

<p>
Here is an example of a :create-table form:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #98fb98; font-weight: bold;">:create-table</span> enemy
  ((name <span style="color: #98fb98; font-weight: bold;">:type</span> string <span style="color: #98fb98; font-weight: bold;">:primary-key</span> t)
   (age <span style="color: #98fb98; font-weight: bold;">:type</span> integer)
   (address <span style="color: #98fb98; font-weight: bold;">:type</span> (or db-null string) <span style="color: #98fb98; font-weight: bold;">:references</span> (important-addresses <span style="color: #98fb98; font-weight: bold;">:cascade</span> <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
   (fatal-weakness <span style="color: #98fb98; font-weight: bold;">:type</span> text <span style="color: #98fb98; font-weight: bold;">:default</span> <span style="color: #cd8162;">"None"</span>)
   (identifying-color <span style="color: #98fb98; font-weight: bold;">:type</span> (string 20) <span style="color: #98fb98; font-weight: bold;">:unique</span> t))
  (<span style="color: #98fb98; font-weight: bold;">:foreign-key</span> (identifying-color) (colors name))
  (<span style="color: #98fb98; font-weight: bold;">:constraint</span> enemy-age-check <span style="color: #98fb98; font-weight: bold;">:check</span> (<span style="color: #98fb98; font-weight: bold;">:&gt;</span> 'age 12)))
</pre>
</div>
<p>
For more detail and examples on building tables
using the s-sql approach, see <a href="create-tables.html">create-tables.html</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org562219a" class="outline-3">
<h3 id="d97682ed-4e3f-4a3d-b870-fb6692081361"><a id="org562219a"></a><a id="ID-936e7ced-7f31-4c94-9d39-81b11e2cd1cd"></a>sql-op :alter-table (name action &amp;rest args)</h3>
<div class="outline-text-3" id="text-d97682ed-4e3f-4a3d-b870-fb6692081361">
<p>
Alters named table. Currently changing a column's data type is not supported.
The meaning of args depends on action:
</p>

<ul class="org-ul">
<li>:add-column</li>
</ul>

<p>
Adds column to table. args should be a column in the same form as for :create-table.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:alter-table</span> <span style="color: #cd8162;">"packages"</span> <span style="color: #98fb98; font-weight: bold;">:add-column</span> 'system-data-p <span style="color: #98fb98; font-weight: bold;">:type</span> (or boolean db-null)))
</pre>
</div>

<ul class="org-ul">
<li>:set-default</li>
</ul>

<p>
Adds or changes a default value for a column
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:alter-table</span> 'countries <span style="color: #98fb98; font-weight: bold;">:alter-column</span> 'updated-at <span style="color: #98fb98; font-weight: bold;">:set-default</span>  (<span style="color: #98fb98; font-weight: bold;">:now</span>)))
</pre>
</div>

<ul class="org-ul">
<li>:drop-column</li>
</ul>

<p>
Drops a column from the table.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:alter-table</span> <span style="color: #cd8162;">"test-uniq"</span> <span style="color: #98fb98; font-weight: bold;">:drop-column</span> 'address))
</pre>
</div>

<ul class="org-ul">
<li>:add-constraint</li>
</ul>

<p>
Adds a named constraint to the table.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:alter-table</span> <span style="color: #cd8162;">"test-uniq"</span> <span style="color: #98fb98; font-weight: bold;">:add-constraint</span> silly-key <span style="color: #98fb98; font-weight: bold;">:primary-key</span> 'code 'title))

(query (<span style="color: #98fb98; font-weight: bold;">:alter-table</span> enemy <span style="color: #98fb98; font-weight: bold;">:add-constraint</span> enemy-age-check <span style="color: #98fb98; font-weight: bold;">:check</span> (<span style="color: #98fb98; font-weight: bold;">:&gt;</span> 'age 21)))
</pre>
</div>

<ul class="org-ul">
<li>:drop-constraint</li>
</ul>

<p>
Drops constraint. First of args should name a constraint to be dropped; second,
optional argument specifies behaviour regarding objects dependent on the
constraint and it may equal :cascade or :restrict.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (alter-table enemy <span style="color: #98fb98; font-weight: bold;">:drop-constraint</span> enemy-age-check))
</pre>
</div>

<ul class="org-ul">
<li>:add</li>
</ul>

<p>
Adds an unnamed constraint to table. args should be a constraint in the same
form as for :create-table. (This is for backwards-compatibility, you should
use named constraints.)
</p>

<ul class="org-ul">
<li>:rename</li>
</ul>

<p>
Adds the ability to rename a table.
</p>

<ul class="org-ul">
<li>:rename-column</li>
</ul>

<p>
Adds the ability to rename a column of a table.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:alter-table</span> <span style="color: #cd8162;">"test-uniq"</span> <span style="color: #98fb98; font-weight: bold;">:rename-column</span> 'address 'city))
</pre>
</div>
</div>
</div>
