doc/s-sql.org
** sql-op :drop-table (name)
   :PROPERTIES:
   :ID:       1f2b170f-09e2-40e6-9956-f3c44b1d2824
   :CUSTOM_ID: 0b9e0a1e-91c7-4b25-b675-bdf1e8212739
   :END:

Drops the named table. You may optionally pass :if-exists before the name
to suppress the error message if the table does not exist. You can also
optionally pass :cascade after the name to indicate that it should also
drop any other tables, indices, etc which depend on that table.
Accepts strings, variable or symbol as the identifier.
#+BEGIN_SRC lisp
(query (:drop-table 'table1))
(query (:drop-table :if-exists 'table1))
(query (:drop-table :if-exists 'table1 :cascade))
(query (:drop-table (:if-exists 'table1-with-longer-name) :cascade))
(let ((table-var1 "table1"))
    (is (equal (sql (:drop-table :if-exists table-var1 :cascade))
               "DROP TABLE IF EXISTS table1 CASCADE"))
(let ((table-var1 'table-1))
    (is (equal (sql (:drop-table :if-exists table-var1 :cascade))
               "DROP TABLE IF EXISTS table_1 CASCADE"))
#+END_SRC

** sql-op :truncate (&rest args)
   SCHEDULED: <2018-09-06 Thu>
   :PROPERTIES:
   :ID:       f17b0128-f74e-4e79-90e4-d7cc97848c46
   :CUSTOM_ID: ddfde1f9-1c0c-422e-bdc5-a1ca6103de52
   :END:

Truncates one or more tables, deleting all the rows. Optional keyword arguments are
allowed in the following order. Note that :continue-identity and :restart-identity
make no sense if both are included.

- :only (if not specified, the table and its descendants are truncated).
- :continue-identity (the values of sequences will not be changed. This is the default)
- :restart-identity (the values of sequences owned by the table(s) will be restarted)
- :cascade (will cascade the truncation through tables using foreign keys.)

Example calls would be:
#+BEGIN_SRC lisp
(query (:truncate 'bigtable 'fattable))

(query (:truncate 'bigtable 'fattable :only))

(query (:truncate 'bigtable 'fattable :only :continue-identity))

(query (:truncate 'bigtable 'fattable :restart-identity))

(query (:truncate 'bigtable 'fattable :only :restart-identity :cascade ))

#+END_SRC

** sql-op :create-index (name &rest args)
   :PROPERTIES:
   :ID:       c06560b4-5dfb-4657-aa1f-dc3913fa08fc
   :CUSTOM_ID: 820631e5-f822-44f1-b41f-40db1ef9451f
   :END:

Create an index on a table. After the name of the index the keyword :on should
follow, with the table name after it. Then the keyword :fields, followed by
one or more column names. Optionally, a :where clause with a condition can
be added at the end to make a partial index.

#+BEGIN_SRC lisp
(sql (:create-index 'gin-idx :on "historical-events" :using gin :fields 'data))

"CREATE INDEX gin_idx ON historical_events USING GIN (data)"
#+END_SRC


** sql-op :create-unique-index (name &rest args)
   :PROPERTIES:
   :ID:       b2f3a924-58c4-4c4e-9b08-603bb8f5bef3
   :CUSTOM_ID: 2fdeaea2-c6a6-4a6d-a768-d061cd933490
   :END:

Works like :create-index, except that the index created is unique.

** sql-op :drop-index (name)
   :PROPERTIES:
   :ID:       e2c1e460-4d7b-449e-9b24-daa807f115b4
   :CUSTOM_ID: 21b16924-6cdc-4cca-8a47-b6fd53f73971
   :END:

Drop an index. Takes :if-exists and/or :cascade arguments like :drop-table.
Accepts strings, variable or symbol as the identifier.
#+BEGIN_SRC lisp
(query (:drop-index 'index1))
(query (:drop-index :if-exists 'index1))
(query (:drop-index :if-exists 'index1 :cascade))
(let ((table-var1 "table1"))
    (is (equal (sql (:drop-index :if-exists table-var1 :cascade))
               "DROP INDEX IF EXISTS table1 CASCADE"))
#+END_SRC

** sql-op :create-sequence (name &key increment min-value max-value start cache cycle)
   :PROPERTIES:
   :ID:       6dad55a4-a0d4-4d94-923e-e34dd21417a0
   :CUSTOM_ID: 90cbcc2e-8e6b-424d-9043-030371ec2197
   :END:

Create a sequence with the given name. The rest of the arguments control
the way the sequence selects values.

** sql-op :alter-sequence (name)
   :PROPERTIES:
   :ID:       16b308a1-ae6c-4cac-816d-1e29b28ce0b9
   :CUSTOM_ID: 48bf8f29-c2c0-4562-800d-18aa7c003017
   :END:

Alters a sequence. See [[https://www.postgresql.org/docs/10/static/sql-altersequence.html][Postgresql documentation]] for parameters.

- :increment

Sets the amount by which each subsequent increment will be increased.

- :min-value

- :max-value

- :no-min

- :no-max

- :start

- :restart

- :cache

- :cycle

- :no-cycle

- :owned-by

- :if-exists before the name to suppress the error message.

** sql-op :drop-sequence (name)
   :PROPERTIES:
   :ID:       913c35f8-c6ba-42e3-a862-a46e313985ba
   :CUSTOM_ID: 6d221b47-131a-462b-922f-4cfe2ab6a425
   :END:

Drop a sequence. Takes :if-exists and/or :cascade arguments like :drop-table.
Accepts strings, variable or symbol as the identifier.
#+BEGIN_SRC lisp
(query (:drop-sequence 'sequence1))
(query (:drop-sequence :if-exists 'sequence1))
(query (:drop-sequence :if-exists 'sequence1 :cascade))
#+END_SRC

** sql-op :create-view (name query)
   :PROPERTIES:
   :ID:       b5152a93-fc83-4e28-8678-2238987280ac
   :CUSTOM_ID: e3bc3389-958d-4b34-bfb4-c7b73cd2c2ec
   :END:

Create a view from an S-SQL-style query.

** sql-op :drop-view (name)
   :PROPERTIES:
   :ID:       41ae2fb3-1d14-40a7-9cb3-eb194f90a692
   :CUSTOM_ID: b70d0d77-4dfb-4172-ac99-812a19bb5e88
   :END:

Drop a view. Takes optional :if-exists argument.
Accepts strings, variable or symbol as the identifier.
