doc/s-sql.html

<div id="outline-container-org2911f95" class="outline-3">
<h3 id="0b9e0a1e-91c7-4b25-b675-bdf1e8212739"><a id="org2911f95"></a><a id="ID-1f2b170f-09e2-40e6-9956-f3c44b1d2824"></a>sql-op :drop-table (name)</h3>
<div class="outline-text-3" id="text-0b9e0a1e-91c7-4b25-b675-bdf1e8212739">
<p>
Drops the named table. You may optionally pass :if-exists before the name
to suppress the error message if the table does not exist. You can also
optionally pass :cascade after the name to indicate that it should also
drop any other tables, indices, etc which depend on that table.
Accepts strings, variable or symbol as the identifier.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:drop-table</span> 'table1))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-table</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'table1))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-table</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'table1 <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-table</span> (<span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'table1-with-longer-name) <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
(<span style="color: #00ffff;">let</span> ((table-var1 <span style="color: #cd8162;">"table1"</span>))
    (is (equal (sql (<span style="color: #98fb98; font-weight: bold;">:drop-table</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> table-var1 <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
               <span style="color: #cd8162;">"DROP TABLE IF EXISTS table1 CASCADE"</span>))
(<span style="color: #00ffff;">let</span> ((table-var1 'table-1))
    (is (equal (sql (<span style="color: #98fb98; font-weight: bold;">:drop-table</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> table-var1 <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
               <span style="color: #cd8162;">"DROP TABLE IF EXISTS table_1 CASCADE"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbac70d2" class="outline-3">
<h3 id="ddfde1f9-1c0c-422e-bdc5-a1ca6103de52"><a id="orgbac70d2"></a><a id="ID-f17b0128-f74e-4e79-90e4-d7cc97848c46"></a>sql-op :truncate (&amp;rest args)</h3>
<div class="outline-text-3" id="text-ddfde1f9-1c0c-422e-bdc5-a1ca6103de52">
<p>
Truncates one or more tables, deleting all the rows. Optional keyword arguments are
allowed in the following order. Note that :continue-identity and :restart-identity
make no sense if both are included.
</p>

<ul class="org-ul">
<li>:only (if not specified, the table and its descendants are truncated).</li>
<li>:continue-identity (the values of sequences will not be changed. This is the default)</li>
<li>:restart-identity (the values of sequences owned by the table(s) will be restarted)</li>
<li>:cascade (will cascade the truncation through tables using foreign keys.)</li>
</ul>

<p>
Example calls would be:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:truncate</span> 'bigtable 'fattable))

(query (<span style="color: #98fb98; font-weight: bold;">:truncate</span> 'bigtable 'fattable <span style="color: #98fb98; font-weight: bold;">:only</span>))

(query (<span style="color: #98fb98; font-weight: bold;">:truncate</span> 'bigtable 'fattable <span style="color: #98fb98; font-weight: bold;">:only</span> <span style="color: #98fb98; font-weight: bold;">:continue-identity</span>))

(query (<span style="color: #98fb98; font-weight: bold;">:truncate</span> 'bigtable 'fattable <span style="color: #98fb98; font-weight: bold;">:restart-identity</span>))

(query (<span style="color: #98fb98; font-weight: bold;">:truncate</span> 'bigtable 'fattable <span style="color: #98fb98; font-weight: bold;">:only</span> <span style="color: #98fb98; font-weight: bold;">:restart-identity</span> <span style="color: #98fb98; font-weight: bold;">:cascade</span> ))

</pre>
</div>
</div>
</div>

<div id="outline-container-org59fd183" class="outline-3">
<h3 id="820631e5-f822-44f1-b41f-40db1ef9451f"><a id="org59fd183"></a><a id="ID-c06560b4-5dfb-4657-aa1f-dc3913fa08fc"></a>sql-op :create-index (name &amp;rest args)</h3>
<div class="outline-text-3" id="text-820631e5-f822-44f1-b41f-40db1ef9451f">
<p>
Create an index on a table. After the name of the index the keyword :on should
follow, with the table name after it. Then the keyword :fields, followed by
one or more column names. Optionally, a :where clause with a condition can
be added at the end to make a partial index.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(sql (<span style="color: #98fb98; font-weight: bold;">:create-index</span> 'gin-idx <span style="color: #98fb98; font-weight: bold;">:on</span> <span style="color: #cd8162;">"historical-events"</span> <span style="color: #98fb98; font-weight: bold;">:using</span> gin <span style="color: #98fb98; font-weight: bold;">:fields</span> 'data))

<span style="color: #cd8162;">"CREATE INDEX gin_idx ON historical_events USING GIN (data)"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcd06050" class="outline-3">
<h3 id="2fdeaea2-c6a6-4a6d-a768-d061cd933490"><a id="orgcd06050"></a><a id="ID-b2f3a924-58c4-4c4e-9b08-603bb8f5bef3"></a>sql-op :create-unique-index (name &amp;rest args)</h3>
<div class="outline-text-3" id="text-2fdeaea2-c6a6-4a6d-a768-d061cd933490">
<p>
Works like :create-index, except that the index created is unique.
</p>
</div>
</div>

<div id="outline-container-orge60aef8" class="outline-3">
<h3 id="21b16924-6cdc-4cca-8a47-b6fd53f73971"><a id="orge60aef8"></a><a id="ID-e2c1e460-4d7b-449e-9b24-daa807f115b4"></a>sql-op :drop-index (name)</h3>
<div class="outline-text-3" id="text-21b16924-6cdc-4cca-8a47-b6fd53f73971">
<p>
Drop an index. Takes :if-exists and/or :cascade arguments like :drop-table.
Accepts strings, variable or symbol as the identifier.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:drop-index</span> 'index1))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-index</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'index1))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-index</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'index1 <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
(<span style="color: #00ffff;">let</span> ((table-var1 <span style="color: #cd8162;">"table1"</span>))
    (is (equal (sql (<span style="color: #98fb98; font-weight: bold;">:drop-index</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> table-var1 <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
               <span style="color: #cd8162;">"DROP INDEX IF EXISTS table1 CASCADE"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd0ccdc" class="outline-3">
<h3 id="90cbcc2e-8e6b-424d-9043-030371ec2197"><a id="orgbd0ccdc"></a><a id="ID-6dad55a4-a0d4-4d94-923e-e34dd21417a0"></a>sql-op :create-sequence (name &amp;key increment min-value max-value start cache cycle)</h3>
<div class="outline-text-3" id="text-90cbcc2e-8e6b-424d-9043-030371ec2197">
<p>
Create a sequence with the given name. The rest of the arguments control
the way the sequence selects values.
</p>
</div>
</div>

<div id="outline-container-org123d9c3" class="outline-3">
<h3 id="48bf8f29-c2c0-4562-800d-18aa7c003017"><a id="org123d9c3"></a><a id="ID-16b308a1-ae6c-4cac-816d-1e29b28ce0b9"></a>sql-op :alter-sequence (name)</h3>
<div class="outline-text-3" id="text-48bf8f29-c2c0-4562-800d-18aa7c003017">
<p>
Alters a sequence. See <a href="https://www.postgresql.org/docs/10/static/sql-altersequence.html">Postgresql documentation</a> for parameters.
</p>

<ul class="org-ul">
<li>:increment</li>
</ul>

<p>
Sets the amount by which each subsequent increment will be increased.
</p>

<ul class="org-ul">
<li>:min-value</li>

<li>:max-value</li>

<li>:no-min</li>

<li>:no-max</li>

<li>:start</li>

<li>:restart</li>

<li>:cache</li>

<li>:cycle</li>

<li>:no-cycle</li>

<li>:owned-by</li>

<li>:if-exists before the name to suppress the error message.</li>
</ul>
</div>
</div>

<div id="outline-container-org468a6af" class="outline-3">
<h3 id="6d221b47-131a-462b-922f-4cfe2ab6a425"><a id="org468a6af"></a><a id="ID-913c35f8-c6ba-42e3-a862-a46e313985ba"></a>sql-op :drop-sequence (name)</h3>
<div class="outline-text-3" id="text-6d221b47-131a-462b-922f-4cfe2ab6a425">
<p>
Drop a sequence. Takes :if-exists and/or :cascade arguments like :drop-table.
Accepts strings, variable or symbol as the identifier.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:drop-sequence</span> 'sequence1))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-sequence</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'sequence1))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-sequence</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'sequence1 <span style="color: #98fb98; font-weight: bold;">:cascade</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org33fa54a" class="outline-3">
<h3 id="e3bc3389-958d-4b34-bfb4-c7b73cd2c2ec"><a id="org33fa54a"></a><a id="ID-b5152a93-fc83-4e28-8678-2238987280ac"></a>sql-op :create-view (name query)</h3>
<div class="outline-text-3" id="text-e3bc3389-958d-4b34-bfb4-c7b73cd2c2ec">
<p>
Create a view from an S-SQL-style query.
</p>
</div>
</div>

<div id="outline-container-orgc2282ad" class="outline-3">
<h3 id="b70d0d77-4dfb-4172-ac99-812a19bb5e88"><a id="orgc2282ad"></a><a id="ID-41ae2fb3-1d14-40a7-9cb3-eb194f90a692"></a>sql-op :drop-view (name)</h3>
<div class="outline-text-3" id="text-b70d0d77-4dfb-4172-ac99-812a19bb5e88">
<p>
Drop a view. Takes optional :if-exists argument.
Accepts strings, variable or symbol as the identifier.
</p>
</div>
</div>
