doc/s-sql.org
** sql-op :set-constraints (state &rest constraints)
   :PROPERTIES:
   :ID:       4e0e615b-cdb2-4576-a46d-20c25daf414a
   :CUSTOM_ID: 7f6ae03c-565e-4d32-b1b0-ab0cd211c761
   :END:

Configure whether deferrable constraints should be checked when a statement
is executed, or when the transaction containing that statement is completed.
The provided state must be either :immediate, indicating the former,
or :deferred, indicating the latter. The constraints must be either the
names of the constraints to be configured, or unspecified, indicating that
all deferrable constraints should be thus configured.

** sql-op :listen (channel)
   :PROPERTIES:
   :ID:       254e8288-3515-4a51-8704-ea17c35f2c9b
   :CUSTOM_ID: 9839c248-5e7b-44a6-9a8d-35771e612a6f
   :END:

Tell the server to listen for notification events on channel channel,
a string, on the current connection.

** sql-op :unlisten (channel)
   :PROPERTIES:
   :ID:       8899f2b4-8053-4e49-917f-8716c8ac916b
   :CUSTOM_ID: 1fb4efc1-6942-4186-8ce5-a7547e536002
   :END:

Stop listening for events on channel.

** sql-op :notify (channel &optional payload)
   :PROPERTIES:
   :ID:       88d35022-2839-4ece-9688-c8517363e25a
   :CUSTOM_ID: 1b8e42dd-0967-4620-862d-bb086448a529
   :END:

Signal a notification event on channel channel, a string. The optional
payload string can be used to send additional event information to the listeners.

** sql-op :create-role (role &rest args)
   :PROPERTIES:
   :ID:       e4c5a84e-3a66-4a80-91de-b673beb8376d
   :CUSTOM_ID: ee81a967-06d9-4a0f-9ef4-4b2b9c189451
   :END:

Create a new role (user). Following the role name are optional keywords
arguments:

- :options

One or more of the no-parameter options to PostgreSQL's CREATE ROLE SQL command.

- :password

Sets the role's password. (A password is only of use for roles having the LOGIN
attribute, but you can nonetheless define one for roles without it.) If you do
not plan to use password authentication you can omit this option. If no
password is specified, the password will be set to null and password
authentication will always fail for that user.

- :connection-limit

If role can log in, this specifies how many concurrent connections the role can
make. -1 (the default) means no limit.

- :valid-until

The :valid-until clause sets a date and time after which the role's password
is no longer valid. If this clause is omitted the password will be valid for
all time.

- :role

Lists one or more existing roles which are automatically added as members of
the new role. (This in effect makes the new role a “group”.)

- :in-role

Lists one or more existing roles to which the new role will be immediately
added as a new member.

Here is an example of a :create-role form:
#+BEGIN_SRC lisp
(query (:create-role 'user23
                     :options 'SUPERUSER 'NOINHERIT 'LOGIN
                     :password "mypassword"
                     :connection-limit 100 :role 'users))
#+END_SRC

** sql-op :create-database (name)
   :PROPERTIES:
   :ID:       6d429954-eb91-4a94-8655-f1e1a75f02c8
   :CUSTOM_ID: 48025ade-9d59-4daa-9809-b00e5881e835
   :END:

Create a new database with the given name.

** sql-op :drop-database (name)
   :PROPERTIES:
   :ID:       35ecfdd0-7ba1-45cc-a73d-68323c880c29
   :CUSTOM_ID: 93698127-77f1-440a-b965-3ad0488e4a34
   :END:

Drops the named database. You may optionally pass :if-exists before the
name to suppress the error message. Examples:
#+BEGIN_SRC lisp
(query (:drop-database 'database-name))
(query (:drop-database :if-exists 'database-name))
(let ((var 'my-database)) (query (:drop-database var)))
#+END_SRC

** sql-op :copy (table &rest args)
   :PROPERTIES:
   :ID:       962e6b5e-8ce6-4083-a17e-010679d12b32
   :CUSTOM_ID: 8066cf54-c225-4766-8e29-df775a95accb
   :END:

Move data between Postgres tables and filesystem files. Table name is required
followed by one or more of the following keyword arguments. Documentation for
the copy command provides a full reference. An example from the Greenplum
tutorial:
#+BEGIN_SRC lisp
(query
   (:copy 'faa.d_airlines
    :columns 'airlineid 'airline_desc
  	:from "/home/gpadmin/gpdb-sandbox-tutorials/faa/L_AIRLINE_ID.csv"
  	:on-segment t
  	:binary t
  	:oids t
	  :header t
  	:delimiter ","
	  :null "NULL"
  	:escape "my-escape-string"
  	:newline "CR"
	  :csv t
  	:log-errors t
	  :segment-reject-limit 100 'ROWS))

#+END_SRC
* Dynamic Queries, Composition and Parameterized Queries
  :PROPERTIES:
  :CUSTOM_ID: dynamic-queries-composition-and-parameterized-queries
  :ID:       d621dc4b-5ae1-408a-be3c-c553dcd5d9a6
  :END:

** Overview
   :PROPERTIES:
   :CUSTOM_ID: overview
   :ID:       56999390-1d72-4ae1-bea6-1f3a5eeb08f7
   :END:

The question gets asked how to build dynamic or composable queries in
postmodern. First we need to understand the context - is the programmer
building the query or are you taking data from a user and using that to
build a query?

