doc/s-sql.html
<div id="outline-container-org829b526" class="outline-3">
<h3 id="7f6ae03c-565e-4d32-b1b0-ab0cd211c761"><a id="org829b526"></a><a id="ID-4e0e615b-cdb2-4576-a46d-20c25daf414a"></a>sql-op :set-constraints (state &amp;rest constraints)</h3>
<div class="outline-text-3" id="text-7f6ae03c-565e-4d32-b1b0-ab0cd211c761">
<p>
Configure whether deferrable constraints should be checked when a statement
is executed, or when the transaction containing that statement is completed.
The provided state must be either :immediate, indicating the former,
or :deferred, indicating the latter. The constraints must be either the
names of the constraints to be configured, or unspecified, indicating that
all deferrable constraints should be thus configured.
</p>
</div>
</div>

<div id="outline-container-orgc4bac3c" class="outline-3">
<h3 id="9839c248-5e7b-44a6-9a8d-35771e612a6f"><a id="orgc4bac3c"></a><a id="ID-254e8288-3515-4a51-8704-ea17c35f2c9b"></a>sql-op :listen (channel)</h3>
<div class="outline-text-3" id="text-9839c248-5e7b-44a6-9a8d-35771e612a6f">
<p>
Tell the server to listen for notification events on channel channel,
a string, on the current connection.
</p>
</div>
</div>

<div id="outline-container-org4d24f0c" class="outline-3">
<h3 id="1fb4efc1-6942-4186-8ce5-a7547e536002"><a id="org4d24f0c"></a><a id="ID-8899f2b4-8053-4e49-917f-8716c8ac916b"></a>sql-op :unlisten (channel)</h3>
<div class="outline-text-3" id="text-1fb4efc1-6942-4186-8ce5-a7547e536002">
<p>
Stop listening for events on channel.
</p>
</div>
</div>

<div id="outline-container-orgbabfd2e" class="outline-3">
<h3 id="1b8e42dd-0967-4620-862d-bb086448a529"><a id="orgbabfd2e"></a><a id="ID-88d35022-2839-4ece-9688-c8517363e25a"></a>sql-op :notify (channel &amp;optional payload)</h3>
<div class="outline-text-3" id="text-1b8e42dd-0967-4620-862d-bb086448a529">
<p>
Signal a notification event on channel channel, a string. The optional
payload string can be used to send additional event information to the listeners.
</p>
</div>
</div>

<div id="outline-container-org1ee83aa" class="outline-3">
<h3 id="ee81a967-06d9-4a0f-9ef4-4b2b9c189451"><a id="org1ee83aa"></a><a id="ID-e4c5a84e-3a66-4a80-91de-b673beb8376d"></a>sql-op :create-role (role &amp;rest args)</h3>
<div class="outline-text-3" id="text-ee81a967-06d9-4a0f-9ef4-4b2b9c189451">
<p>
Create a new role (user). Following the role name are optional keywords
arguments:
</p>

<ul class="org-ul">
<li>:options</li>
</ul>

<p>
One or more of the no-parameter options to PostgreSQL's CREATE ROLE SQL command.
</p>

<ul class="org-ul">
<li>:password</li>
</ul>

<p>
Sets the role's password. (A password is only of use for roles having the LOGIN
attribute, but you can nonetheless define one for roles without it.) If you do
not plan to use password authentication you can omit this option. If no
password is specified, the password will be set to null and password
authentication will always fail for that user.
</p>

<ul class="org-ul">
<li>:connection-limit</li>
</ul>

<p>
If role can log in, this specifies how many concurrent connections the role can
make. -1 (the default) means no limit.
</p>

<ul class="org-ul">
<li>:valid-until</li>
</ul>

<p>
The :valid-until clause sets a date and time after which the role's password
is no longer valid. If this clause is omitted the password will be valid for
all time.
</p>

<ul class="org-ul">
<li>:role</li>
</ul>

<p>
Lists one or more existing roles which are automatically added as members of
the new role. (This in effect makes the new role a “group”.)
</p>

<ul class="org-ul">
<li>:in-role</li>
</ul>

<p>
Lists one or more existing roles to which the new role will be immediately
added as a new member.
</p>

<p>
Here is an example of a :create-role form:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:create-role</span> 'user23
                     <span style="color: #98fb98; font-weight: bold;">:options</span> 'SUPERUSER 'NOINHERIT 'LOGIN
                     <span style="color: #98fb98; font-weight: bold;">:password</span> <span style="color: #cd8162;">"mypassword"</span>
                     <span style="color: #98fb98; font-weight: bold;">:connection-limit</span> 100 <span style="color: #98fb98; font-weight: bold;">:role</span> 'users))
</pre>
</div>
</div>
</div>

<div id="outline-container-org270472f" class="outline-3">
<h3 id="48025ade-9d59-4daa-9809-b00e5881e835"><a id="org270472f"></a><a id="ID-6d429954-eb91-4a94-8655-f1e1a75f02c8"></a>sql-op :create-database (name)</h3>
<div class="outline-text-3" id="text-48025ade-9d59-4daa-9809-b00e5881e835">
<p>
Create a new database with the given name.
</p>
</div>
</div>

<div id="outline-container-org2bffb03" class="outline-3">
<h3 id="93698127-77f1-440a-b965-3ad0488e4a34"><a id="org2bffb03"></a><a id="ID-35ecfdd0-7ba1-45cc-a73d-68323c880c29"></a>sql-op :drop-database (name)</h3>
<div class="outline-text-3" id="text-93698127-77f1-440a-b965-3ad0488e4a34">
<p>
Drops the named database. You may optionally pass :if-exists before the
name to suppress the error message. Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:drop-database</span> 'database-name))
(query (<span style="color: #98fb98; font-weight: bold;">:drop-database</span> <span style="color: #98fb98; font-weight: bold;">:if-exists</span> 'database-name))
(<span style="color: #00ffff;">let</span> ((var 'my-database)) (query (<span style="color: #98fb98; font-weight: bold;">:drop-database</span> var)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd9022e" class="outline-3">
<h3 id="8066cf54-c225-4766-8e29-df775a95accb"><a id="orgbd9022e"></a><a id="ID-962e6b5e-8ce6-4083-a17e-010679d12b32"></a>sql-op :copy (table &amp;rest args)</h3>
<div class="outline-text-3" id="text-8066cf54-c225-4766-8e29-df775a95accb">
<p>
Move data between Postgres tables and filesystem files. Table name is required
followed by one or more of the following keyword arguments. Documentation for
the copy command provides a full reference. An example from the Greenplum
tutorial:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
   (<span style="color: #98fb98; font-weight: bold;">:copy</span> 'faa.d_airlines
    <span style="color: #98fb98; font-weight: bold;">:columns</span> 'airlineid 'airline_desc
    <span style="color: #98fb98; font-weight: bold;">:from</span> <span style="color: #cd8162;">"/home/gpadmin/gpdb-sandbox-tutorials/faa/L_AIRLINE_ID.csv"</span>
    <span style="color: #98fb98; font-weight: bold;">:on-segment</span> t
    <span style="color: #98fb98; font-weight: bold;">:binary</span> t
    <span style="color: #98fb98; font-weight: bold;">:oids</span> t
    <span style="color: #98fb98; font-weight: bold;">:header</span> t
    <span style="color: #98fb98; font-weight: bold;">:delimiter</span> <span style="color: #cd8162;">","</span>
    <span style="color: #98fb98; font-weight: bold;">:null</span> <span style="color: #cd8162;">"NULL"</span>
    <span style="color: #98fb98; font-weight: bold;">:escape</span> <span style="color: #cd8162;">"my-escape-string"</span>
    <span style="color: #98fb98; font-weight: bold;">:newline</span> <span style="color: #cd8162;">"CR"</span>
    <span style="color: #98fb98; font-weight: bold;">:csv</span> t
    <span style="color: #98fb98; font-weight: bold;">:log-errors</span> t
    <span style="color: #98fb98; font-weight: bold;">:segment-reject-limit</span> 100 'ROWS))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5626e6f" class="outline-2">
<h2 id="dynamic-queries-composition-and-parameterized-queries"><a id="org5626e6f"></a><a id="ID-d621dc4b-5ae1-408a-be3c-c553dcd5d9a6"></a>Dynamic Queries, Composition and Parameterized Queries</h2>
<div class="outline-text-2" id="text-dynamic-queries-composition-and-parameterized-queries">
</div>
