doc/s-sql.html

<div id="outline-container-org433ed5b" class="outline-3">
<h3 id="overview"><a id="org433ed5b"></a><a id="ID-56999390-1d72-4ae1-bea6-1f3a5eeb08f7"></a>Overview</h3>
<div class="outline-text-3" id="text-overview">
<p>
The question gets asked how to build dynamic or composable queries in
postmodern. First we need to understand the context - is the programmer
building the query or are you taking data from a user and using that to
build a query?
</p>
</div>

<div id="outline-container-org21a2c5c" class="outline-4">
<h4 id="programmer-built-queries"><a id="org21a2c5c"></a><a id="ID-17b9050a-026f-4552-93b3-e08cb9ba5851"></a>Programmer Built Queries</h4>
<div class="outline-text-4" id="text-programmer-built-queries">
<p>
The question gets asked how to build dynamic or composable queries in
postmodern. First we need to understand the context - is the programmer
building the query or are you taking data from a user and using that to
build a query? We need to remember that the query macro assumes that everything
that is not a list starting with a keyword will evaluate to a string.
</p>

<p>
In any case you will need to ensure that either you have control over the inputs
or they still result in parameterized queries. If not you have opened yourself up
to an sql injection attack.
</p>

<p>
If you are not using s-sql, then it becomes easy. The query macro
assumes that everything that is not a list starting with a keyword will
evaluate to a string. That means you can build it with a simple format
string
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (format nil <span style="color: #cd8162;">"select ~a from ~a where ~a"</span>  <span style="color: #cd8162;">"carrots"</span> <span style="color: #cd8162;">"garden"</span> <span style="color: #cd8162;">"length &gt; 3"</span>))
</pre>
</div>

<p>
With s-sql, there are generally three approaches to building dynamic or
composible queries: pass symbols and values as variables,  use sql-compile
or use :raw.
</p>

<p>
For purposes of this example, we will use the following employee table:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:create-table</span> employee ((id <span style="color: #98fb98; font-weight: bold;">:type</span> int)
                                (name <span style="color: #98fb98; font-weight: bold;">:type</span> text)
                                (salary <span style="color: #98fb98; font-weight: bold;">:type</span> numeric)
                                (start_date <span style="color: #98fb98; font-weight: bold;">:type</span> date)
                                (city <span style="color: #98fb98; font-weight: bold;">:type</span> text)
                                (region <span style="color: #98fb98; font-weight: bold;">:type</span> char)
                                (age <span style="color: #98fb98; font-weight: bold;">:type</span> int))))

(query (<span style="color: #98fb98; font-weight: bold;">:insert-rows-into</span> 'employee
                          <span style="color: #98fb98; font-weight: bold;">:columns</span> 'id 'name 'salary 'start-date 'city 'region 'age
                          <span style="color: #98fb98; font-weight: bold;">:values</span> '((1 <span style="color: #cd8162;">"Jason"</span> 40420 <span style="color: #cd8162;">"02/01/94"</span> <span style="color: #cd8162;">"New York"</span> <span style="color: #cd8162;">"W"</span> 29)
                                    (2 <span style="color: #cd8162;">"Robert"</span> 14420 <span style="color: #cd8162;">"01/02/95"</span> <span style="color: #cd8162;">"Vancouver"</span> <span style="color: #cd8162;">"N"</span> 21)
                                    (3 <span style="color: #cd8162;">"Celia"</span> 24020 <span style="color: #cd8162;">"12/03/96"</span> <span style="color: #cd8162;">"Toronto"</span> <span style="color: #cd8162;">"W"</span> 24)
                                    (4 <span style="color: #cd8162;">"Linda"</span> 40620 <span style="color: #cd8162;">"11/04/97"</span> <span style="color: #cd8162;">"New York"</span> <span style="color: #cd8162;">"N"</span> 28)
                                    (5 <span style="color: #cd8162;">"David"</span> 80026 <span style="color: #cd8162;">"10/05/98"</span> <span style="color: #cd8162;">"Vancouver"</span> <span style="color: #cd8162;">"W"</span> 31)
                                    (6 <span style="color: #cd8162;">"James"</span> 70060 <span style="color: #cd8162;">"09/06/99"</span> <span style="color: #cd8162;">"Toronto"</span> <span style="color: #cd8162;">"N"</span> 26)
                                    (7 <span style="color: #cd8162;">"Alison"</span> 90620 <span style="color: #cd8162;">"08/07/00"</span> <span style="color: #cd8162;">"New York"</span> <span style="color: #cd8162;">"W"</span> 38)
                                    (8 <span style="color: #cd8162;">"Chris"</span> 26020 <span style="color: #cd8162;">"07/08/01"</span> <span style="color: #cd8162;">"Vancouver"</span> <span style="color: #cd8162;">"N"</span> 22)
                                    (9 <span style="color: #cd8162;">"Mary"</span> 60020 <span style="color: #cd8162;">"06/08/02"</span> <span style="color: #cd8162;">"Toronto"</span> <span style="color: #cd8162;">"W"</span> 34))))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="symbols-in-variables"></a><a id="org24d4142"></a><a id="ID-13c9d0df-7b08-4788-bca9-be650e42809a"></a>Approach #1 Using symbols in variables<br>
<div class="outline-text-5" id="text-symbols-in-variables">
</div>
<ul class="org-ul">
<li><a id="org7ab2cd3"></a>Select Statements<br>
<div class="outline-text-6" id="text-org7ab2cd3">
<p>
Consider the following two toy examples where we determine the table and columns
to be selected using symbols (either keyword or quoted) inside variables.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((table 'employee) (col1 <span style="color: #98fb98; font-weight: bold;">:id</span>) (col2 <span style="color: #98fb98; font-weight: bold;">:name</span>) (id 3))
    (query (<span style="color: #98fb98; font-weight: bold;">:select</span> col1 col2 <span style="color: #98fb98; font-weight: bold;">:from</span> table <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id '$1)) id))
((3 <span style="color: #cd8162;">"Celia"</span>))

(<span style="color: #00ffff;">let</span> ((table 'employee) (col1 'name) (col2 'salary) (id 3))
    (query (<span style="color: #98fb98; font-weight: bold;">:select</span> col1 col2 <span style="color: #98fb98; font-weight: bold;">:from</span> table <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id '$1)) id))
((<span style="color: #cd8162;">"Celia"</span> 24020))
</pre>
</div>
<p>
This will not work if you use strings instead of symbols because sql-expand
will wrap the strings in the variables in escape format as if they were string
constants and Postgresql will throw an error because it is not expecting
string constants in the middle of a select statement.
</p>
</div>
</li>

<li><a id="orgae53c0d"></a>Update Statements<br>
<div class="outline-text-6" id="text-orgae53c0d">
<p>
This works with update statements as well
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((table 'employee) (col1 <span style="color: #98fb98; font-weight: bold;">:id</span>) (col2 <span style="color: #98fb98; font-weight: bold;">:name</span>) (new-name <span style="color: #cd8162;">"Celeste"</span>) (id 3))
    (query (<span style="color: #98fb98; font-weight: bold;">:update</span> table <span style="color: #98fb98; font-weight: bold;">:set</span> col2 new-name <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> col1 '$1)) id)
    (query (<span style="color: #98fb98; font-weight: bold;">:select</span> col1 col2 <span style="color: #98fb98; font-weight: bold;">:from</span> table <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id '$1)) id))
((3 <span style="color: #cd8162;">"Celeste"</span>))
</pre>
</div>
</div>
</li>
<li><a id="orge32eca4"></a>Insert Statements<br>
<div class="outline-text-6" id="text-orge32eca4">
<p>
This works with insert-into statements as well
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((table 'employee) (col1 'id) (col2 'name) (new-name <span style="color: #cd8162;">"Rochelle"</span>)
      (id 10) (col3 'salary) (col3-value 3452) (col4 'start-date)
      (col4-value <span style="color: #cd8162;">"02/01/03"</span>) (col5 'city) (col5-value <span style="color: #cd8162;">"Victoria"</span>)
      (col6 'region) (col6-value <span style="color: #cd8162;">"N"</span>) (col7 'age) (col7-value 32))
  (query (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> table <span style="color: #98fb98; font-weight: bold;">:set</span> col1 id col2 new-name col3 col3-value
                       col4 col4-value col5 col5-value col6 col6-value
                       col7 col7-value)))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> 'id 'name 'salary <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'id 10 )))
((10 <span style="color: #cd8162;">"Rochelle"</span> 3452))
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org701addc"></a>Delete Statements<br>
<div class="outline-text-5" id="text-org701addc">
<p>
This works with delete statements as well
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((table 'employee) (col1 <span style="color: #98fb98; font-weight: bold;">:id</span>) (col1-value 10))
   (query (<span style="color: #98fb98; font-weight: bold;">:delete-from</span> table <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> col1 col1-value))))
</pre>
</div>
</div>
</li>
</ul>
</div>
