doc/s-sql.html
<div id="outline-container-orgbc4452b" class="outline-4">
<h4 id="523172f6-bc0b-4402-aa40-989025e0d12f"><a id="orgbc4452b"></a>Approach #2 Use sql-compile</h4>
<div class="outline-text-4" id="text-523172f6-bc0b-4402-aa40-989025e0d12f">
<p>
Sql-compile does a run-time compilation of an s-sql expression. In the
following example, we create a function that accepts a where-clause, a
table-name, 3 columns to select and two parameters to go into the where
clause.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #63b8ff;">toy-example</span> (where-clause table-name col1 col2 col3 arg1 arg2)
       (<span style="color: #00ffff;">with-test-connection</span>
       (query (sql-compile
                (append `(<span style="color: #98fb98; font-weight: bold;">:select</span> ,col1 ,col2 ,col3 <span style="color: #98fb98; font-weight: bold;">:from</span> ,table-name <span style="color: #98fb98; font-weight: bold;">:where</span>)
                       where-clause))
              arg1 arg2)))

(toy-example '((<span style="color: #98fb98; font-weight: bold;">:and</span> (<span style="color: #98fb98; font-weight: bold;">:=</span> 'city '$1) (<span style="color: #98fb98; font-weight: bold;">:&gt;</span> 'salary '$2))) 'employee 'id 'name 'city <span style="color: #cd8162;">"Toronto"</span> 45000)

((6 <span style="color: #cd8162;">"James"</span> <span style="color: #cd8162;">"Toronto"</span>) (9 <span style="color: #cd8162;">"Mary"</span> <span style="color: #cd8162;">"Toronto"</span>))
</pre>
</div>

<p>
If we just look at what this call to sql-compile in toy-example
generates, it would look like:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #cd8162;">"(SELECT id, name, city FROM employee WHERE ((city = $1) and (salary &gt; $2)))"</span>
</pre>
</div>

<p>
This example is still a parameterized query but for security reasons you
will need to be very careful how you generate the where clause.
</p>

<p>
Another example with sql-compile and append, in this case updating a
table and setting two columns to NULL.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(sql-compile (append '(<span style="color: #98fb98; font-weight: bold;">:update</span> <span style="color: #98fb98; font-weight: bold;">:table1</span> <span style="color: #98fb98; font-weight: bold;">:set</span>)
                      (<span style="color: #00ffff;">loop</span> for a in '(<span style="color: #cd8162;">"col1"</span> <span style="color: #cd8162;">"col2"</span>)
                            collect a
                            collect <span style="color: #98fb98; font-weight: bold;">:NULL</span>)))

 <span style="color: #cd8162;">"UPDATE table1 SET E'col1' = NULL, E'col2' = NULL"</span>
</pre>
</div>

<p>
Lets think about it differently. What if we know the universe of columns
we want to select, but want to conditionally select some of them.
Suppose we know our targetted table has columns:
</p>

<div class="org-src-container">
<pre class="src src-lisp">'id 'name 'salary 'start-date 'city 'region 'age.
</pre>
</div>

<p>
We may decide we always want name, city and age, but salary and
start-date are conditional.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #63b8ff;">toy-example-2</span> (salaryp start-date-p)
  (sql-compile
   (remove nil `(<span style="color: #98fb98; font-weight: bold;">:select</span> 'name 'city 'age
                         ,(<span style="color: #00ffff;">if</span> salaryp 'salary nil)
                         ,(<span style="color: #00ffff;">if</span> start-date-p 'start-date nil)
                         <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee))))

(query (toy-example-2 t t))

((<span style="color: #cd8162;">"Jason"</span> <span style="color: #cd8162;">"New York"</span> 29 40420 #&lt;SIMPLE-DATE:DATE 01-02-1994&gt;)
 (<span style="color: #cd8162;">"Robert"</span> <span style="color: #cd8162;">"Vancouver"</span> 21 14420 #&lt;SIMPLE-DATE:DATE 02-01-1995&gt;)
 (<span style="color: #cd8162;">"Celia"</span> <span style="color: #cd8162;">"Toronto"</span> 24 24020 #&lt;SIMPLE-DATE:DATE 03-12-1996&gt;)
 (<span style="color: #cd8162;">"Linda"</span> <span style="color: #cd8162;">"New York"</span> 28 40620 #&lt;SIMPLE-DATE:DATE 04-11-1997&gt;)
 (<span style="color: #cd8162;">"David"</span> <span style="color: #cd8162;">"Vancouver"</span> 31 80026 #&lt;SIMPLE-DATE:DATE 05-10-1998&gt;)
 (<span style="color: #cd8162;">"James"</span> <span style="color: #cd8162;">"Toronto"</span> 26 70060 #&lt;SIMPLE-DATE:DATE 06-09-1999&gt;)
 (<span style="color: #cd8162;">"Alison"</span> <span style="color: #cd8162;">"New York"</span> 38 90620 #&lt;SIMPLE-DATE:DATE 07-08-2000&gt;)
 (<span style="color: #cd8162;">"Chris"</span> <span style="color: #cd8162;">"Vancouver"</span> 22 26020 #&lt;SIMPLE-DATE:DATE 08-07-2001&gt;)
 (<span style="color: #cd8162;">"Mary"</span> <span style="color: #cd8162;">"Toronto"</span> 34 60020 #&lt;SIMPLE-DATE:DATE 08-06-2002&gt;))

(query (toy-example-2 t nil))

((<span style="color: #cd8162;">"Jason"</span> <span style="color: #cd8162;">"New York"</span> 29 40420) (<span style="color: #cd8162;">"Robert"</span> <span style="color: #cd8162;">"Vancouver"</span> 21 14420)
 (<span style="color: #cd8162;">"Celia"</span> <span style="color: #cd8162;">"Toronto"</span> 24 24020) (<span style="color: #cd8162;">"Linda"</span> <span style="color: #cd8162;">"New York"</span> 28 40620)
 (<span style="color: #cd8162;">"David"</span> <span style="color: #cd8162;">"Vancouver"</span> 31 80026) (<span style="color: #cd8162;">"James"</span> <span style="color: #cd8162;">"Toronto"</span> 26 70060)
 (<span style="color: #cd8162;">"Alison"</span> <span style="color: #cd8162;">"New York"</span> 38 90620) (<span style="color: #cd8162;">"Chris"</span> <span style="color: #cd8162;">"Vancouver"</span> 22 26020)
 (<span style="color: #cd8162;">"Mary"</span> <span style="color: #cd8162;">"Toronto"</span> 34 60020))
</pre>
</div>

<p>
You could skip the (remove nil&#x2026; portion and substitute t for nil. E.g.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #63b8ff;">toy-example-2</span> (salaryp start-date-p)
        (sql-compile
         `(<span style="color: #98fb98; font-weight: bold;">:select</span> 'name 'city 'age
                   ,(<span style="color: #00ffff;">if</span> salaryp 'salary t)
                   ,(<span style="color: #00ffff;">if</span> start-date-p 'start-date t)
                   <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee)))
</pre>
</div>

<p>
But I prefer to remove those segments completely from the query.
</p>

<p>
Following on this same thread of thought, you can define a portion of
the sql in a let clause:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">let</span> ((sql1 '(<span style="color: #98fb98; font-weight: bold;">:=</span> name <span style="color: #cd8162;">"Jason"</span>)))
        (query (sql-compile
          `(<span style="color: #98fb98; font-weight: bold;">:select</span> 'name 'city 'age <span style="color: #98fb98; font-weight: bold;">:from</span> 'employee <span style="color: #98fb98; font-weight: bold;">:where</span> ,sql1))))

      ((<span style="color: #cd8162;">"Jason"</span> <span style="color: #cd8162;">"New York"</span> 29))
</pre>
</div>

<p>
An example of this would be getting more columns depending on the
postgresql server versionr:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #63b8ff;">more-table-info</span> (table-name)
        <span style="color: #cd8162;">"Returns variable amounts of information depending on the postgresql server version"</span>
        (<span style="color: #00ffff;">let*</span> ((version&gt;11 (postgresql-version-at-least <span style="color: #cd8162;">"12.0"</span> *database*))
               (version&gt;10 (postgresql-version-at-least <span style="color: #cd8162;">"11.0"</span> *database*))
               (select-query (sql-compile
                              `(<span style="color: #98fb98; font-weight: bold;">:order-by</span>
                                (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'a.attnum 'ordinal-position)
                                         (<span style="color: #98fb98; font-weight: bold;">:as</span> 'a.attname 'column-name)
                                         (<span style="color: #98fb98; font-weight: bold;">:as</span> 'tn.typname 'data-type)
                                         ,(<span style="color: #00ffff;">if</span> version&gt;10 'a.attidentity t)
                                         ,(<span style="color: #00ffff;">if</span> version&gt;11 'a.attgenerated t)
                                         <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'pg_class 'c)
                                         (<span style="color: #98fb98; font-weight: bold;">:as</span> 'pg_attribute 'a)
                                         (<span style="color: #98fb98; font-weight: bold;">:as</span> 'pg_type 'tn)
                                         <span style="color: #98fb98; font-weight: bold;">:where</span> (<span style="color: #98fb98; font-weight: bold;">:and</span>
                                                 (<span style="color: #98fb98; font-weight: bold;">:=</span> 'c.relname '$1)
                                                 (<span style="color: #98fb98; font-weight: bold;">:&gt;</span> 'a.attnum 0)
                                                 (<span style="color: #98fb98; font-weight: bold;">:=</span> 'a.attrelid 'c.oid)
                                                 (<span style="color: #98fb98; font-weight: bold;">:=</span> 'a.atttypid 'tn.oid)))
                                'a.attnum))))
          (query select-query
                 (to-sql-name table-name))))
</pre>
</div>
</div>
</div>
