doc/s-sql.org
*** Approach #3 Use :raw
     :PROPERTIES:
     :CUSTOM_ID: f0c37b97-4907-4153-bdfb-3381ae4a08d7
     :END:

To quote Marijn, the :raw keyword takes a string and inserts it straight
into the query. I try to stay away from :raw if possible, but
sometimes...

#+BEGIN_SRC lisp
(query (:select (:raw "tmp1.name") :from (:as 'baz (:raw "tmp1"))))
#+END_SRC

*** Queries with User Input
    :PROPERTIES:
    :CUSTOM_ID: queries-with-user-input
    :ID:       db5db32e-31b5-424e-8cb8-97bb88029515
    :END:

In any of the above approaches to building queries you will need to
ensure that either you have control over the inputs or they still result
in parameterized queries. If not, you have opened yourself up to an sql
injection attack.
