doc/s-sql.html

<div id="outline-container-org65ab741" class="outline-4">
<h4 id="f0c37b97-4907-4153-bdfb-3381ae4a08d7"><a id="org65ab741"></a>Approach #3 Use :raw</h4>
<div class="outline-text-4" id="text-f0c37b97-4907-4153-bdfb-3381ae4a08d7">
<p>
To quote Marijn, the :raw keyword takes a string and inserts it straight
into the query. I try to stay away from :raw if possible, but
sometimes&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:select</span> (<span style="color: #98fb98; font-weight: bold;">:raw</span> <span style="color: #cd8162;">"tmp1.name"</span>) <span style="color: #98fb98; font-weight: bold;">:from</span> (<span style="color: #98fb98; font-weight: bold;">:as</span> 'baz (<span style="color: #98fb98; font-weight: bold;">:raw</span> <span style="color: #cd8162;">"tmp1"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c114c7" class="outline-4">
<h4 id="queries-with-user-input"><a id="org3c114c7"></a><a id="ID-db5db32e-31b5-424e-8cb8-97bb88029515"></a>Queries with User Input</h4>
<div class="outline-text-4" id="text-queries-with-user-input">
<p>
In any of the above approaches to building queries you will need to
ensure that either you have control over the inputs or they still result
in parameterized queries. If not, you have opened yourself up to an sql
injection attack.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
